{
  "title": "Daniel's bookshelf: all",
  "items": [
    {
      "id": "https://www.goodreads.com/review/show/7794599991?utm_medium=api&utm_source=rss",
      "title": "Fool's Fate (Tawny Man, #3)",
      "link": "https://www.goodreads.com/review/show/7794599991?utm_medium=api&utm_source=rss",
      "bookId": "45108",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1388181998l/45108._SY75_.jpg",
      "bookDescription": "The triumphant conclusion to the Tawny Man trilogy, from the author of the bestselling Farseer and Liveship Traders trilogies. The moving end to the tale of the Farseers, in which kingdoms must stand or fall on the beat of a dragon's wings, or a Fool's heart. A small and sadly untried coterie - the old assassin Chade, the serving-boy Thick, Prince Dutiful, and his reluctant Skillmaster, Fitz - sail towards the distant island of Aslevjal. There they must fulfil the Narcheska's challenge to her betrothed: to lay the head of the dragon Icefyre, whom legends tell is buried there deep beneath the ice, upon her hearth. Only with the completion of this quest can the marriage proceed, and the resulting alliance signal an end to war between the two kingdoms. It is not a happy ship: tensions between the folk of the Six Duchies and their traditional enemies, the Outislanders, lie just beneath the surface. Thick is constantly ill, and his random but powerful Skilling has taken on a dark and menacing tone, while Chade's fascination with the Skill is growing to the point of obsession. Having ensured that his beloved friend the Fool is safely left behind in Buckkeep, Fitz is guilt-stricken; but he is determined to keep his fate at bay, since prophecy foretells the Fool's death if he ever sets foot on the isle of the black dragon. But as their ship draws in towards Aslevjal a lone figure awaits them...",
      "authorName": "Robin Hobb",
      "isbn": "0553582461",
      "userName": "Daniel",
      "userRating": "0",
      "userReadAt": "",
      "userDateAdded": "2025-08-02T19:06:03.000Z",
      "userDateCreated": "2025-08-02T19:06:03.000Z",
      "userShelves": "currently-reading",
      "userReview": "",
      "averageRating": "4.5",
      "bookPublished": "2003",
      "description": "<a href=\"https://www.goodreads.com/book/show/45108.Fool_s_Fate?utm_medium=api&amp;utm_source=rss\"><img alt=\"Fool&#39;s Fate (Tawny Man, #3)\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1388181998l/45108._SY75_.jpg\" /></a><br/>\n                                      author: Robin Hobb<br/>\n                                      name: Daniel<br/>\n                                      average rating: 4.5<br/>\n                                      book published: 2003<br/>\n                                      rating: 0<br/>\n                                      read at: <br/>\n                                      date added: 2025/08/02<br/>\n                                      shelves: currently-reading<br/>\n                                      review: <br/><br/>",
      "numPages": "914"
    },
    {
      "id": "https://www.goodreads.com/review/show/7778045634?utm_medium=api&utm_source=rss",
      "title": "Golden Fool (Tawny Man, #2)",
      "link": "https://www.goodreads.com/review/show/7778045634?utm_medium=api&utm_source=rss",
      "bookId": "45109",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1388182007l/45109._SY75_.jpg",
      "bookDescription": "The acclaimed <i>Farseer</i> and <i>Liveship Traders</i> trilogies established Robin Hobb as one of the most splendidly imaginative practitioners of world-class fantasy. <br /><br />Now, in Book 2 of her most stunning trilogy yet, Hobb continues the soul-shattering tale of FitzChivalry Farseer. With rich characters, breathtaking magic, and sweeping action, <b>Golden Fool</b> brings the reluctant adventurer further into the fray in an epic of sacrifice, salvation, and untold treachery.<br /><br /><b>Golden Fool<br /><br /></b>Prince Dutiful has been rescued from his Piebald kidnappers and the court has resumed its normal rhythms. But for FitzChivalry Farseer, a return to isolation is impossible. Though gutted by the loss of his wolf bondmate, Nighteyes, Fitz must take up residence at Buckkeep and resume his tasks as Chade’s apprentice assassin. Posing as Tom Badgerlock, bodyguard to Lord Golden, FitzChivalry becomes the eyes and ears behind the walls. And with his old mentor failing visibly, Fitz is forced to take on more burdens as he attempts to guide a kingdom straying closer to civil strife each day.<br /><br />The problems are legion. Prince Dutiful’s betrothal to the Narcheska Elliania of the Out Islands is fraught with tension, and the Narcheska herself appears to be hiding an array of secrets. Then, amid Piebald threats and the increasing persecution of the Witted, FitzChivalry must ensure that no one betrays the Prince’s secret—a secret that could topple the Farseer throne: that he, like Fitz, possesses the dread “beast magic.”<br /><br />Meanwhile, FitzChivalry must impart to the Prince his limited knowledge of the Skill: the hereditary and addictive magic of the Farseers. In the process, they discover within Buckkeep one who has a wild and powerful talent for it, and whose enmity for Fitz may have disastrous consequences for all.<br /><br />Only Fitz’s enduring friendship with the Fool brings him any solace. But even that is shattered when unexpected visitors from Bingtown reveal devastating secrets from the Fool’s past. Now, bereft of support and adrift in intrigue, Fitz’s biggest challenge may be simply to survive the inescapable and violent path that fate has laid out for him.<br /><br /><br /><i>From the Hardcover edition.</i>",
      "authorName": "Robin Hobb",
      "isbn": "0553582453",
      "userName": "Daniel",
      "userRating": "5",
      "userReadAt": "2025-08-02T00:00:00.000Z",
      "userDateAdded": "2025-08-02T19:05:35.000Z",
      "userDateCreated": "2025-07-28T05:25:22.000Z",
      "userShelves": "",
      "userReview": "",
      "averageRating": "4.3",
      "bookPublished": "2002",
      "description": "<a href=\"https://www.goodreads.com/book/show/45109.Golden_Fool?utm_medium=api&amp;utm_source=rss\"><img alt=\"Golden Fool (Tawny Man, #2)\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1388182007l/45109._SY75_.jpg\" /></a><br/>\n                                      author: Robin Hobb<br/>\n                                      name: Daniel<br/>\n                                      average rating: 4.3<br/>\n                                      book published: 2002<br/>\n                                      rating: 5<br/>\n                                      read at: 2025/08/02<br/>\n                                      date added: 2025/08/02<br/>\n                                      shelves: <br/>\n                                      review: <br/><br/>",
      "numPages": "709"
    },
    {
      "id": "https://www.goodreads.com/review/show/7787387252?utm_medium=api&utm_source=rss",
      "title": "An Immense World: How Animal Senses Reveal the Hidden Realms Around Us",
      "link": "https://www.goodreads.com/review/show/7787387252?utm_medium=api&utm_source=rss",
      "bookId": "59575939",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1652105350l/59575939._SY75_.jpg",
      "bookDescription": "<b>\n  <b></b>\n  <b>A grand tour through the hidden realms of animal senses that will transform the way you perceive the world</b>\n  <b>--from the Pulitzer Prize-winning, <i>New York Times</i> bestselling author of <i>I Contain Multitudes.</i></b>\n</b><br /><br />The Earth teems with sights and textures, sounds and vibrations, smells and tastes, electric and magnetic fields. But every animal is enclosed within its own unique sensory bubble, perceiving but a tiny sliver of an immense world. This book welcomes us into a previously unfathomable dimension--the world as it is truly perceived by other animals.<br /><br />We encounter beetles that are drawn to fires, turtles that can track the Earth's magnetic fields, fish that fill rivers with electrical messages, and humans that wield sonar like bats. We discover that a crocodile's scaly face is as sensitive as a lover's fingertips, that the eyes of a giant squid evolved to see sparkling whales, that plants thrum with the inaudible songs of courting bugs, and that even simple scallops have complex vision. We learn what bees see in flowers, what songbirds hear in their tunes, and what dogs smell on the street. We listen to stories of pivotal discoveries in the field, while looking ahead at the many mysteries which lie unsolved.<br /><br />In <i>An Immense World</i>, author and acclaimed science journalist Ed Yong coaxes us beyond the confines of our own senses, allowing us to perceive the skeins of scent, waves of electromagnetism, and pulses of pressure that surround us. Because in order to understand our world we don't need to travel to other places; we need to see through other eyes.",
      "authorName": "Ed Yong",
      "isbn": "",
      "userName": "Daniel",
      "userRating": "0",
      "userReadAt": "",
      "userDateAdded": "2025-07-31T08:57:32.000Z",
      "userDateCreated": "2025-07-31T08:57:31.000Z",
      "userShelves": "on-deck",
      "userReview": "",
      "averageRating": "4.5",
      "bookPublished": "2022",
      "description": "<a href=\"https://www.goodreads.com/book/show/59575939-an-immense-world?utm_medium=api&amp;utm_source=rss\"><img alt=\"An Immense World: How Animal Senses Reveal the Hidden Realms Around Us\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1652105350l/59575939._SY75_.jpg\" /></a><br/>\n                                      author: Ed Yong<br/>\n                                      name: Daniel<br/>\n                                      average rating: 4.5<br/>\n                                      book published: 2022<br/>\n                                      rating: 0<br/>\n                                      read at: <br/>\n                                      date added: 2025/07/31<br/>\n                                      shelves: on-deck<br/>\n                                      review: <br/><br/>",
      "numPages": "464"
    },
    {
      "id": "https://www.goodreads.com/review/show/7779769918?utm_medium=api&utm_source=rss",
      "title": "The Wilful Princess and the Piebald Prince",
      "link": "https://www.goodreads.com/review/show/7779769918?utm_medium=api&utm_source=rss",
      "bookId": "18947068",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1654573388l/18947068._SX50_.jpg",
      "bookDescription": "<p>Internationally-bestselling, critically-acclaimed author Robin Hobb takes readers deep into the history behind the Farseer series in this exclusive, new novella.</p><p>One of the darkest legends in the Realm of the Elderlings recounts the tale of the so-called Piebald Prince, a Witted pretender to the throne unseated by the actions of brave nobles so that the Farseer line could continue untainted. Now the truth behind the story is revealed through the account of Felicity, a low-born companion of the Princess Caution at Buckkeep.</p><p>With Felicity by her side, Caution grows into a headstrong Queen-in-Waiting. But when Caution gives birth to a bastard son who shares the piebald markings of his father s horse, Felicity is the one who raises him. And as the prince comes to power, political intrigue sparks dangerous whispers about the Wit that will change the kingdom forever…</p><p>Internationally-bestselling, critically-acclaimed author Robin Hobb takes readers deep into the history behind the Farseer series in this exclusive, new novella, 'The Willful Princess and the Piebald Prince.' In her trademark style, Hobb offers a revealing exploration of a family secret still reverberating generations later when assassin FitzChivalry Farseer comes onto the scene. Fans will not want to miss these tantalizing new insights into a much-beloved world and its unforgettable characters.</p>",
      "authorName": "Robin Hobb",
      "isbn": "0007498152",
      "userName": "Daniel",
      "userRating": "5",
      "userReadAt": "2025-07-28T00:00:00.000Z",
      "userDateAdded": "2025-07-29T05:40:33.000Z",
      "userDateCreated": "2025-07-28T20:02:15.000Z",
      "userShelves": "",
      "userReview": "",
      "averageRating": "4.1",
      "bookPublished": "2013",
      "description": "<a href=\"https://www.goodreads.com/book/show/18947068-the-wilful-princess-and-the-piebald-prince?utm_medium=api&amp;utm_source=rss\"><img alt=\"The Wilful Princess and the Piebald Prince\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1654573388l/18947068._SX50_.jpg\" /></a><br/>\n                                      author: Robin Hobb<br/>\n                                      name: Daniel<br/>\n                                      average rating: 4.1<br/>\n                                      book published: 2013<br/>\n                                      rating: 5<br/>\n                                      read at: 2025/07/28<br/>\n                                      date added: 2025/07/28<br/>\n                                      shelves: <br/>\n                                      review: <br/><br/>",
      "numPages": "240"
    },
    {
      "id": "https://www.goodreads.com/review/show/7778216484?utm_medium=api&utm_source=rss",
      "title": "When Minds Converse: A Social Genealogy of the Human Soul",
      "link": "https://www.goodreads.com/review/show/7778216484?utm_medium=api&utm_source=rss",
      "bookId": "223629149",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1736878461l/223629149._SY75_.jpg",
      "bookDescription": "When Minds Converse argues that we do not speak because our human minds are special; our minds are special because we can speak. It maintains that six capacities characteristic of our species emerge as social skills in conversing with one another and that we internalize those skills in mentally communing with ourselves in thought. Philip Pettit defends a society-first view of the human mind and more broadly, the human soul, gesturing at how this philosophical anthropology can support universal ideals of equality, respect and freedom.<br /><br />Three of the abilities the book targets involve informational processing. Our capacity to update our beliefs and other attitudes intentionally, seeking out the judgments that we ought to make and the attitudes we ought to hold. Our capacity to rely on intentional reasoning, looking for the grounds on which to support judgments and looking at what our judgments in turn support. And our ability to direct perception intentionally, as we recruit it to the service of those capacities and learn to distinguish between appearance and reality. The other three capacities addressed have a relational character. Our ability to establish and uphold standards and values for one another and for ourselves, making tacit commitments to live by them. Our ability to ascribe and assume accountability, holding one another and ourselves responsible to those norms and values. And our ability to assume the status of persons, embracing the implications of those commitments in the persona we hold out to others, and indeed to ourselves. <br /><br />Pettit offers an empirically informed but philosophical defence of his view. In an extended thought experiment, a conceptual genealogy, he explores the likely, unplanned effects that the first appearance of language would have on the minds of humanoid creatures otherwise like us. The argument is that they would evolve a range of conversive practices and that the skills elicited by those practices are good models of the capacities targeted here. The genealogy does not try to explain how those practices and skills evolved among our forebears but, relying on the lessons of the thought experiment, seeks to shed light on their nature and role in our social and mental life.",
      "authorName": "Philip Pettit",
      "isbn": "019886311X",
      "userName": "Daniel",
      "userRating": "0",
      "userReadAt": "",
      "userDateAdded": "2025-07-28T07:47:01.000Z",
      "userDateCreated": "2025-07-28T07:46:55.000Z",
      "userShelves": "on-deck",
      "userReview": "",
      "averageRating": "0.0",
      "bookPublished": "",
      "description": "<a href=\"https://www.goodreads.com/book/show/223629149-when-minds-converse?utm_medium=api&amp;utm_source=rss\"><img alt=\"When Minds Converse: A Social Genealogy of the Human Soul\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1736878461l/223629149._SY75_.jpg\" /></a><br/>\n                                      author: Philip Pettit<br/>\n                                      name: Daniel<br/>\n                                      average rating: 0.0<br/>\n                                      book published: <br/>\n                                      rating: 0<br/>\n                                      read at: <br/>\n                                      date added: 2025/07/28<br/>\n                                      shelves: on-deck<br/>\n                                      review: <br/><br/>",
      "numPages": "384"
    },
    {
      "id": "https://www.goodreads.com/review/show/6930615807?utm_medium=api&utm_source=rss",
      "title": "Fool's Errand (Tawny Man, #1)",
      "link": "https://www.goodreads.com/review/show/6930615807?utm_medium=api&utm_source=rss",
      "bookId": "68488",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1360508839l/68488._SY75_.jpg",
      "bookDescription": "<i>alternate cover for ISBN <a href=\"https://www.goodreads.com/search/search?q=9780006486015\" title=\"9780006486015\" rel=\"nofollow noopener\">9780006486015</a></i><br /><br />Fifteen years have passed since the end of the Red Ship War with the terrifying Outislanders. Since then, Fitz has wandered the world accompanied only by his wolf and Wit-partner, Nighteyes, finally settling in a tiny cottage as remote from Buckkeep and the Farseers as possible.<br /><br />But lately the world has come crashing in again. The Witted are being persecuted because of their magical bonds with animals; and young Prince Dutiful has gone missing just before his crucial diplomatic wedding to an Outislander princess. Fitz’s assignment to fetch Dutiful back in time for the ceremony seems very much like a fool’s errand, but the dangers ahead could signal the end of the Farseer reign.<br /><br />Cover illustration by John Howe<br /><br />",
      "authorName": "Robin Hobb",
      "isbn": "",
      "userName": "Daniel",
      "userRating": "5",
      "userReadAt": "2025-07-27T00:00:00.000Z",
      "userDateAdded": "2025-07-28T05:17:10.000Z",
      "userDateCreated": "2024-10-16T08:44:59.000Z",
      "userShelves": "",
      "userReview": "",
      "averageRating": "4.3",
      "bookPublished": "2001",
      "description": "<a href=\"https://www.goodreads.com/book/show/68488.Fool_s_Errand?utm_medium=api&amp;utm_source=rss\"><img alt=\"Fool&#39;s Errand (Tawny Man, #1)\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1360508839l/68488._SY75_.jpg\" /></a><br/>\n                                      author: Robin Hobb<br/>\n                                      name: Daniel<br/>\n                                      average rating: 4.3<br/>\n                                      book published: 2001<br/>\n                                      rating: 5<br/>\n                                      read at: 2025/07/27<br/>\n                                      date added: 2025/07/27<br/>\n                                      shelves: <br/>\n                                      review: <br/><br/>",
      "numPages": "661"
    },
    {
      "id": "https://www.goodreads.com/review/show/7769699639?utm_medium=api&utm_source=rss",
      "title": "The War on Science: Thirty-Nine Renowned Scientists and Scholars Speak Out About Current Threats to Free Speech, Open Inquiry, and the Scientific Process",
      "link": "https://www.goodreads.com/review/show/7769699639?utm_medium=api&utm_source=rss",
      "bookId": "227828306",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1741753585l/227828306._SY75_.jpg",
      "bookDescription": "",
      "authorName": "Lawrence M. Krauss",
      "isbn": "",
      "userName": "Daniel",
      "userRating": "0",
      "userReadAt": "",
      "userDateAdded": "2025-07-25T08:29:07.000Z",
      "userDateCreated": "2025-07-25T08:29:02.000Z",
      "userShelves": "on-deck",
      "userReview": "",
      "averageRating": "2.0",
      "bookPublished": "",
      "description": "<a href=\"https://www.goodreads.com/book/show/227828306-the-war-on-science?utm_medium=api&amp;utm_source=rss\"><img alt=\"The War on Science: Thirty-Nine Renowned Scientists and Scholars Speak Out About Current Threats to Free Speech, Open Inquiry, and the Scientific Process\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1741753585l/227828306._SY75_.jpg\" /></a><br/>\n                                      author: Lawrence M. Krauss<br/>\n                                      name: Daniel<br/>\n                                      average rating: 2.0<br/>\n                                      book published: <br/>\n                                      rating: 0<br/>\n                                      read at: <br/>\n                                      date added: 2025/07/25<br/>\n                                      shelves: on-deck<br/>\n                                      review: <br/><br/>",
      "numPages": "480"
    },
    {
      "id": "https://www.goodreads.com/review/show/1052402754?utm_medium=api&utm_source=rss",
      "title": "A Universe from Nothing: Why There Is Something Rather Than Nothing",
      "link": "https://www.goodreads.com/review/show/1052402754?utm_medium=api&utm_source=rss",
      "bookId": "11337189",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1365217267l/11337189._SY75_.jpg",
      "bookDescription": "Bestselling author and acclaimed physicist Lawrence Krauss offers a paradigm-shifting view of how everything that exists came to be in the first place.<br /><br />“Where did the universe come from? What was there before it? What will the future bring? And finally, why is there something rather than nothing?”<br /><br />One of the few prominent scientists today to have crossed the chasm between science and popular culture, Krauss describes the staggeringly beautiful experimental observations and mind-bending new theories that demonstrate not only can something arise from nothing, something will always arise from nothing. With a new preface about the significance of the discovery of the Higgs particle, A Universe from Nothing uses Krauss’s characteristic wry humor and wonderfully clear explanations to take us back to the beginning of the beginning, presenting the most recent evidence for how our universe evolved—and the implications for how it’s going to end. <br /><br />Provocative, challenging, and delightfully readable, this is a game-changing look at the most basic underpinning of existence and a powerful antidote to outmoded philosophical, religious, and scientific thinking.",
      "authorName": "Lawrence M. Krauss",
      "isbn": "145162445X",
      "userName": "Daniel",
      "userRating": "0",
      "userReadAt": "",
      "userDateAdded": "2025-07-25T08:28:30.000Z",
      "userDateCreated": "2014-09-11T22:29:36.000Z",
      "userShelves": "on-deck",
      "userReview": "",
      "averageRating": "3.9",
      "bookPublished": "2012",
      "description": "<a href=\"https://www.goodreads.com/book/show/11337189-a-universe-from-nothing?utm_medium=api&amp;utm_source=rss\"><img alt=\"A Universe from Nothing: Why There Is Something Rather Than Nothing\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1365217267l/11337189._SY75_.jpg\" /></a><br/>\n                                      author: Lawrence M. Krauss<br/>\n                                      name: Daniel<br/>\n                                      average rating: 3.9<br/>\n                                      book published: 2012<br/>\n                                      rating: 0<br/>\n                                      read at: <br/>\n                                      date added: 2025/07/25<br/>\n                                      shelves: on-deck<br/>\n                                      review: <br/><br/>",
      "numPages": "204"
    },
    {
      "id": "https://www.goodreads.com/review/show/4616257872?utm_medium=api&utm_source=rss",
      "title": "The Hacker and the State: Cyber Attacks and the New Normal of Geopolitics",
      "link": "https://www.goodreads.com/review/show/4616257872?utm_medium=api&utm_source=rss",
      "bookId": "51589806",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1574911946l/51589806._SX50_SY75_.jpg",
      "bookDescription": "Packed with insider information based on interviews, declassified files, and forensic analysis of company reports, <i>The Hacker and the State</i> sets aside fantasies of cyber-annihilation to explore the real geopolitical competition of the digital age. Tracing the conflict of wills and interests among modern nations, Ben Buchanan reveals little-known details of how China, Russia, North Korea, Britain, and the United States hack one another in a relentless struggle for dominance. His analysis moves deftly from underseas cable taps to underground nuclear sabotage, from blackouts and data breaches to billion-dollar heists and election interference.<br /><br />Buchanan brings to life this continuous cycle of espionage and deception, attack and counterattack, destabilization and retaliation. He explains why cyber attacks are far less destructive than we anticipated, far more pervasive, and much harder to prevent. With little fanfare and far less scrutiny, they impact our banks, our tech and health systems, our democracy, and every aspect of our lives. Quietly, insidiously, they have reshaped our national-security priorities and transformed spycraft and statecraft.<br /><br />The contest for geopolitical advantage has moved into cyberspace. The United States and its allies can no longer dominate the way they once did. The nation that hacks best will triumph.",
      "authorName": "Ben  Buchanan",
      "isbn": "0674987551",
      "userName": "Daniel",
      "userRating": "4",
      "userReadAt": "2025-07-22T00:00:00.000Z",
      "userDateAdded": "2025-07-23T05:37:36.000Z",
      "userDateCreated": "2022-03-18T22:52:30.000Z",
      "userShelves": "",
      "userReview": "",
      "averageRating": "4.2",
      "bookPublished": "2020",
      "description": "<a href=\"https://www.goodreads.com/book/show/51589806-the-hacker-and-the-state?utm_medium=api&amp;utm_source=rss\"><img alt=\"The Hacker and the State: Cyber Attacks and the New Normal of Geopolitics\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1574911946l/51589806._SX50_SY75_.jpg\" /></a><br/>\n                                      author: Ben  Buchanan<br/>\n                                      name: Daniel<br/>\n                                      average rating: 4.2<br/>\n                                      book published: 2020<br/>\n                                      rating: 4<br/>\n                                      read at: 2025/07/22<br/>\n                                      date added: 2025/07/22<br/>\n                                      shelves: <br/>\n                                      review: <br/><br/>",
      "numPages": "384"
    },
    {
      "id": "https://www.goodreads.com/review/show/6534489332?utm_medium=api&utm_source=rss",
      "title": "Why We Remember: Unlocking Memory's Power to Hold on to What Matters",
      "link": "https://www.goodreads.com/review/show/6534489332?utm_medium=api&utm_source=rss",
      "bookId": "157981712",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1699034966l/157981712._SY75_.jpg",
      "bookDescription": "Memory is far more than a record of the past. In this groundbreaking tour of the mind and brain, one of the world’s top memory researchers reveals the powerful role memory plays in nearly every aspect of our lives, from recalling faces and names, to learning, decision-making, trauma and healing.<br /><br />A new understanding of memory is emerging from the latest scientific research. In Why We Remember , pioneering neuroscientist and psychologist Charan Ranganath radically reframes the way we think about the everyday act of remembering. Combining accessible language with cutting-edge research, he reveals the surprising ways our brains record the past and how we use that information to understand who we are in the present, and to imagine and plan for the future.<br /><br />Memory, Dr. Ranganath shows, is a highly transformative force that shapes how we experience the world in often invisible and sometimes destructive ways. Knowing this can help us with daily remembering tasks, like finding our keys, and with the challenge of memory loss as we age. What’s more, when we work with the brain’s ability to learn and reinterpret past events, we can heal trauma, shed our biases, learn faster, and grow in self-awareness.<br /><br />Including fascinating studies and examples from pop culture, and drawing on Ranganath’s life as a scientist, father, and child of immigrants, Why We Remember is a captivating read that unveils the hidden role memory plays throughout our lives. When we understand its power-- and its quirks--we can cut through the clutter and remember the things we want to remember. We can make freer choices and plan a happier future.",
      "authorName": "Charan Ranganath",
      "isbn": "038554863X",
      "userName": "Daniel",
      "userRating": "5",
      "userReadAt": "2025-07-21T00:00:00.000Z",
      "userDateAdded": "2025-07-22T05:08:28.000Z",
      "userDateCreated": "2024-05-26T07:20:54.000Z",
      "userShelves": "",
      "userReview": "",
      "averageRating": "3.9",
      "bookPublished": "2024",
      "description": "<a href=\"https://www.goodreads.com/book/show/157981712-why-we-remember?utm_medium=api&amp;utm_source=rss\"><img alt=\"Why We Remember: Unlocking Memory&#39;s Power to Hold on to What Matters\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1699034966l/157981712._SY75_.jpg\" /></a><br/>\n                                      author: Charan Ranganath<br/>\n                                      name: Daniel<br/>\n                                      average rating: 3.9<br/>\n                                      book published: 2024<br/>\n                                      rating: 5<br/>\n                                      read at: 2025/07/21<br/>\n                                      date added: 2025/07/21<br/>\n                                      shelves: <br/>\n                                      review: <br/><br/>",
      "numPages": "304"
    },
    {
      "id": "https://www.goodreads.com/review/show/7556776088?utm_medium=api&utm_source=rss",
      "title": "The Angel of the Crows",
      "link": "https://www.goodreads.com/review/show/7556776088?utm_medium=api&utm_source=rss",
      "bookId": "52378874",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1577250958l/52378874._SX50_SY75_.jpg",
      "bookDescription": "<i>This is not the story you think it is. These are not the characters you think they are. This is not the book you are expecting.</i><br /><br />In an alternate 1880s London, angels inhabit every public building, and vampires and werewolves walk the streets with human beings under a well-regulated truce. A fantastic utopia, except for a few things: Angels can Fall, and that Fall is like a nuclear bomb in both the physical and metaphysical worlds. And human beings remain human, with all their kindness and greed and passions and murderous intent.<br /><br />Jack the Ripper stalks the streets of this London too. But this London has an Angel. The Angel of the Crows.",
      "authorName": "Katherine Addison",
      "isbn": "0765387395",
      "userName": "Daniel",
      "userRating": "4",
      "userReadAt": "2025-07-21T00:00:00.000Z",
      "userDateAdded": "2025-07-21T17:56:24.000Z",
      "userDateCreated": "2025-05-10T02:26:17.000Z",
      "userShelves": "",
      "userReview": "",
      "averageRating": "3.7",
      "bookPublished": "2020",
      "description": "<a href=\"https://www.goodreads.com/book/show/52378874-the-angel-of-the-crows?utm_medium=api&amp;utm_source=rss\"><img alt=\"The Angel of the Crows\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1577250958l/52378874._SX50_SY75_.jpg\" /></a><br/>\n                                      author: Katherine Addison<br/>\n                                      name: Daniel<br/>\n                                      average rating: 3.7<br/>\n                                      book published: 2020<br/>\n                                      rating: 4<br/>\n                                      read at: 2025/07/21<br/>\n                                      date added: 2025/07/21<br/>\n                                      shelves: <br/>\n                                      review: <br/><br/>",
      "numPages": "448"
    },
    {
      "id": "https://www.goodreads.com/review/show/7748579618?utm_medium=api&utm_source=rss",
      "title": "Ancillary Mercy (Imperial Radch, #3)",
      "link": "https://www.goodreads.com/review/show/7748579618?utm_medium=api&utm_source=rss",
      "bookId": "23533039",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1493642929l/23533039._SX50_.jpg",
      "bookDescription": "<i>Ancillary Mercy</i> is the third book in the trilogy that began with <i>Ancillary Justice</i>.<br /><br />For a moment, things seemed to be under control for Breq, the soldier who used to be a warship. Then a search of Athoek Station's slums turns up someone who shouldn't exist and a messenger from the mysterious Presger empire arrives, as does Breq's old enemy, the divided, heavily armed, and possibly insane Anaander Mianaai—ruler of an empire at war with itself.<br /><br />Breq could flee with her ship and crew, but that would leave the people of Athoek in terrible danger. Breq has a desperate plan. The odds aren't good, but that's never stopped her before.",
      "authorName": "Ann Leckie",
      "isbn": "",
      "userName": "Daniel",
      "userRating": "4",
      "userReadAt": "2025-07-19T00:00:00.000Z",
      "userDateAdded": "2025-07-19T07:54:59.000Z",
      "userDateCreated": "2025-07-18T03:34:24.000Z",
      "userShelves": "",
      "userReview": "",
      "averageRating": "4.2",
      "bookPublished": "2015",
      "description": "<a href=\"https://www.goodreads.com/book/show/23533039-ancillary-mercy?utm_medium=api&amp;utm_source=rss\"><img alt=\"Ancillary Mercy (Imperial Radch, #3)\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1493642929l/23533039._SX50_.jpg\" /></a><br/>\n                                      author: Ann Leckie<br/>\n                                      name: Daniel<br/>\n                                      average rating: 4.2<br/>\n                                      book published: 2015<br/>\n                                      rating: 4<br/>\n                                      read at: 2025/07/19<br/>\n                                      date added: 2025/07/19<br/>\n                                      shelves: <br/>\n                                      review: <br/><br/>",
      "numPages": "328"
    },
    {
      "id": "https://www.goodreads.com/review/show/7742958677?utm_medium=api&utm_source=rss",
      "title": "Ancillary Sword (Imperial Radch, #2)",
      "link": "https://www.goodreads.com/review/show/7742958677?utm_medium=api&utm_source=rss",
      "bookId": "20706284",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1597476183l/20706284._SY75_.jpg",
      "bookDescription": "<i>Ancillary Sword</i> is the sequel to <i>Ancillary Justice</i>, the debut novel which won every major science fiction award in 2014 - and the only novel to have won the Hugo, the Nebula and the Arthur C. Clarke Awards.<br /><br />Breq is a soldier who used to be a warship. Once a weapon of conquest controlling thousands of minds, now she only has a single body and serves the emperor she swore to destroy.<br /><br />Given a new ship and a troublesome crew, Breq is ordered to the only place in the galaxy she will agree to go: Athoek station, to protect the family of a lieutenant she once knew - a lieutenant she murdered in cold blood.<br /><br />",
      "authorName": "Ann Leckie",
      "isbn": "0316246654",
      "userName": "Daniel",
      "userRating": "4",
      "userReadAt": "2025-07-17T00:00:00.000Z",
      "userDateAdded": "2025-07-18T03:32:39.000Z",
      "userDateCreated": "2025-07-16T06:57:19.000Z",
      "userShelves": "",
      "userReview": "",
      "averageRating": "4.1",
      "bookPublished": "2014",
      "description": "<a href=\"https://www.goodreads.com/book/show/20706284-ancillary-sword?utm_medium=api&amp;utm_source=rss\"><img alt=\"Ancillary Sword (Imperial Radch, #2)\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1597476183l/20706284._SY75_.jpg\" /></a><br/>\n                                      author: Ann Leckie<br/>\n                                      name: Daniel<br/>\n                                      average rating: 4.1<br/>\n                                      book published: 2014<br/>\n                                      rating: 4<br/>\n                                      read at: 2025/07/17<br/>\n                                      date added: 2025/07/17<br/>\n                                      shelves: <br/>\n                                      review: <br/><br/>",
      "numPages": "359"
    },
    {
      "id": "https://www.goodreads.com/review/show/7725458680?utm_medium=api&utm_source=rss",
      "title": "Ancillary Justice (Imperial Radch, #1)",
      "link": "https://www.goodreads.com/review/show/7725458680?utm_medium=api&utm_source=rss",
      "bookId": "17333324",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1397215917l/17333324._SY75_.jpg",
      "bookDescription": "(Alternate cover edition of ISBN 031624662X / 9780316246620.) <br /><br />On a remote, icy planet, the soldier known as Breq is drawing closer to completing her quest. <br /><br />Once, she was the Justice of Toren - a colossal starship with an artificial intelligence linking thousands of soldiers in the service of the Radch, the empire that conquered the galaxy. <br /><br />Now, an act of treachery has ripped it all away, leaving her with one fragile human body, unanswered questions, and a burning desire for vengeance.",
      "authorName": "Ann Leckie",
      "isbn": "",
      "userName": "Daniel",
      "userRating": "5",
      "userReadAt": "2025-07-14T00:00:00.000Z",
      "userDateAdded": "2025-07-15T06:34:58.000Z",
      "userDateCreated": "2025-07-10T05:13:02.000Z",
      "userShelves": "",
      "userReview": "",
      "averageRating": "4.0",
      "bookPublished": "2013",
      "description": "<a href=\"https://www.goodreads.com/book/show/17333324-ancillary-justice?utm_medium=api&amp;utm_source=rss\"><img alt=\"Ancillary Justice (Imperial Radch, #1)\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1397215917l/17333324._SY75_.jpg\" /></a><br/>\n                                      author: Ann Leckie<br/>\n                                      name: Daniel<br/>\n                                      average rating: 4.0<br/>\n                                      book published: 2013<br/>\n                                      rating: 5<br/>\n                                      read at: 2025/07/14<br/>\n                                      date added: 2025/07/14<br/>\n                                      shelves: <br/>\n                                      review: <br/><br/>",
      "numPages": "386"
    },
    {
      "id": "https://www.goodreads.com/review/show/508221504?utm_medium=api&utm_source=rss",
      "title": "The Algebraist",
      "link": "https://www.goodreads.com/review/show/508221504?utm_medium=api&utm_source=rss",
      "bookId": "12009",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1388530602l/12009._SX50_.jpg",
      "bookDescription": "It is 4034. Humanity has made it to the stars. Fassin Taak, a Slow Seer at the Court of the Nasqueron Dwellers, will be fortunate if he makes it to the end of the year. The Nasqueron Dwellers inhabit a gas giant on the outskirts of the galaxy, in a system awaiting its wormhole connection to the rest of civilization. In the meantime, they are dismissed as decadents living in a state of highly developed barbarism, hoarding data without order, hunting their own young &amp; fighting pointless formal wars. Seconded to a military-religious order he's barely heard of—part of the baroque hierarchy of the Mercatoria, the latest galactic hegemony— Taak has to travel again amongst the Dwellers. He is in search of a secret hidden for half a billion years. But with each day that passes a war draws closer—a war threatening to overwhelm everything &amp; everyone he's ever known.",
      "authorName": "Iain M. Banks",
      "isbn": "1597800449",
      "userName": "Daniel",
      "userRating": "5",
      "userReadAt": "2025-07-11T00:00:00.000Z",
      "userDateAdded": "2025-07-12T06:38:43.000Z",
      "userDateCreated": "2013-01-16T18:31:54.000Z",
      "userShelves": "",
      "userReview": "",
      "averageRating": "4.0",
      "bookPublished": "2004",
      "description": "<a href=\"https://www.goodreads.com/book/show/12009.The_Algebraist?utm_medium=api&amp;utm_source=rss\"><img alt=\"The Algebraist\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1388530602l/12009._SX50_.jpg\" /></a><br/>\n                                      author: Iain M. Banks<br/>\n                                      name: Daniel<br/>\n                                      average rating: 4.0<br/>\n                                      book published: 2004<br/>\n                                      rating: 5<br/>\n                                      read at: 2025/07/11<br/>\n                                      date added: 2025/07/11<br/>\n                                      shelves: <br/>\n                                      review: <br/><br/>",
      "numPages": "434"
    },
    {
      "id": "https://www.goodreads.com/review/show/6587565218?utm_medium=api&utm_source=rss",
      "title": "Parable of the Sower (Earthseed, #1)",
      "link": "https://www.goodreads.com/review/show/6587565218?utm_medium=api&utm_source=rss",
      "bookId": "52397",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1442169447l/52397._SY75_.jpg",
      "bookDescription": "In 2024, with the world descending into madness and anarchy, one woman begins a fateful journey toward a better future.<br /><br />Lauren Olamina and her family live in one of the only safe neighborhoods remaining on the outskirts of Los Angeles. Behind the walls of their defended enclave, Lauren’s father, a preacher, and a handful of other citizens try to salvage what remains of a culture that has been destroyed by drugs, disease, war, and chronic water shortages. While her father tries to lead people on the righteous path, Lauren struggles with hyperempathy, a condition that makes her extraordinarily sensitive to the pain of others.<br /><br />When fire destroys their compound, Lauren’s family is killed and she is forced out into a world that is fraught with danger. With a handful of other refugees, Lauren must make her way north to safety, along the way conceiving a revolutionary idea that may mean salvation for all mankind.",
      "authorName": "Octavia E. Butler",
      "isbn": "0446675504",
      "userName": "Daniel",
      "userRating": "0",
      "userReadAt": "",
      "userDateAdded": "2025-07-09T07:54:03.000Z",
      "userDateCreated": "2024-06-15T06:06:04.000Z",
      "userShelves": "on-deck",
      "userReview": "",
      "averageRating": "4.2",
      "bookPublished": "1993",
      "description": "<a href=\"https://www.goodreads.com/book/show/52397.Parable_of_the_Sower?utm_medium=api&amp;utm_source=rss\"><img alt=\"Parable of the Sower (Earthseed, #1)\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1442169447l/52397._SY75_.jpg\" /></a><br/>\n                                      author: Octavia E. Butler<br/>\n                                      name: Daniel<br/>\n                                      average rating: 4.2<br/>\n                                      book published: 1993<br/>\n                                      rating: 0<br/>\n                                      read at: <br/>\n                                      date added: 2025/07/09<br/>\n                                      shelves: on-deck<br/>\n                                      review: <br/><br/>",
      "numPages": "345"
    },
    {
      "id": "https://www.goodreads.com/review/show/7719781273?utm_medium=api&utm_source=rss",
      "title": "Dimension of Miracles (Dimension of Miracles #1)",
      "link": "https://www.goodreads.com/review/show/7719781273?utm_medium=api&utm_source=rss",
      "bookId": "668634",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1331708621l/668634._SY75_.jpg",
      "bookDescription": "It had to be somewhere, Carmody knew that much. It was waiting for him, just as he had left it. But where? He only knew he was in the center of a galaxy in a universe of galaxies. Within them lay endless varieties of the planet Earth. And there was only one way to find his Earth he would have to visit each one. And he would have to hurry--because his search for home had turned into a race with death.",
      "authorName": "Robert Sheckley",
      "isbn": "0441148603",
      "userName": "Daniel",
      "userRating": "4",
      "userReadAt": "2025-07-08T00:00:00.000Z",
      "userDateAdded": "2025-07-09T06:28:42.000Z",
      "userDateCreated": "2025-07-08T08:20:04.000Z",
      "userShelves": "",
      "userReview": "",
      "averageRating": "3.9",
      "bookPublished": "1968",
      "description": "<a href=\"https://www.goodreads.com/book/show/668634.Dimension_of_Miracles?utm_medium=api&amp;utm_source=rss\"><img alt=\"Dimension of Miracles (Dimension of Miracles #1)\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1331708621l/668634._SY75_.jpg\" /></a><br/>\n                                      author: Robert Sheckley<br/>\n                                      name: Daniel<br/>\n                                      average rating: 3.9<br/>\n                                      book published: 1968<br/>\n                                      rating: 4<br/>\n                                      read at: 2025/07/08<br/>\n                                      date added: 2025/07/08<br/>\n                                      shelves: <br/>\n                                      review: <br/><br/>",
      "numPages": "214"
    },
    {
      "id": "https://www.goodreads.com/review/show/7720159456?utm_medium=api&utm_source=rss",
      "title": "Language Machines: Cultural AI and the End of Remainder Humanism (Volume 74) (Posthumanities)",
      "link": "https://www.goodreads.com/review/show/7720159456?utm_medium=api&utm_source=rss",
      "bookId": "220457656",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1731561301l/220457656._SY75_.jpg",
      "bookDescription": "",
      "authorName": "Leif Weatherby",
      "isbn": "1517919312",
      "userName": "Daniel",
      "userRating": "0",
      "userReadAt": "",
      "userDateAdded": "2025-07-08T12:52:01.000Z",
      "userDateCreated": "2025-07-08T12:52:01.000Z",
      "userShelves": "to-read",
      "userReview": "",
      "averageRating": "4.3",
      "bookPublished": "",
      "description": "<a href=\"https://www.goodreads.com/book/show/220457656-language-machines?utm_medium=api&amp;utm_source=rss\"><img alt=\"Language Machines: Cultural AI and the End of Remainder Humanism (Volume 74) (Posthumanities)\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1731561301l/220457656._SY75_.jpg\" /></a><br/>\n                                      author: Leif Weatherby<br/>\n                                      name: Daniel<br/>\n                                      average rating: 4.3<br/>\n                                      book published: <br/>\n                                      rating: 0<br/>\n                                      read at: <br/>\n                                      date added: 2025/07/08<br/>\n                                      shelves: to-read<br/>\n                                      review: <br/><br/>",
      "numPages": "264"
    },
    {
      "id": "https://www.goodreads.com/review/show/7710737092?utm_medium=api&utm_source=rss",
      "title": "2054",
      "link": "https://www.goodreads.com/review/show/7710737092?utm_medium=api&utm_source=rss",
      "bookId": "177192243",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1686628439l/177192243._SY75_.jpg",
      "bookDescription": "From the acclaimed authors of the runaway New York Times bestseller 2034 comes another explosive work of speculative fiction set twenty years further in the future, at a moment when a radical leap forward in artificial intelligence combines with America’s violent partisan divide to create an existential threat to the country, and the world<br /><br />It is twenty years after the catastrophic war between the United States and China that brought down the old American political order. A new party has emerged in the US, one that’s held power for over a decade. Efforts to cement its grip have resulted in mounting violent resistance. The American president has control of the media, but he is beginning to lose control of the streets. Many fear he’ll stop at nothing to remain in the White House. Suddenly, he collapses in the middle of an address to the nation. After an initial flurry of misinformation, the administration reluctantly announces his death. A cover-up ensues, conspiracy theories abound, and the country descends into a new type of civil war.<br /><br />A handful of elite actors from the worlds of computer science, intelligence, and business have a fairly good idea what happened. All signs point to a profound breakthrough in AI, of which the remote assassination of an American president is hardly the most game-changing ramification. The trail leads to an outpost in the Amazon rainforest, the last known whereabouts of the tech visionary who predicted this breakthrough. As some of the world’s great powers, old and new, state and nonstate alike, struggle to outmaneuver one another in this new Great Game of scientific discovery, the outcome becomes entangled with the fate of American democracy.<br /><br />Combining a deep understanding of AI, biotech, and the possibility of a coming Singularity, along with their signature geopolitical sophistication, Elliot Ackerman and Admiral James Stavridis have once again written a visionary work. 2054 is a novel that reads like a thriller even as it demands that we consider the trajectory of our society and its potentially calamitous destination.",
      "authorName": "Elliot Ackerman",
      "isbn": "0593489861",
      "userName": "Daniel",
      "userRating": "4",
      "userReadAt": "2025-07-08T00:00:00.000Z",
      "userDateAdded": "2025-07-08T08:02:52.000Z",
      "userDateCreated": "2025-07-05T06:59:59.000Z",
      "userShelves": "",
      "userReview": "",
      "averageRating": "3.2",
      "bookPublished": "2024",
      "description": "<a href=\"https://www.goodreads.com/book/show/177192243-2054?utm_medium=api&amp;utm_source=rss\"><img alt=\"2054\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1686628439l/177192243._SY75_.jpg\" /></a><br/>\n                                      author: Elliot Ackerman<br/>\n                                      name: Daniel<br/>\n                                      average rating: 3.2<br/>\n                                      book published: 2024<br/>\n                                      rating: 4<br/>\n                                      read at: 2025/07/08<br/>\n                                      date added: 2025/07/08<br/>\n                                      shelves: <br/>\n                                      review: <br/><br/>",
      "numPages": "304"
    },
    {
      "id": "https://www.goodreads.com/review/show/7719012560?utm_medium=api&utm_source=rss",
      "title": "Priest of Bones (War for the Rose Throne, #1)",
      "link": "https://www.goodreads.com/review/show/7719012560?utm_medium=api&utm_source=rss",
      "bookId": "37884491",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1517589565l/37884491._SX50_.jpg",
      "bookDescription": "The war is over, and army priest Tomas Piety heads home with Sergeant Bloody Anne at his side. But things have changed while he was away: his crime empire has been stolen and the people of Ellinburg--his people--have run out of food and hope and places to hide. Tomas sets out to reclaim what was his with help from Anne, his brother, Jochan, and his new gang: the Pious Men. But when he finds himself dragged into a web of political intrigue once again, everything gets more complicated.<br /><br />As the Pious Men fight shadowy foreign infiltrators in the back-street taverns, brothels, and gambling dens of Tomas's old life, it becomes clear: <br />The war is only just beginning.",
      "authorName": "Peter McLean",
      "isbn": "0451490215",
      "userName": "Daniel",
      "userRating": "0",
      "userReadAt": "",
      "userDateAdded": "2025-07-08T01:31:55.000Z",
      "userDateCreated": "2025-07-08T01:31:54.000Z",
      "userShelves": "on-deck",
      "userReview": "",
      "averageRating": "3.9",
      "bookPublished": "2018",
      "description": "<a href=\"https://www.goodreads.com/book/show/37884491-priest-of-bones?utm_medium=api&amp;utm_source=rss\"><img alt=\"Priest of Bones (War for the Rose Throne, #1)\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1517589565l/37884491._SX50_.jpg\" /></a><br/>\n                                      author: Peter McLean<br/>\n                                      name: Daniel<br/>\n                                      average rating: 3.9<br/>\n                                      book published: 2018<br/>\n                                      rating: 0<br/>\n                                      read at: <br/>\n                                      date added: 2025/07/07<br/>\n                                      shelves: on-deck<br/>\n                                      review: <br/><br/>",
      "numPages": "331"
    },
    {
      "id": "https://www.goodreads.com/review/show/7710742646?utm_medium=api&utm_source=rss",
      "title": "More Everything Forever: AI Overlords, Space Empires, and Silicon Valley's Crusade to Control the Fate of Humanity",
      "link": "https://www.goodreads.com/review/show/7710742646?utm_medium=api&utm_source=rss",
      "bookId": "212987932",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1719003402l/212987932._SY75_.jpg",
      "bookDescription": "<b>How Silicon Valley’s heartless, baseless, and foolish obsessions—with escaping death, emergent AI tyrants, and limitless growth—pervert public discourse and distract us from real social problems </b><br /><br /> Tech billionaires have decided that they should determine our futures for us. According to Elon Musk, Jeff Bezos, Sam Altman, and more, the only good future for humanity is one powered by trillions of humans living in space, functionally immortal, served by superintelligent AIs.  <br />  <br /> In <i>More Everything Forever</i>, science writer Adam Becker investigates these wildly implausible and often profoundly immoral visions of tomorrow—and shows why, in reality, there is no good evidence that they will, or should, come to pass. Nevertheless, these obsessions fuel fears that overwhelm reason—for example, that a rogue AI will exterminate humanity—at the expense of essential work on solving crucial problems like climate change. What’s more, these futuristic visions cloak a hunger for power under dreams of space colonies and digital immortality. The giants of Silicon Valley claim that their ideas are based on science, but the reality is they come from a jumbled mix of shallow futurism and racist pseudoscience.  <br />  <br /><i>More Everything Forever </i>exposes the powerful and sinister ideas that dominate Silicon Valley, challenging us to see how foolish, and dangerous, these visions of the future are.",
      "authorName": "Adam  Becker",
      "isbn": "1541619609",
      "userName": "Daniel",
      "userRating": "4",
      "userReadAt": "2025-07-07T00:00:00.000Z",
      "userDateAdded": "2025-07-07T10:06:29.000Z",
      "userDateCreated": "2025-07-05T07:05:20.000Z",
      "userShelves": "",
      "userReview": "",
      "averageRating": "4.3",
      "bookPublished": "2025",
      "description": "<a href=\"https://www.goodreads.com/book/show/212987932-more-everything-forever?utm_medium=api&amp;utm_source=rss\"><img alt=\"More Everything Forever: AI Overlords, Space Empires, and Silicon Valley&#39;s Crusade to Control the Fate of Humanity\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1719003402l/212987932._SY75_.jpg\" /></a><br/>\n                                      author: Adam  Becker<br/>\n                                      name: Daniel<br/>\n                                      average rating: 4.3<br/>\n                                      book published: 2025<br/>\n                                      rating: 4<br/>\n                                      read at: 2025/07/07<br/>\n                                      date added: 2025/07/07<br/>\n                                      shelves: <br/>\n                                      review: <br/><br/>",
      "numPages": "290"
    },
    {
      "id": "https://www.goodreads.com/review/show/4676679091?utm_medium=api&utm_source=rss",
      "title": "2034: A Novel of the Next World War",
      "link": "https://www.goodreads.com/review/show/4676679091?utm_medium=api&utm_source=rss",
      "bookId": "54211065",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1593385556l/54211065._SY75_.jpg",
      "bookDescription": "On March 12, 2034, US Navy Commodore Sarah Hunt is on the bridge of her flagship, the guided missile destroyer USS John Paul Jones, conducting a routine freedom of navigation patrol in the South China Sea when her ship detects an unflagged trawler in clear distress, smoke billowing from its bridge. On that same day, US Marine aviator Major Chris \"Wedge\" Mitchell is flying an F35E Lightning over the Strait of Hormuz, testing a new stealth technology as he flirts with Iranian airspace.<p></p><p>By the end of that day, Wedge will be an Iranian prisoner, and Sarah Hunt's destroyer will lie at the bottom of the sea, sunk by the Chinese Navy. Iran and China have clearly coordinated their moves, which involve the use of powerful new forms of cyber weaponry that render US ships and planes defenseless. In a single day, America's faith in its military's strategic pre-eminence is in tatters. A new, terrifying era is at hand.</p><p></p><p>So begins a disturbingly plausible work of speculative fiction, co-authored by an award-winning novelist and decorated Marine veteran and the former commander of NATO, a legendary admiral who has spent much of his career strategically out maneuvering America's most tenacious adversaries.</p><p>Written with a powerful blend of geopolitical sophistication and literary, human empathy, 2034 takes us inside the minds of a global cast of characters--Americans, Chinese, Iranians, Russians, Indians--as a series of arrogant miscalculations on all sides leads the world into an intensifying international storm. In the end, China and the United States will have paid a staggering cost, one that forever alters the global balance of power.</p><p>Everything in 2034 is an imaginative extrapolation from present-day facts on the ground combined with the authors' years working at the highest and most classified levels of national security. Sometimes it takes a brilliant work of fiction to illuminate the most dire of warnings: 2034 is all too close at hand, and this cautionary tale presents the reader a dark yet possible future that we must do all we can to avoid.</p>",
      "authorName": "Elliot Ackerman",
      "isbn": "1984881256",
      "userName": "Daniel",
      "userRating": "5",
      "userReadAt": "2025-07-04T00:00:00.000Z",
      "userDateAdded": "2025-07-05T05:54:08.000Z",
      "userDateCreated": "2022-04-19T07:18:11.000Z",
      "userShelves": "",
      "userReview": "",
      "averageRating": "3.7",
      "bookPublished": "2021",
      "description": "<a href=\"https://www.goodreads.com/book/show/54211065-2034?utm_medium=api&amp;utm_source=rss\"><img alt=\"2034: A Novel of the Next World War\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1593385556l/54211065._SY75_.jpg\" /></a><br/>\n                                      author: Elliot Ackerman<br/>\n                                      name: Daniel<br/>\n                                      average rating: 3.7<br/>\n                                      book published: 2021<br/>\n                                      rating: 5<br/>\n                                      read at: 2025/07/04<br/>\n                                      date added: 2025/07/04<br/>\n                                      shelves: <br/>\n                                      review: <br/><br/>",
      "numPages": "320"
    },
    {
      "id": "https://www.goodreads.com/review/show/3947573921?utm_medium=api&utm_source=rss",
      "title": "Kinds of Minds: Toward an Understanding of Consciousness",
      "link": "https://www.goodreads.com/review/show/3947573921?utm_medium=api&utm_source=rss",
      "bookId": "2074",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1388242069l/2074._SY75_.jpg",
      "bookDescription": "Combining ideas from philosophy, artificial intelligence, and neurobiology, Daniel Dennett leads the reader on a fascinating journey of inquiry, exploring such intriguing possibilities as: Can any of us really know what is going on in someone else's mind? What distinguishes the human mind from the minds of animals, especially those capable of complex behavior? If such animals, for instance, were magically given the power of language, would their communities evolve an intelligence as subtly discriminating as ours? Will robots, once they have been endowed with sensory systems like those that provide us with experience, ever exhibit the particular traits long thought to distinguish the human mind, including the ability to think about thinking? Dennett addresses these questions from an evolutionary perspective. Beginning with the macromolecules of DNA and RNA, the author shows how, step-by-step, animal life moved from the simple ability to respond to frequently recurring environmental conditions to much more powerful ways of beating the odds, ways of using patterns of past experience to predict the future in never-before-encountered situations. Whether talking about robots whose video-camera ”eyes” give us the powerful illusion that ”there is somebody in there” or asking us to consider whether spiders are just tiny robots mindlessly spinning their webs of elegant design, Dennett is a master at finding and posing questions sure to stimulate and even disturb.",
      "authorName": "Daniel C. Dennett",
      "isbn": "0465073514",
      "userName": "Daniel",
      "userRating": "4",
      "userReadAt": "2025-07-01T00:00:00.000Z",
      "userDateAdded": "2025-07-02T06:10:23.000Z",
      "userDateCreated": "2021-04-16T05:48:38.000Z",
      "userShelves": "",
      "userReview": "",
      "averageRating": "3.8",
      "bookPublished": "1996",
      "description": "<a href=\"https://www.goodreads.com/book/show/2074.Kinds_of_Minds?utm_medium=api&amp;utm_source=rss\"><img alt=\"Kinds of Minds: Toward an Understanding of Consciousness\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1388242069l/2074._SY75_.jpg\" /></a><br/>\n                                      author: Daniel C. Dennett<br/>\n                                      name: Daniel<br/>\n                                      average rating: 3.8<br/>\n                                      book published: 1996<br/>\n                                      rating: 4<br/>\n                                      read at: 2025/07/01<br/>\n                                      date added: 2025/07/01<br/>\n                                      shelves: <br/>\n                                      review: <br/><br/>",
      "numPages": "184"
    },
    {
      "id": "https://www.goodreads.com/review/show/2801544996?utm_medium=api&utm_source=rss",
      "title": "Seven Brief Lessons on Physics",
      "link": "https://www.goodreads.com/review/show/2801544996?utm_medium=api&utm_source=rss",
      "bookId": "25734172",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1443551746l/25734172._SY75_.jpg",
      "bookDescription": "<b>All the beauty of modern physics in fewer than a hundred pages.</b><br /><br />This is a book about the joy of discovery. A playful, entertaining, and mind-bending introduction to modern physics, it's already a major bestseller in Italy and the United Kingdom. Carlo Rovelli offers surprising—and surprisingly easy to grasp—explanations of general relativity, quantum mechanics, elementary particles, gravity, black holes, the complex architecture of the universe, and the role humans play in this weird and wonderful world. He takes us to the frontiers of our knowledge: to the most minute reaches of the fabric of space, back to the origins of the cosmos, and into the workings of our minds. “Here, on the edge of what we know, in contact with the ocean of the unknown, shines the mystery and the beauty of the world,” Rovelli writes. “And it’s breathtaking.”",
      "authorName": "Carlo Rovelli",
      "isbn": "0399184414",
      "userName": "Daniel",
      "userRating": "5",
      "userReadAt": "2025-06-30T00:00:00.000Z",
      "userDateAdded": "2025-07-01T03:42:29.000Z",
      "userDateCreated": "2019-04-28T06:42:16.000Z",
      "userShelves": "",
      "userReview": "",
      "averageRating": "4.0",
      "bookPublished": "2014",
      "description": "<a href=\"https://www.goodreads.com/book/show/25734172-seven-brief-lessons-on-physics?utm_medium=api&amp;utm_source=rss\"><img alt=\"Seven Brief Lessons on Physics\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1443551746l/25734172._SY75_.jpg\" /></a><br/>\n                                      author: Carlo Rovelli<br/>\n                                      name: Daniel<br/>\n                                      average rating: 4.0<br/>\n                                      book published: 2014<br/>\n                                      rating: 5<br/>\n                                      read at: 2025/06/30<br/>\n                                      date added: 2025/06/30<br/>\n                                      shelves: <br/>\n                                      review: <br/><br/>",
      "numPages": "81"
    },
    {
      "id": "https://www.goodreads.com/review/show/5359442036?utm_medium=api&utm_source=rss",
      "title": "The Wasp Factory",
      "link": "https://www.goodreads.com/review/show/5359442036?utm_medium=api&utm_source=rss",
      "bookId": "567678",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1434940562l/567678._SY75_.jpg",
      "bookDescription": "Frank, no ordinary sixteen-year-old, lives with his father outside a remote Scottish village. Their life is, to say the least, unconventional. Frank's mother abandoned them years ago: his elder brother Eric is confined to a psychiatric hospital; and his father measures out his eccentricities on an imperial scale. Frank has turned to strange acts of violence to vent his frustrations. In the bizarre daily rituals there is some solace. But when news comes of Eric's escape from the hospital Frank has to prepare the ground for his brother's inevitable return - an event that explodes the mysteries of the past and changes Frank utterly.<br /><br /><i>The Wasp Factory</i> is a work of horrifying compulsion: horrifying, because it enters a mind whose realities are not our own, whose values of life and death are alien to our society; compulsive, because the humour and compassion of that mind reach out to us all. A novel of extraordinary originality, imagination and comic ferocity.",
      "authorName": "Iain Banks",
      "isbn": "0684853159",
      "userName": "Daniel",
      "userRating": "4",
      "userReadAt": "2025-06-29T00:00:00.000Z",
      "userDateAdded": "2025-06-30T04:52:51.000Z",
      "userDateCreated": "2023-02-20T07:38:32.000Z",
      "userShelves": "",
      "userReview": "",
      "averageRating": "3.8",
      "bookPublished": "1984",
      "description": "<a href=\"https://www.goodreads.com/book/show/567678.The_Wasp_Factory?utm_medium=api&amp;utm_source=rss\"><img alt=\"The Wasp Factory\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1434940562l/567678._SY75_.jpg\" /></a><br/>\n                                      author: Iain Banks<br/>\n                                      name: Daniel<br/>\n                                      average rating: 3.8<br/>\n                                      book published: 1984<br/>\n                                      rating: 4<br/>\n                                      read at: 2025/06/29<br/>\n                                      date added: 2025/06/29<br/>\n                                      shelves: <br/>\n                                      review: <br/><br/>",
      "numPages": "184"
    },
    {
      "id": "https://www.goodreads.com/review/show/7695930642?utm_medium=api&utm_source=rss",
      "title": "L'heure des prédateurs",
      "link": "https://www.goodreads.com/review/show/7695930642?utm_medium=api&utm_source=rss",
      "bookId": "222728117",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1742361515l/222728117._SX50_.jpg",
      "bookDescription": "Giuliano da Empoli nous livre le compte-rendu aussi haletant que glaçant de ses pérégrinations au pays de la puissance, de New York à Ryad, de l’ONU au Ritz Carlton de MBS. Il nous guide de l’autre côté du miroir, là où le pouvoir s’acquiert par des actions irréfléchies et tapageuses, où des autocrates décomplexés sont à l’affût du maximum de chaos, où les seigneurs de la tech semblent déjà habiter un autre monde, où l’IA s’avère incontrôlable… Aucun doute, l’heure des prédateurs a sonné. L’auteur du Mage du Kremlin les regarde en face, avec la lucidité d’un Machiavel et la hauteur de vue du moraliste.<br /><br />Pierre-François Garel interprète avec brio ce précieux témoignage sur un nouveau monde inquiétant en train de naître.",
      "authorName": "Giuliano da Empoli",
      "isbn": "2073113206",
      "userName": "Daniel",
      "userRating": "0",
      "userReadAt": "",
      "userDateAdded": "2025-06-30T02:40:19.000Z",
      "userDateCreated": "2025-06-30T02:40:18.000Z",
      "userShelves": "to-read",
      "userReview": "",
      "averageRating": "4.0",
      "bookPublished": "2025",
      "description": "<a href=\"https://www.goodreads.com/book/show/222728117-l-heure-des-pr-dateurs?utm_medium=api&amp;utm_source=rss\"><img alt=\"L&#39;heure des prédateurs\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1742361515l/222728117._SX50_.jpg\" /></a><br/>\n                                      author: Giuliano da Empoli<br/>\n                                      name: Daniel<br/>\n                                      average rating: 4.0<br/>\n                                      book published: 2025<br/>\n                                      rating: 0<br/>\n                                      read at: <br/>\n                                      date added: 2025/06/29<br/>\n                                      shelves: to-read<br/>\n                                      review: <br/><br/>",
      "numPages": "160"
    },
    {
      "id": "https://www.goodreads.com/review/show/426793453?utm_medium=api&utm_source=rss",
      "title": "The Diamond Age: Or, a Young Lady's Illustrated Primer",
      "link": "https://www.goodreads.com/review/show/426793453?utm_medium=api&utm_source=rss",
      "bookId": "827",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1388180931l/827._SY75_.jpg",
      "bookDescription": "<i>The Diamond Age: Or, a Young Lady's Illustrated Primer</i> is a postcyberpunk novel by Neal Stephenson. It is to some extent a science fiction coming-of-age story, focused on a young girl named Nell, and set in a future world in which nanotechnology affects all aspects of life. The novel deals with themes of education, social class, ethnicity, and the nature of artificial intelligence.",
      "authorName": "Neal Stephenson",
      "isbn": "0553380966",
      "userName": "Daniel",
      "userRating": "5",
      "userReadAt": "2025-06-27T00:00:00.000Z",
      "userDateAdded": "2025-06-28T04:41:42.000Z",
      "userDateCreated": "2012-10-03T07:49:37.000Z",
      "userShelves": "",
      "userReview": "",
      "averageRating": "4.2",
      "bookPublished": "1995",
      "description": "<a href=\"https://www.goodreads.com/book/show/827.The_Diamond_Age?utm_medium=api&amp;utm_source=rss\"><img alt=\"The Diamond Age: Or, a Young Lady&#39;s Illustrated Primer\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1388180931l/827._SY75_.jpg\" /></a><br/>\n                                      author: Neal Stephenson<br/>\n                                      name: Daniel<br/>\n                                      average rating: 4.2<br/>\n                                      book published: 1995<br/>\n                                      rating: 5<br/>\n                                      read at: 2025/06/27<br/>\n                                      date added: 2025/06/27<br/>\n                                      shelves: <br/>\n                                      review: <br/><br/>",
      "numPages": "499"
    },
    {
      "id": "https://www.goodreads.com/review/show/7690131717?utm_medium=api&utm_source=rss",
      "title": "The Complete Illustrated Holistic Herbal: Safe and Practical Guide to Making and Using Herbal Remedies",
      "link": "https://www.goodreads.com/review/show/7690131717?utm_medium=api&utm_source=rss",
      "bookId": "1465691",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1183882917l/1465691._SY75_.jpg",
      "bookDescription": "Herbal medicine is enjoying a much deserved revival with more and more people turning to its safe, natural remedies which are free from harmful side-effects. The most comprehensive and authoritative guide available, this herbal offers clear, step-by-step advice on the use of herbal medicine for the safe treatment of a wide range of complaints. Its unique holistic approach enables you to restore and maintain wellbeing by treating the body as a whole. Beautifully illustrated with over three hundred full-color pictures, it covers treatment of a wide range of complaints and diseases, gathering herbs and preparing remedies, A-Z herbal featuring more than 200 herbs, and Clear explanations of the body's systems.",
      "authorName": "David Hoffman",
      "isbn": "0760701555",
      "userName": "Daniel",
      "userRating": "0",
      "userReadAt": "",
      "userDateAdded": "2025-06-27T23:10:10.000Z",
      "userDateCreated": "2025-06-27T23:10:10.000Z",
      "userShelves": "to-read",
      "userReview": "",
      "averageRating": "4.3",
      "bookPublished": "1987",
      "description": "<a href=\"https://www.goodreads.com/book/show/1465691.The_Complete_Illustrated_Holistic_Herbal?utm_medium=api&amp;utm_source=rss\"><img alt=\"The Complete Illustrated Holistic Herbal: Safe and Practical Guide to Making and Using Herbal Remedies\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1183882917l/1465691._SY75_.jpg\" /></a><br/>\n                                      author: David Hoffman<br/>\n                                      name: Daniel<br/>\n                                      average rating: 4.3<br/>\n                                      book published: 1987<br/>\n                                      rating: 0<br/>\n                                      read at: <br/>\n                                      date added: 2025/06/27<br/>\n                                      shelves: to-read<br/>\n                                      review: <br/><br/>",
      "numPages": "256"
    },
    {
      "id": "https://www.goodreads.com/review/show/7677550091?utm_medium=api&utm_source=rss",
      "title": "The Party's Interests Come First: The Life of Xi Zhongxun, Father of Xi Jinping",
      "link": "https://www.goodreads.com/review/show/7677550091?utm_medium=api&utm_source=rss",
      "bookId": "209047303",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1735447265l/209047303._SY75_.jpg",
      "bookDescription": "China's leader, Xi Jinping, is one of the most powerful individuals in the world—and one of the least understood. Much can be learned, however, about both Xi Jinping and the nature of the party he leads from the memory and legacy of his father, the revolutionary Xi Zhongxun (1913–2002). The elder Xi served the Chinese Communist Party (CCP) for more than seven decades. He worked at the right hand of prominent leaders Zhou Enlai and Hu Yaobang. He helped build the Communist base area that saved Mao Zedong in 1935, and he initiated the Special Economic Zones that launched China into the reform era after Mao's death. He led the Party's United Front efforts toward Tibetans, Uyghurs, and Taiwanese. And though in 1989 he initially sought to avoid violence, he ultimately supported the Party's crackdown on the Tiananmen protesters.<br /><br /><br /><br /><i>The Party's Interests Come First</i> is the first biography of Xi Zhongxun written in English. This biography is at once a sweeping story of the Chinese revolution and the first several decades of the People's Republic of China and a deeply personal story about making sense of one's own identity within a larger political context. Drawing on an array of new documents, interviews, diaries, and periodicals, Joseph Torigian vividly tells the life story of Xi Zhongxun, a man who spent his entire life struggling to balance his own feelings with the Party's demands. Through the eyes of Xi Jinping's father, Torigian reveals the extraordinary organizational, ideological, and coercive power of the CCP—and the terrible cost in human suffering that comes with it.",
      "authorName": "Joseph Torigian",
      "isbn": "1503634752",
      "userName": "Daniel",
      "userRating": "0",
      "userReadAt": "",
      "userDateAdded": "2025-06-23T13:05:59.000Z",
      "userDateCreated": "2025-06-23T13:05:59.000Z",
      "userShelves": "on-deck",
      "userReview": "",
      "averageRating": "4.8",
      "bookPublished": "2025",
      "description": "<a href=\"https://www.goodreads.com/book/show/209047303-the-party-s-interests-come-first?utm_medium=api&amp;utm_source=rss\"><img alt=\"The Party&#39;s Interests Come First: The Life of Xi Zhongxun, Father of Xi Jinping\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1735447265l/209047303._SY75_.jpg\" /></a><br/>\n                                      author: Joseph Torigian<br/>\n                                      name: Daniel<br/>\n                                      average rating: 4.8<br/>\n                                      book published: 2025<br/>\n                                      rating: 0<br/>\n                                      read at: <br/>\n                                      date added: 2025/06/23<br/>\n                                      shelves: on-deck<br/>\n                                      review: <br/><br/>",
      "numPages": "718"
    },
    {
      "id": "https://www.goodreads.com/review/show/7666498733?utm_medium=api&utm_source=rss",
      "title": "Jingo (Discworld, #21; City Watch, #4)",
      "link": "https://www.goodreads.com/review/show/7666498733?utm_medium=api&utm_source=rss",
      "bookId": "47990",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1327921813l/47990._SY75_.jpg",
      "bookDescription": "A weathercock has risen from the sea of Discworld, and suddenly you can tell which way the wind is blowing.<br /><br />A new land has surfaced, and so have old feuds.<br /><br />And as two armies march, Commander Vimes of Ankh-Morpork City Watch has got just a few hours to deal with a crime so big that there's no law against it. It's called \"war.\"<br /><br />He's facing unpleasant foes who are out to get him... that's just the people on his side. The enemy might even be worse. And his pocket Dis-organiser says he's got to DIE under \"Things To Do Today.\"<br /><br />But he'd better not, because the world's cleverest inventor and its most devious politician are on their way to the battlefield with a little package that's guaranteed to stop a battle...<br /><br />Discworld goes to war, with armies of sardines, warriors, fishermen, squid, and at least one very camp follower.",
      "authorName": "Terry Pratchett",
      "isbn": "0552154164",
      "userName": "Daniel",
      "userRating": "4",
      "userReadAt": "2025-06-21T00:00:00.000Z",
      "userDateAdded": "2025-06-21T07:14:15.000Z",
      "userDateCreated": "2025-06-19T07:24:53.000Z",
      "userShelves": "",
      "userReview": "",
      "averageRating": "4.2",
      "bookPublished": "1997",
      "description": "<a href=\"https://www.goodreads.com/book/show/47990.Jingo?utm_medium=api&amp;utm_source=rss\"><img alt=\"Jingo (Discworld, #21; City Watch, #4)\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1327921813l/47990._SY75_.jpg\" /></a><br/>\n                                      author: Terry Pratchett<br/>\n                                      name: Daniel<br/>\n                                      average rating: 4.2<br/>\n                                      book published: 1997<br/>\n                                      rating: 4<br/>\n                                      read at: 2025/06/21<br/>\n                                      date added: 2025/06/21<br/>\n                                      shelves: <br/>\n                                      review: <br/><br/>",
      "numPages": "461"
    },
    {
      "id": "https://www.goodreads.com/review/show/7671334653?utm_medium=api&utm_source=rss",
      "title": "The Gene: An Intimate History",
      "link": "https://www.goodreads.com/review/show/7671334653?utm_medium=api&utm_source=rss",
      "bookId": "27276428",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1452452965l/27276428._SY75_.jpg",
      "bookDescription": "Spanning the globe and several centuries, The Gene is the story of the quest to decipher the master-code that makes and defines humans, that governs our form and function.<br /><br />The story of the gene begins in an obscure Augustinian abbey in Moravia in 1856 where a monk stumbles on the idea of a ‘unit of heredity’. It intersects with Darwin’s theory of evolution, and collides with the horrors of Nazi eugenics in the 1940s. The gene transforms post-war biology. It reorganizes our understanding of sexuality, temperament, choice and free will. This is a story driven by human ingenuity and obsessive minds – from Charles Darwin and Gregor Mendel to Francis Crick, James Watson and Rosalind Franklin, and the thousands of scientists still working to understand the code of codes.<br /><br />This is an epic, moving history of a scientific idea coming to life, by the author of The Emperor of All Maladies. But woven through The Gene, like a red line, is also an intimate history – the story of Mukherjee’s own family and its recurring pattern of mental illness, reminding us that genetics is vitally relevant to everyday lives. These concerns reverberate even more urgently today as we learn to “read” and “write” the human genome – unleashing the potential to change the fates and identities of our children.<br /><br />Majestic in its ambition, and unflinching in its honesty, The Gene gives us a definitive account of the fundamental unit of heredity – and a vision of both humanity’s past and future.",
      "authorName": "Siddhartha Mukherjee",
      "isbn": "",
      "userName": "Daniel",
      "userRating": "0",
      "userReadAt": "",
      "userDateAdded": "2025-06-21T03:09:46.000Z",
      "userDateCreated": "2025-06-21T03:09:46.000Z",
      "userShelves": "on-deck",
      "userReview": "",
      "averageRating": "4.3",
      "bookPublished": "2016",
      "description": "<a href=\"https://www.goodreads.com/book/show/27276428-the-gene?utm_medium=api&amp;utm_source=rss\"><img alt=\"The Gene: An Intimate History\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1452452965l/27276428._SY75_.jpg\" /></a><br/>\n                                      author: Siddhartha Mukherjee<br/>\n                                      name: Daniel<br/>\n                                      average rating: 4.3<br/>\n                                      book published: 2016<br/>\n                                      rating: 0<br/>\n                                      read at: <br/>\n                                      date added: 2025/06/20<br/>\n                                      shelves: on-deck<br/>\n                                      review: <br/><br/>",
      "numPages": "592"
    },
    {
      "id": "https://www.goodreads.com/review/show/7671328391?utm_medium=api&utm_source=rss",
      "title": "The Century of the Gene",
      "link": "https://www.goodreads.com/review/show/7671328391?utm_medium=api&utm_source=rss",
      "bookId": "132475",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1348814522l/132475._SX50_.jpg",
      "bookDescription": "In a book that promises to change the way we think and talk about genes and genetic determinism, Evelyn Fox Keller, one of our most gifted historians and philosophers of science, provides a powerful, profound analysis of the achievements of genetics and molecular biology in the twentieth century, the century of the gene. Not just a chronicle of biology’s progress from gene to genome in one hundred years, The Century of the Gene also calls our attention to the surprising ways these advances challenge the familiar picture of the gene most of us still entertain.<br /><br />Keller shows us that the very successes that have stirred our imagination have also radically undermined the primacy of the gene―word and object―as the core explanatory concept of heredity and development. She argues that we need a new vocabulary that includes concepts such as robustness, fidelity, and evolvability. But more than a new vocabulary, a new awareness is absolutely that understanding the components of a system (be they individual genes, proteins, or even molecules) may tell us little about the interactions among these components.<br /><br />With the Human Genome Project nearing its first and most publicized goal, biologists are coming to realize that they have reached not the end of biology but the beginning of a new era. Indeed, Keller predicts that in the new century we will witness another Cambrian era, this time in new forms of biological thought rather than in new forms of biological life.",
      "authorName": "Evelyn Fox Keller",
      "isbn": "0674008251",
      "userName": "Daniel",
      "userRating": "0",
      "userReadAt": "",
      "userDateAdded": "2025-06-21T03:06:42.000Z",
      "userDateCreated": "2025-06-21T03:06:42.000Z",
      "userShelves": "on-deck",
      "userReview": "",
      "averageRating": "4.0",
      "bookPublished": "2000",
      "description": "<a href=\"https://www.goodreads.com/book/show/132475.The_Century_of_the_Gene?utm_medium=api&amp;utm_source=rss\"><img alt=\"The Century of the Gene\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1348814522l/132475._SX50_.jpg\" /></a><br/>\n                                      author: Evelyn Fox Keller<br/>\n                                      name: Daniel<br/>\n                                      average rating: 4.0<br/>\n                                      book published: 2000<br/>\n                                      rating: 0<br/>\n                                      read at: <br/>\n                                      date added: 2025/06/20<br/>\n                                      shelves: on-deck<br/>\n                                      review: <br/><br/>",
      "numPages": "192"
    },
    {
      "id": "https://www.goodreads.com/review/show/7669190082?utm_medium=api&utm_source=rss",
      "title": "The Cambridge History of the Polar Regions",
      "link": "https://www.goodreads.com/review/show/7669190082?utm_medium=api&utm_source=rss",
      "bookId": "61421309",
      "bookImageURL": "https://s.gr-assets.com/assets/nophoto/book/50x75-a91bf249278a81aabab721ef782c4a74.png",
      "bookDescription": "The Cambridge History of the Polar Regions is a landmark collection drawing together the history of the Arctic and Antarctica from the earliest times to the present. Structured as a series of thematic chapters, an international team of scholars offer a range of perspectives from environmental history, the history of science and exploration, cultural history, and the more traditional approaches of political, social, economic, and imperial history. The volume considers the centrality of Indigenous experience and the urgent need to build action in the present on a thorough understanding of the past. Using historical research based on methods ranging from archives and print culture to archaeology and oral histories, these essays provide fresh analyses of the discovery of Antarctica, the disappearance of Sir John Franklin, the fate of the Norse colony in Greenland, the origins of the Antarctic Treaty, and much more. This is an invaluable resource for anyone interested in the history of our planet.",
      "authorName": "Adrian Howkins",
      "isbn": "1108555659",
      "userName": "Daniel",
      "userRating": "0",
      "userReadAt": "",
      "userDateAdded": "2025-06-20T07:32:07.000Z",
      "userDateCreated": "2025-06-20T07:32:07.000Z",
      "userShelves": "to-read",
      "userReview": "",
      "averageRating": "0.0",
      "bookPublished": "",
      "description": "<a href=\"https://www.goodreads.com/book/show/61421309-the-cambridge-history-of-the-polar-regions?utm_medium=api&amp;utm_source=rss\"><img alt=\"The Cambridge History of the Polar Regions\" src=\"https://s.gr-assets.com/assets/nophoto/book/50x75-a91bf249278a81aabab721ef782c4a74.png\" /></a><br/>\n                                      author: Adrian Howkins<br/>\n                                      name: Daniel<br/>\n                                      average rating: 0.0<br/>\n                                      book published: <br/>\n                                      rating: 0<br/>\n                                      read at: <br/>\n                                      date added: 2025/06/20<br/>\n                                      shelves: to-read<br/>\n                                      review: <br/><br/>",
      "numPages": "0"
    },
    {
      "id": "https://www.goodreads.com/review/show/7665825225?utm_medium=api&utm_source=rss",
      "title": "Industrial Policy for the United States: Winning the Competition for Good Jobs and High-Value Industries",
      "link": "https://www.goodreads.com/review/show/7665825225?utm_medium=api&utm_source=rss",
      "bookId": "209839514",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1721596261l/209839514._SY75_.jpg",
      "bookDescription": "The U.S. is losing the competition for good jobs and high-value industries because most of Washington believes trade should be free, the dollar should float, and that innovation comes exclusively from the private sector. In this book, the authors make the bold case that these laissez-faire ideas have failed and that a robust industrial policy is the only way for America to remain prosperous and secure. Trump and Biden have enacted some of its elements, but it needs to be made systematic and comprehensive, including tariffs to protect key industries, a competitive exchange rate, and federal support for commercialization—not just invention—of new technologies. Timely, meticulously researched, and bipartisan, this impressive analysis replaces misunderstandings about industrial policy with lucid explanations of its underlying economic theory, the tools that implement it, and its successes (and failures) in America and abroad. It examines key industries of the past and future – steel, automobiles, television, semiconductors, space, aviation, robotics, and nanotechnology. It concludes with a realistic, actionable policy roadmap. A work of rigor and ambition, Industrial Policy for the United States is essential reading.",
      "authorName": "Marc Fasteau",
      "isbn": "1009243071",
      "userName": "Daniel",
      "userRating": "0",
      "userReadAt": "",
      "userDateAdded": "2025-06-19T07:24:27.000Z",
      "userDateCreated": "2025-06-19T01:02:31.000Z",
      "userShelves": "on-deck",
      "userReview": "",
      "averageRating": "4.7",
      "bookPublished": "",
      "description": "<a href=\"https://www.goodreads.com/book/show/209839514-industrial-policy-for-the-united-states?utm_medium=api&amp;utm_source=rss\"><img alt=\"Industrial Policy for the United States: Winning the Competition for Good Jobs and High-Value Industries\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1721596261l/209839514._SY75_.jpg\" /></a><br/>\n                                      author: Marc Fasteau<br/>\n                                      name: Daniel<br/>\n                                      average rating: 4.7<br/>\n                                      book published: <br/>\n                                      rating: 0<br/>\n                                      read at: <br/>\n                                      date added: 2025/06/19<br/>\n                                      shelves: on-deck<br/>\n                                      review: <br/><br/>",
      "numPages": "836"
    },
    {
      "id": "https://www.goodreads.com/review/show/7665940189?utm_medium=api&utm_source=rss",
      "title": "If Anyone Builds It, Everyone Dies: Why Superhuman AI Would Kill Us All",
      "link": "https://www.goodreads.com/review/show/7665940189?utm_medium=api&utm_source=rss",
      "bookId": "228697879",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1741285436l/228697879._SY75_.jpg",
      "bookDescription": "<b>The scramble to create superhuman AI has put us on the path to extinction—but it’s not too late to change course, as two of the field’s earliest researchers explain in this clarion call for humanity.<br /><br /> \"May prove to be the most important book of our time.”—Tim Urban, <i>Wait But Why</i></b><br /><br /> In 2023, hundreds of AI luminaries signed an open letter warning that artificial intelligence poses a serious risk of human extinction. Since then, the AI race has only intensified. Companies and countries are rushing to build machines that will be smarter than any person. And the world is devastatingly unprepared for what would come next.<br />  <br /> For decades, two signatories of that letter—Eliezer Yudkowsky and Nate Soares—have studied how smarter-than-human intelligences will think, behave, and pursue their objectives. Their research says that sufficiently smart AIs will develop goals of their own that put them in conflict with us—and that if it comes to conflict, an artificial superintelligence would crush us. The contest wouldn’t even be close.<br />  <br /> How could a machine superintelligence wipe out our entire species? Why would it want to? Would it want anything at all? In this urgent book, Yudkowsky and Soares walk through the theory and the evidence, present one possible extinction scenario, and explain what it would take for humanity to survive. <br />  <br /> The world is racing to build something truly new under the sun. And if anyone builds it, everyone dies.<br /><br /><b>“The best no-nonsense, simple explanation of the AI risk problem I've ever read.”—Yishan Wong, Former CEO of Reddit</b>",
      "authorName": "Eliezer Yudkowsky",
      "isbn": "0316595667",
      "userName": "Daniel",
      "userRating": "0",
      "userReadAt": "",
      "userDateAdded": "2025-06-19T01:52:19.000Z",
      "userDateCreated": "2025-06-19T01:52:18.000Z",
      "userShelves": "to-read",
      "userReview": "",
      "averageRating": "4.0",
      "bookPublished": "",
      "description": "<a href=\"https://www.goodreads.com/book/show/228697879-if-anyone-builds-it-everyone-dies?utm_medium=api&amp;utm_source=rss\"><img alt=\"If Anyone Builds It, Everyone Dies: Why Superhuman AI Would Kill Us All\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1741285436l/228697879._SY75_.jpg\" /></a><br/>\n                                      author: Eliezer Yudkowsky<br/>\n                                      name: Daniel<br/>\n                                      average rating: 4.0<br/>\n                                      book published: <br/>\n                                      rating: 0<br/>\n                                      read at: <br/>\n                                      date added: 2025/06/18<br/>\n                                      shelves: to-read<br/>\n                                      review: <br/><br/>",
      "numPages": "0"
    },
    {
      "id": "https://www.goodreads.com/review/show/5072811041?utm_medium=api&utm_source=rss",
      "title": "Equal Rites (Discworld, #3; Witches, #1)",
      "link": "https://www.goodreads.com/review/show/5072811041?utm_medium=api&utm_source=rss",
      "bookId": "34507",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1407706800l/34507._SY75_.jpg",
      "bookDescription": "The last thing the wizard Drum Billet did, before Death laid a bony hand on his shoulder, was to pass on his staff of power to the eighth son of an eighth son. Unfortunately for his colleagues in the chauvinistic (not to say misogynistic) world of magic, he failed to check on the newborn baby's sex...",
      "authorName": "Terry Pratchett",
      "isbn": "0060855908",
      "userName": "Daniel",
      "userRating": "4",
      "userReadAt": "2025-06-17T00:00:00.000Z",
      "userDateAdded": "2025-06-18T06:53:58.000Z",
      "userDateCreated": "2022-10-29T05:46:12.000Z",
      "userShelves": "",
      "userReview": "",
      "averageRating": "4.1",
      "bookPublished": "1987",
      "description": "<a href=\"https://www.goodreads.com/book/show/34507.Equal_Rites?utm_medium=api&amp;utm_source=rss\"><img alt=\"Equal Rites (Discworld, #3; Witches, #1)\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1407706800l/34507._SY75_.jpg\" /></a><br/>\n                                      author: Terry Pratchett<br/>\n                                      name: Daniel<br/>\n                                      average rating: 4.1<br/>\n                                      book published: 1987<br/>\n                                      rating: 4<br/>\n                                      read at: 2025/06/17<br/>\n                                      date added: 2025/06/17<br/>\n                                      shelves: <br/>\n                                      review: <br/><br/>",
      "numPages": "228"
    },
    {
      "id": "https://www.goodreads.com/review/show/7650634457?utm_medium=api&utm_source=rss",
      "title": "Feet of Clay (Discworld, #19; City Watch, #3)",
      "link": "https://www.goodreads.com/review/show/7650634457?utm_medium=api&utm_source=rss",
      "bookId": "34527",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1320490628l/34527._SY75_.jpg",
      "bookDescription": "There's a werewolf with pre-lunar tension in Ankh-Morpork, and a dwarf with an attitude and a golem who's begun to think for itself.<br /><br />But for Commander Vimes, Head of Ankh-Morpork City Watch, that's only the start...<br /><br />There's treason in the air.<br />A crime has happened.<br /><br />He's not only got to find out whodunit, but howdunit too. He's not even sure what they dun. But as soon as he knows what the questions are, he's going to want some answers.",
      "authorName": "Terry Pratchett",
      "isbn": "0552153257",
      "userName": "Daniel",
      "userRating": "4",
      "userReadAt": "2025-06-16T00:00:00.000Z",
      "userDateAdded": "2025-06-16T08:56:26.000Z",
      "userDateCreated": "2025-06-13T07:07:02.000Z",
      "userShelves": "",
      "userReview": "",
      "averageRating": "4.3",
      "bookPublished": "1996",
      "description": "<a href=\"https://www.goodreads.com/book/show/34527.Feet_of_Clay?utm_medium=api&amp;utm_source=rss\"><img alt=\"Feet of Clay (Discworld, #19; City Watch, #3)\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1320490628l/34527._SY75_.jpg\" /></a><br/>\n                                      author: Terry Pratchett<br/>\n                                      name: Daniel<br/>\n                                      average rating: 4.3<br/>\n                                      book published: 1996<br/>\n                                      rating: 4<br/>\n                                      read at: 2025/06/16<br/>\n                                      date added: 2025/06/16<br/>\n                                      shelves: <br/>\n                                      review: <br/><br/>",
      "numPages": "411"
    },
    {
      "id": "https://www.goodreads.com/review/show/7645189031?utm_medium=api&utm_source=rss",
      "title": "Maskerade (Discworld, #18; Witches, #5)",
      "link": "https://www.goodreads.com/review/show/7645189031?utm_medium=api&utm_source=rss",
      "bookId": "78876",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1170961678l/78876._SY75_.jpg",
      "bookDescription": "The Opera House, Ankh-Morpork...<br /><br />... a huge, rambling building, where masked figures and hooded shadows do wicked deeds in the wings...<br />... where dying the death on stage is a little bit more than just a metaphor...<br />... where innocent young sopranos are lured to their destiny by an evil mastermind in a hideously deformed evening dress..<br /><br />Where...<br /><br />... there's a couple of old ladies in pointy hats eating peanuts in the gods and looking up at the big chandelier and saying things like: \"There's an accident waiting to happen if I ever saw one.\"<br /><br />Yes... Granny Weatherwax and Nanny Ogg, the Discworld's greatest witches, are back for an innocent night out at the opera.<br /><br />So there's going to be trouble (but nevertheless a good evening's entertainment with murders you can really hum...)",
      "authorName": "Terry Pratchett",
      "isbn": "0575058080",
      "userName": "Daniel",
      "userRating": "4",
      "userReadAt": "2025-06-12T00:00:00.000Z",
      "userDateAdded": "2025-06-13T04:34:25.000Z",
      "userDateCreated": "2025-06-11T04:11:38.000Z",
      "userShelves": "",
      "userReview": "",
      "averageRating": "4.1",
      "bookPublished": "1995",
      "description": "<a href=\"https://www.goodreads.com/book/show/78876.Maskerade?utm_medium=api&amp;utm_source=rss\"><img alt=\"Maskerade (Discworld, #18; Witches, #5)\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1170961678l/78876._SY75_.jpg\" /></a><br/>\n                                      author: Terry Pratchett<br/>\n                                      name: Daniel<br/>\n                                      average rating: 4.1<br/>\n                                      book published: 1995<br/>\n                                      rating: 4<br/>\n                                      read at: 2025/06/12<br/>\n                                      date added: 2025/06/12<br/>\n                                      shelves: <br/>\n                                      review: <br/><br/>",
      "numPages": "285"
    },
    {
      "id": "https://www.goodreads.com/review/show/7645482068?utm_medium=api&utm_source=rss",
      "title": "The Mesopotamian Riddle: An Archaeologist, a Soldier, a Clergyman, and the Race to Decipher the World's Oldest Writing",
      "link": "https://www.goodreads.com/review/show/7645482068?utm_medium=api&utm_source=rss",
      "bookId": "214152372",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1719020965l/214152372._SY75_.jpg",
      "bookDescription": "<b>A rollicking adventure starring three free-spirited Victorians on a twenty-year quest to decipher cuneiform</b>, <b>the oldest writing in the world</b>—<b>from the <i>New York Times</i> bestselling author of <i>The Bad-Ass Librarians of Timbuktu</i>.</b><br /><br />It was one of history’s great vanishing acts.<br /> <br />Around 3,400 BCE—as humans were gathering in complex urban settlements—a scribe in the mud-walled city-state of Uruk picked up a reed stylus to press tiny symbols into clay. For three millennia, wedge shape cuneiform script would record the military conquests, scientific discoveries, and epic literature of the great Mesopotamian kingdoms of Sumer, Assyria, and Babylon and of Persia’s mighty Achaemenid Empire, along with precious minutiae about everyday life in the cradle of civilization. And then…the meaning of the characters was lost.<br /> <br />London, 1857. In an era obsessed with human progress, mysterious palaces emerging from the desert sands had captured the Victorian public’s imagination. Yet Europe’s best philologists struggled to decipher the bizarre inscriptions excavators were digging up.<br /> <br />Enter a swashbuckling archaeologist, a suave British military officer turned diplomat, and a cloistered Irish rector, all vying for glory in a race to decipher this script that would enable them to peek farther back into human history than ever before.<br /> <br />From the ruins of Persepolis to lawless outposts of the crumbling Ottoman Empire, <i>The Mesopotamian Riddle</i> whisks you on a wild adventure through the golden age of archaeology in an epic quest to understand our past.",
      "authorName": "Joshua Hammer",
      "isbn": "1668015447",
      "userName": "Daniel",
      "userRating": "0",
      "userReadAt": "",
      "userDateAdded": "2025-06-11T08:01:50.000Z",
      "userDateCreated": "2025-06-11T08:01:50.000Z",
      "userShelves": "to-read",
      "userReview": "",
      "averageRating": "4.0",
      "bookPublished": "2025",
      "description": "<a href=\"https://www.goodreads.com/book/show/214152372-the-mesopotamian-riddle?utm_medium=api&amp;utm_source=rss\"><img alt=\"The Mesopotamian Riddle: An Archaeologist, a Soldier, a Clergyman, and the Race to Decipher the World&#39;s Oldest Writing\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1719020965l/214152372._SY75_.jpg\" /></a><br/>\n                                      author: Joshua Hammer<br/>\n                                      name: Daniel<br/>\n                                      average rating: 4.0<br/>\n                                      book published: 2025<br/>\n                                      rating: 0<br/>\n                                      read at: <br/>\n                                      date added: 2025/06/11<br/>\n                                      shelves: to-read<br/>\n                                      review: <br/><br/>",
      "numPages": "400"
    },
    {
      "id": "https://www.goodreads.com/review/show/7642727443?utm_medium=api&utm_source=rss",
      "title": "Speaking Bones (The Dandelion Dynasty, #4)",
      "link": "https://www.goodreads.com/review/show/7642727443?utm_medium=api&utm_source=rss",
      "bookId": "55596771",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1636784734l/55596771._SY75_.jpg",
      "bookDescription": "<b>The conclusion to Ken Liu's chronicle of the Dandelion Dynasty.</b> <br /><br />Ukyu-Gondé. <br />Stalked by foes and dogged by betrayal, Princess Théra is pursued across a continent vaster than she could ever have imagined, to the hidden valleys of the World's Edge Mountains, into the barrows and subterranean halls of the City of Ghosts, across the ice floes of the far north. She breached the Wall of Storms intent on taking war to the Lyucu homelands, but how do you conquer the unconquerable? <br /><br />Dara. <br />Empress Jia, Prince Phyro and Pékyu Tanvanaki find themselves bound to paths they never would have chosen. Amid atrocity and subterfuge, they will discover that the Courage of Brutes is no substitute for the Grace of Kings, and that little separates the Grace of Kings from the Madness of Tyrants. <br /><br />On both sides of the Wall of Storms, defeat's bitter tears mix with the fruits of knowledge new and ancient as two empires bound by blood and bone, by writ and iron, by time and custom, face a whirlwind that threatens to utterly consume them. <br /><br />The teeth, as they say, are on the board.",
      "authorName": "Ken Liu",
      "isbn": "1982148977",
      "userName": "Daniel",
      "userRating": "0",
      "userReadAt": "",
      "userDateAdded": "2025-06-10T09:00:17.000Z",
      "userDateCreated": "2025-06-10T09:00:17.000Z",
      "userShelves": "to-read",
      "userReview": "",
      "averageRating": "4.5",
      "bookPublished": "2022",
      "description": "<a href=\"https://www.goodreads.com/book/show/55596771-speaking-bones?utm_medium=api&amp;utm_source=rss\"><img alt=\"Speaking Bones (The Dandelion Dynasty, #4)\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1636784734l/55596771._SY75_.jpg\" /></a><br/>\n                                      author: Ken Liu<br/>\n                                      name: Daniel<br/>\n                                      average rating: 4.5<br/>\n                                      book published: 2022<br/>\n                                      rating: 0<br/>\n                                      read at: <br/>\n                                      date added: 2025/06/10<br/>\n                                      shelves: to-read<br/>\n                                      review: <br/><br/>",
      "numPages": "1047"
    },
    {
      "id": "https://www.goodreads.com/review/show/7642727426?utm_medium=api&utm_source=rss",
      "title": "The Veiled Throne (The Dandelion Dynasty, #3)",
      "link": "https://www.goodreads.com/review/show/7642727426?utm_medium=api&utm_source=rss",
      "bookId": "18952403",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1617258542l/18952403._SY75_.jpg",
      "bookDescription": "<b>With the invasion of Dara complete, and the Wall of Storms breached, the world has opened to new possibilities for the gods and peoples of both empires as the sweeping saga of the award-winning Dandelion Dynasty continues in this third book of the “magnificent fantasy epic” (NPR).</b><br /><br />Princess Théra, once known as Empress Üna of Dara, entrusted the throne to her younger brother in order to journey to Ukyu-Gondé to war with the Lyucu. She has crossed the fabled Wall of Storms with a fleet of advanced warships and ten thousand people. Beset by adversity, Théra and her most trusted companions attempt to overcome every challenge by doing the most interesting thing. But is not letting the past dictate the present always possible or even desirable?<br /><br />In Dara, the Lyucu leadership as well as the surviving Dandelion Court bristle with rivalries as currents of power surge and ebb and perspectives spin and shift. Here, parents and children, teachers and students, Empress and Pékyu, all nurture the seeds of plans that will take years to bloom. Will tradition yield to new justifications for power?<br /><br />Everywhere, the spirit of innovation dances like dandelion seeds on the wind, and the commoners, the forgotten, the ignored begin to engineer new solutions for a new age.<br /><br />Ken Liu returns to the series that draws from a tradition of the great epics of our history from the <i>Aeneid</i> to the <i>Romance on the Three Kingdoms</i> and builds a new tale unsurpassed in its scope and ambition.",
      "authorName": "Ken Liu",
      "isbn": "1481424335",
      "userName": "Daniel",
      "userRating": "0",
      "userReadAt": "",
      "userDateAdded": "2025-06-10T09:00:16.000Z",
      "userDateCreated": "2025-06-10T09:00:16.000Z",
      "userShelves": "to-read",
      "userReview": "",
      "averageRating": "4.1",
      "bookPublished": "2021",
      "description": "<a href=\"https://www.goodreads.com/book/show/18952403-the-veiled-throne?utm_medium=api&amp;utm_source=rss\"><img alt=\"The Veiled Throne (The Dandelion Dynasty, #3)\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1617258542l/18952403._SY75_.jpg\" /></a><br/>\n                                      author: Ken Liu<br/>\n                                      name: Daniel<br/>\n                                      average rating: 4.1<br/>\n                                      book published: 2021<br/>\n                                      rating: 0<br/>\n                                      read at: <br/>\n                                      date added: 2025/06/10<br/>\n                                      shelves: to-read<br/>\n                                      review: <br/><br/>",
      "numPages": "982"
    },
    {
      "id": "https://www.goodreads.com/review/show/6417264411?utm_medium=api&utm_source=rss",
      "title": "The Devils (The Devils, #1)",
      "link": "https://www.goodreads.com/review/show/6417264411?utm_medium=api&utm_source=rss",
      "bookId": "212276037",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1746869112l/212276037._SY75_.jpg",
      "bookDescription": "Holy work sometimes requires unholy deeds.<br />Brother Diaz has been summoned to the Sacred City, where he is certain a commendation and grand holy assignment awaits him. But his new flock is made up of unrepentant murderers, practitioners of ghastly magic, and outright monsters, and the mission he is tasked with will require bloody measures from them all in order to achieve its righteous ends.<br /><br />Elves lurk at our borders and hunger for our flesh, while greedy princes care for nothing but their own ambitions and comfort. With a hellish journey before him, it's a good thing Brother Diaz has the devils on his side.",
      "authorName": "Joe Abercrombie",
      "isbn": "",
      "userName": "Daniel",
      "userRating": "4",
      "userReadAt": "2025-06-09T00:00:00.000Z",
      "userDateAdded": "2025-06-10T06:40:15.000Z",
      "userDateCreated": "2024-04-10T12:38:09.000Z",
      "userShelves": "",
      "userReview": "",
      "averageRating": "4.3",
      "bookPublished": "2025",
      "description": "<a href=\"https://www.goodreads.com/book/show/212276037-the-devils?utm_medium=api&amp;utm_source=rss\"><img alt=\"The Devils (The Devils, #1)\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1746869112l/212276037._SY75_.jpg\" /></a><br/>\n                                      author: Joe Abercrombie<br/>\n                                      name: Daniel<br/>\n                                      average rating: 4.3<br/>\n                                      book published: 2025<br/>\n                                      rating: 4<br/>\n                                      read at: 2025/06/09<br/>\n                                      date added: 2025/06/09<br/>\n                                      shelves: <br/>\n                                      review: <br/><br/>",
      "numPages": "565"
    },
    {
      "id": "https://www.goodreads.com/review/show/7634293279?utm_medium=api&utm_source=rss",
      "title": "The AI Con: How to Fight Big Tech's Hype and Create the Future We Want",
      "link": "https://www.goodreads.com/review/show/7634293279?utm_medium=api&utm_source=rss",
      "bookId": "217432753",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1737124238l/217432753._SY75_.jpg",
      "bookDescription": "<strong>A smart, incisive look at the technologies sold as artificial intelligence, the drawbacks and pitfalls of technology sold under this banner, and why it’s crucial to recognize the many ways in which AI hype covers for a small set of power-hungry actors at work and in the world.</strong><br /><br />Is artificial intelligence going to take over the world? Have big tech scientists created an artificial lifeform that can think on its own? Is it going to put authors, artists, and others out of business? Are we about to enter an age where computers are better than humans at everything?<br /><br />The answer to these questions, linguist Emily M. Bender and sociologist Alex Hanna make clear, is “no,” “they wish,” “LOL,” and “definitely not.” This kind of thinking is a symptom of a phenomenon known as “AI hype.” Hype looks and smells It twists words and helps the rich get richer by justifying data theft, motivating surveillance capitalism, and devaluing human creativity in order to replace meaningful work with jobs that treat people like machines. In <em>The AI Con</em>, Bender and Hanna offer a sharp, witty, and wide-ranging take-down of AI hype across its many forms.<br /><br />Bender and Hanna show you how to spot AI hype, how to deconstruct it, and how to expose the power grabs it aims to hide. Armed with these tools, you will be prepared to push back against AI hype at work, as a consumer in the marketplace, as a skeptical newsreader, and as a citizen holding policymakers to account. Together, Bender and Hanna expose AI hype for what it a mask for Big Tech’s drive for profit, with little concern for who it affects.",
      "authorName": "Emily M. Bender",
      "isbn": "0063418568",
      "userName": "Daniel",
      "userRating": "0",
      "userReadAt": "",
      "userDateAdded": "2025-06-07T07:23:48.000Z",
      "userDateCreated": "2025-06-07T07:23:48.000Z",
      "userShelves": "to-read",
      "userReview": "",
      "averageRating": "3.8",
      "bookPublished": "2025",
      "description": "<a href=\"https://www.goodreads.com/book/show/217432753-the-ai-con?utm_medium=api&amp;utm_source=rss\"><img alt=\"The AI Con: How to Fight Big Tech&#39;s Hype and Create the Future We Want\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1737124238l/217432753._SY75_.jpg\" /></a><br/>\n                                      author: Emily M. Bender<br/>\n                                      name: Daniel<br/>\n                                      average rating: 3.8<br/>\n                                      book published: 2025<br/>\n                                      rating: 0<br/>\n                                      read at: <br/>\n                                      date added: 2025/06/07<br/>\n                                      shelves: to-read<br/>\n                                      review: <br/><br/>",
      "numPages": "288"
    },
    {
      "id": "https://www.goodreads.com/review/show/7421534755?utm_medium=api&utm_source=rss",
      "title": "Between Two Rivers: Ancient Mesopotamia and the Birth of History",
      "link": "https://www.goodreads.com/review/show/7421534755?utm_medium=api&utm_source=rss",
      "bookId": "218569867",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1736548401l/218569867._SY75_.jpg",
      "bookDescription": "<b>Humanity’s earliest efforts at recording and drawing meaning from history reveal how lives millennia ago were not so different from our own.</b><br /><br />Mesopotamia saw the first cities, devised the original writing system, sowed the early seeds of agriculture, and developed myths, medicine, and astronomy that all went on to influence societies around the world. However, the significance of this ancient civilization goes far beyond its technological inventions: These were the people who began the human tradition of recording their own histories.<br /><br />With each chapter focusing on a new artifact, historian Moudhy Al-Rashid takes us on a personal tour of ancient life: the brick that was the basis of Mesopotamian architecture; the classroom tablets that shed light on the timeless anxieties of student life; the stone obelisk that spoke to the vast socioeconomic gulfs. Ancient Mesopotamians wanted a witness to their lives, and thousands of years later, Al-Rashid shares their stories.",
      "authorName": "Moudhy Al-Rashid",
      "isbn": "1324036427",
      "userName": "Daniel",
      "userRating": "5",
      "userReadAt": "2025-06-03T00:00:00.000Z",
      "userDateAdded": "2025-06-03T07:23:32.000Z",
      "userDateCreated": "2025-03-21T07:18:01.000Z",
      "userShelves": "",
      "userReview": "",
      "averageRating": "4.1",
      "bookPublished": "2025",
      "description": "<a href=\"https://www.goodreads.com/book/show/218569867-between-two-rivers?utm_medium=api&amp;utm_source=rss\"><img alt=\"Between Two Rivers: Ancient Mesopotamia and the Birth of History\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1736548401l/218569867._SY75_.jpg\" /></a><br/>\n                                      author: Moudhy Al-Rashid<br/>\n                                      name: Daniel<br/>\n                                      average rating: 4.1<br/>\n                                      book published: 2025<br/>\n                                      rating: 5<br/>\n                                      read at: 2025/06/03<br/>\n                                      date added: 2025/06/03<br/>\n                                      shelves: <br/>\n                                      review: <br/><br/>",
      "numPages": "336"
    },
    {
      "id": "https://www.goodreads.com/review/show/7603170022?utm_medium=api&utm_source=rss",
      "title": "The Tale of Genji: The Authentic First Translation of the World's Earliest Novel (Tuttle Classics)",
      "link": "https://www.goodreads.com/review/show/7603170022?utm_medium=api&utm_source=rss",
      "bookId": "36334182",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1508059791l/36334182._SY75_.jpg",
      "bookDescription": "<b>The most famous work of Japanese literature and the world's first novel—written a thousand years ago and one of the enduring classics of world literature.</b><br /><br />Written centuries before the time of Shakespeare and even Chaucer, <i>The Tale of Genji</i> marks the birth of the novel—and after more than a millennium, this seminal work continues to enchant readers throughout the world. Lady Murasaki Shikibu and her tale's hero, Prince Genji, have had an unmatched influence on Japanese culture. Prince Genji manifests what was to become an image of the ideal Heian era courtier; gentle and passionate. Genji is also a master poet, dancer, musician and painter. <i>The Tale of Genji</i> follows Prince Genji through his many loves and varied passions. This book has influenced not only generations of courtiers and samurai of the distant past, but artists and painters even in modern times—episodes in the tale have been incorporated into the design of kimonos and handicrafts, and the four-line poems called <i>waka</i> which dance throughout this work have earned it a place as a classic text in the study of poetry.<br /><br />This version by Kencho Suematsu was the first-ever translation in English. Condensed, it's a quarter length of the unabridged text, making it perfect for readers with limited time.<br /><br />\"Not speaking is the wiser part,<br />And words are sometimes vain,<br />But to completely close the heart<br />In silence, gives me pain.\"<br /><br />—Prince Genji, in <i>The Tale of Genji</i>",
      "authorName": "Murasaki Shikibu",
      "isbn": "4805314648",
      "userName": "Daniel",
      "userRating": "4",
      "userReadAt": "2025-05-30T00:00:00.000Z",
      "userDateAdded": "2025-05-31T00:11:29.000Z",
      "userDateCreated": "2025-05-27T06:23:27.000Z",
      "userShelves": "",
      "userReview": "",
      "averageRating": "3.3",
      "bookPublished": "1000",
      "description": "<a href=\"https://www.goodreads.com/book/show/36334182-the-tale-of-genji?utm_medium=api&amp;utm_source=rss\"><img alt=\"The Tale of Genji: The Authentic First Translation of the World&#39;s Earliest Novel (Tuttle Classics)\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1508059791l/36334182._SY75_.jpg\" /></a><br/>\n                                      author: Murasaki Shikibu<br/>\n                                      name: Daniel<br/>\n                                      average rating: 3.3<br/>\n                                      book published: 1000<br/>\n                                      rating: 4<br/>\n                                      read at: 2025/05/30<br/>\n                                      date added: 2025/05/30<br/>\n                                      shelves: <br/>\n                                      review: <br/><br/>",
      "numPages": "224"
    },
    {
      "id": "https://www.goodreads.com/review/show/7588876762?utm_medium=api&utm_source=rss",
      "title": "Remarkably Bright Creatures",
      "link": "https://www.goodreads.com/review/show/7588876762?utm_medium=api&utm_source=rss",
      "bookId": "58733693",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1651600548l/58733693._SY75_.jpg",
      "bookDescription": "<b><i>Remarkably Bright Creatures</i>, an exploration of friendship, reckoning, and hope, tracing a widow's unlikely connection with a giant Pacific octopus</b>.<br /><br />After Tova Sullivan's husband died, she began working the night shift at the Sowell Bay Aquarium, mopping floors and tidying up. Keeping busy has always helped her cope, which she's been doing since her eighteen-year-old son, Erik, mysteriously vanished on a boat in Puget Sound over thirty years ago.<br /><br />Tova becomes acquainted with curmudgeonly Marcellus, a giant Pacific octopus living at the aquarium. Marcellus knows more than anyone can imagine but wouldn't dream of lifting one of his eight arms for his human captors--until he forms a remarkable friendship with Tova.<br /><br />Ever the detective, Marcellus deduces what happened the night Tova's son disappeared. And now Marcellus must use every trick his old invertebrate body can muster to unearth the truth for her before it's too late.<br /><br />Shelby Van Pelt's <strong>debut novel</strong> is a gentle reminder that sometimes taking a hard look at the past can help uncover a future that once felt impossible.",
      "authorName": "Shelby Van Pelt",
      "isbn": "0063204150",
      "userName": "Daniel",
      "userRating": "5",
      "userReadAt": "2025-05-26T00:00:00.000Z",
      "userDateAdded": "2025-05-27T02:40:51.000Z",
      "userDateCreated": "2025-05-22T00:21:25.000Z",
      "userShelves": "",
      "userReview": "",
      "averageRating": "4.3",
      "bookPublished": "2022",
      "description": "<a href=\"https://www.goodreads.com/book/show/58733693-remarkably-bright-creatures?utm_medium=api&amp;utm_source=rss\"><img alt=\"Remarkably Bright Creatures\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1651600548l/58733693._SY75_.jpg\" /></a><br/>\n                                      author: Shelby Van Pelt<br/>\n                                      name: Daniel<br/>\n                                      average rating: 4.3<br/>\n                                      book published: 2022<br/>\n                                      rating: 5<br/>\n                                      read at: 2025/05/26<br/>\n                                      date added: 2025/05/26<br/>\n                                      shelves: <br/>\n                                      review: <br/><br/>",
      "numPages": "368"
    },
    {
      "id": "https://www.goodreads.com/review/show/7600943160?utm_medium=api&utm_source=rss",
      "title": "Battle of the Big Bang: The New Tales of Our Cosmic Origins",
      "link": "https://www.goodreads.com/review/show/7600943160?utm_medium=api&utm_source=rss",
      "bookId": "218462092",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1729901579l/218462092._SY75_.jpg",
      "bookDescription": "<b>A thrilling exploration of competing cosmological origin stories, comparing new scientific ideas that upend our very notions of space, time, and reality.</b><br /><br /> <br /><br />By most popular accounts, the universe started with a bang some 13.8 billion years ago. But what happened before the Big Bang? Here prominent cosmologist Niayesh Afshordi and science communicator Phil Halper offer a tour of the peculiar bouncing and cyclic universes, time loops, creations from nothing, multiverses, black hole births, string theories, and holograms. Along the way, they offer both a call for new physics and a riveting story of scientific debate.<br /><br /> <br /><br />Incorporating Afshordi’s cutting-edge research and insights from Halper’s original interviews with scientists like Stephen Hawking, Roger Penrose, and Alan Guth, <i>Battle of the Big Bang</i> compares these models for the origin of our origins, showing each theory’s strengths and weaknesses and explaining new attempts to test these theories. <i>Battle of the Big Bang</i> is a tale of rivalries and intrigue, of clashes of ideas that have raged from Greek antiquity to the present day over whether the universe is eternal or had a beginning, whether it is unique or one of many. But most of all, Afshordi and Halper show that this search is filled with wonder, discovery, and community—all essential for remembering a forgotten cosmic past.",
      "authorName": "Niayesh Afshordi",
      "isbn": "0226830470",
      "userName": "Daniel",
      "userRating": "0",
      "userReadAt": "",
      "userDateAdded": "2025-05-26T15:13:17.000Z",
      "userDateCreated": "2025-05-26T15:13:09.000Z",
      "userShelves": "on-deck",
      "userReview": "",
      "averageRating": "4.1",
      "bookPublished": "",
      "description": "<a href=\"https://www.goodreads.com/book/show/218462092-battle-of-the-big-bang?utm_medium=api&amp;utm_source=rss\"><img alt=\"Battle of the Big Bang: The New Tales of Our Cosmic Origins\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1729901579l/218462092._SY75_.jpg\" /></a><br/>\n                                      author: Niayesh Afshordi<br/>\n                                      name: Daniel<br/>\n                                      average rating: 4.1<br/>\n                                      book published: <br/>\n                                      rating: 0<br/>\n                                      read at: <br/>\n                                      date added: 2025/05/26<br/>\n                                      shelves: on-deck<br/>\n                                      review: <br/><br/>",
      "numPages": "360"
    },
    {
      "id": "https://www.goodreads.com/review/show/6967905232?utm_medium=api&utm_source=rss",
      "title": "Blood Over Bright Haven",
      "link": "https://www.goodreads.com/review/show/6967905232?utm_medium=api&utm_source=rss",
      "bookId": "208430658",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1717354584l/208430658._SY75_.jpg",
      "bookDescription": "<b>Magic has made the city of Tiran an industrial utopia, but magic has a cost—and the collectors have come calling.</b><br /><br />An orphan since the age of four, Sciona has always had more to prove than her fellow students. For twenty years, she has devoted every waking moment to the study of magic, fueled by a mad desire to achieve the impossible: to be the first woman ever admitted to the High Magistry. When she finally claws her way up the ranks to become a highmage, however, she finds that her challenges have just begun. Her new colleagues will stop at nothing to let her know she is unwelcome, beginning with giving her a janitor instead of a qualified lab assistant.<br /><br />What neither Sciona nor her peers realize is that her taciturn assistant was once more than a janitor; before he mopped floors for the mages, Thomil was a nomadic hunter from beyond Tiran’s magical barrier. Ten years have passed since he survived the perilous crossing that killed his family. But working for a highmage, he sees the opportunity to finally understand the forces that decimated his tribe, drove him from his homeland, and keep the Tiranish in power.<br /><br />Through their fractious relationship, mage and outsider uncover an ancient secret that could change the course of magic forever—if it doesn’t get them killed first. Sciona has defined her life by the pursuit of truth, but how much is one truth worth with the fate of civilization in the balance?<br /><br /><b>A standalone dark academia brimming with mystery, tragedy, and the damning echoes of the past. For fans of Leigh Bardugo, V. E. Schwab, and Fullmetal Alchemist.</b><br /><br />(Content warnings for gore, sexual assault, and suicidal ideation)",
      "authorName": "M.L. Wang",
      "isbn": "0593873351",
      "userName": "Daniel",
      "userRating": "4",
      "userReadAt": "2025-05-24T00:00:00.000Z",
      "userDateAdded": "2025-05-24T20:09:17.000Z",
      "userDateCreated": "2024-10-31T08:26:30.000Z",
      "userShelves": "",
      "userReview": "",
      "averageRating": "4.4",
      "bookPublished": "2023",
      "description": "<a href=\"https://www.goodreads.com/book/show/208430658-blood-over-bright-haven?utm_medium=api&amp;utm_source=rss\"><img alt=\"Blood Over Bright Haven\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1717354584l/208430658._SY75_.jpg\" /></a><br/>\n                                      author: M.L. Wang<br/>\n                                      name: Daniel<br/>\n                                      average rating: 4.4<br/>\n                                      book published: 2023<br/>\n                                      rating: 4<br/>\n                                      read at: 2025/05/24<br/>\n                                      date added: 2025/05/24<br/>\n                                      shelves: <br/>\n                                      review: <br/><br/>",
      "numPages": "430"
    },
    {
      "id": "https://www.goodreads.com/review/show/7582581059?utm_medium=api&utm_source=rss",
      "title": "Why Politicians Lie About Trade: ... and What You Need to Know About It",
      "link": "https://www.goodreads.com/review/show/7582581059?utm_medium=api&utm_source=rss",
      "bookId": "223225658",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1735918833l/223225658._SY75_.jpg",
      "bookDescription": "<b>'An absolute masterclass in how to communicate complex information simply' </b><i>– author Ian Dunt</i><br /><br /><b>'It succeeds both in explaining how global trade works and how it affects things many voters actually care about' </b><i>– Financial Times</i><br /><br /><b>'My hero on this is Dmitry Grozoubinski, who has written the most beautiful book'</b><i><b> </b>– author Rory Stewart</i><br /><br /><i>Why Politicians Lie About Trade</i> reveals how international trade really works – the roadblock tariffs, the hard-won deals, and the damaging disputes.<br /><br />Written with the expectation that the US would trigger a global trade war, this book takes readers on a revealing and sometimes funny tour of the shadowy workings of the $32 trillion-a-year international business that puts goods on our shelves and food in our mouths.<br /><br />Using clear writing and lively case studies, former trade negotiator Dmitry Grozoubinski reveals the underlying political and geographical forces that shape the impact of cross-border trade on food, jobs, gender, conflict, climate change and many other issues.<br /><br />And he reveals what politicians cover up about the system – and why it matters to your world.<br /><br />In short,<i> Why Politicians Lie About Trade</i> contains everything you need to know about the tricky network of imports and exports that rules our world – and is an ideal companion to popular business books like <i>Taxtopia</i> and <i>Freakonomics.</i><br /><br />Serious publications such as the <i>Financial Times</i> and the <i>World Trade Review</i> have endorsed the book, along with popular authors Ian Dunt, James O'Brien and Rory Stewart.<br /><br /><b>Reviews</b><b>'For some time, there has been a clear gap in the market</b> for a guide to trade policy to help those with an interest to gain a better understanding of this important field and enable them to engage more actively in trade policy debates. Dmitry Grozoubinski’s <i>Why Politicians Lie About Trade</i> fits the bill admirably.'<i> Justin Brown, the Lowy Institute</i><br /><br /><b>'Despite being an entertaining read, his book is no joke.</b> Structured in two parts, it succeeds both in explaining how global trade works and in illustrating how the rather rarefied topic of international trade policy affects things many voters actually care jobs, national security, climate change, and so on. Given how protectionism is increasingly touted as a simple solution to complex social and economic strains, it is also excellently timed. <i>Felix Martin, Financial Times</i><br /><br /><b>'You will come out of it far more knowledgeable than you went in</b>, and shielded from some of the more egregious deceit politicians want to inflict on you. You'll also laugh out loud.' <i>Ian Dunt, author of How Westminster Works</i><br /><br />'<b>Written by a former trade negotiator who has trained many British diplomats, this book is authoritative, yet – and here’s the strange part – actually fun to read. </b>Dmitry Grozoubinski has a rare knack for explaining complex information in an accessible and light-hearted way.' <i>Richard Baldwin, Professor of International Economics</i><i>'</i><b>Writing a 300-page book on international trade policy issues in a way that is not only accessible </b>but also entertaining would be a serious challenge for most authors. Dmitry Grozoubinski’s new book rises to that challenge.",
      "authorName": "Dmitry Grozoubinski",
      "isbn": "",
      "userName": "Daniel",
      "userRating": "4",
      "userReadAt": "2025-05-20T00:00:00.000Z",
      "userDateAdded": "2025-05-21T04:17:36.000Z",
      "userDateCreated": "2025-05-19T20:16:27.000Z",
      "userShelves": "",
      "userReview": "",
      "averageRating": "4.1",
      "bookPublished": "",
      "description": "<a href=\"https://www.goodreads.com/book/show/223225658-why-politicians-lie-about-trade?utm_medium=api&amp;utm_source=rss\"><img alt=\"Why Politicians Lie About Trade: ... and What You Need to Know About It\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1735918833l/223225658._SY75_.jpg\" /></a><br/>\n                                      author: Dmitry Grozoubinski<br/>\n                                      name: Daniel<br/>\n                                      average rating: 4.1<br/>\n                                      book published: <br/>\n                                      rating: 4<br/>\n                                      read at: 2025/05/20<br/>\n                                      date added: 2025/05/20<br/>\n                                      shelves: <br/>\n                                      review: <br/><br/>",
      "numPages": "328"
    },
    {
      "id": "https://www.goodreads.com/review/show/7553596030?utm_medium=api&utm_source=rss",
      "title": "Deep Medicine: How Artificial Intelligence Can Make Healthcare Human Again",
      "link": "https://www.goodreads.com/review/show/7553596030?utm_medium=api&utm_source=rss",
      "bookId": "40915762",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1546028482l/40915762._SY75_.jpg",
      "bookDescription": "<b>A <i>Science Friday </i>pick for book of the year, 2019</b><br /><b>\n  <br />\n</b><br /><b>One of America's top doctors reveals how AI will empower physicians and revolutionize patient care </b><br /><br /><br />Medicine has become inhuman, to disastrous effect. The doctor-patient relationship--the heart of medicine--is broken: doctors are too distracted and overwhelmed to truly connect with their patients, and medical errors and misdiagnoses abound. In <i>Deep Medicine</i>, leading physician Eric Topol reveals how artificial intelligence can help. AI has the potential to transform everything doctors do, from notetaking and medical scans to diagnosis and treatment, greatly cutting down the cost of medicine and reducing human mortality. By freeing physicians from the tasks that interfere with human connection, AI will create space for the real healing that takes place between a doctor who can listen and a patient who needs to be heard.<br /><br /><br />Innovative, provocative, and hopeful, <i>Deep Medicine</i> shows us how the awesome power of AI can make medicine better, for all the humans involved.",
      "authorName": "Eric J. Topol",
      "isbn": "1541644638",
      "userName": "Daniel",
      "userRating": "4",
      "userReadAt": "2025-05-19T00:00:00.000Z",
      "userDateAdded": "2025-05-20T06:45:10.000Z",
      "userDateCreated": "2025-05-08T19:47:37.000Z",
      "userShelves": "",
      "userReview": "",
      "averageRating": "4.0",
      "bookPublished": "2019",
      "description": "<a href=\"https://www.goodreads.com/book/show/40915762-deep-medicine?utm_medium=api&amp;utm_source=rss\"><img alt=\"Deep Medicine: How Artificial Intelligence Can Make Healthcare Human Again\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1546028482l/40915762._SY75_.jpg\" /></a><br/>\n                                      author: Eric J. Topol<br/>\n                                      name: Daniel<br/>\n                                      average rating: 4.0<br/>\n                                      book published: 2019<br/>\n                                      rating: 4<br/>\n                                      read at: 2025/05/19<br/>\n                                      date added: 2025/05/19<br/>\n                                      shelves: <br/>\n                                      review: <br/><br/>",
      "numPages": "400"
    },
    {
      "id": "https://www.goodreads.com/review/show/7533109759?utm_medium=api&utm_source=rss",
      "title": "The Pillow Book",
      "link": "https://www.goodreads.com/review/show/7533109759?utm_medium=api&utm_source=rss",
      "bookId": "18185",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1328373976l/18185._SX50_.jpg",
      "bookDescription": "Сей-шьонагон (966 - 1017) - відома японська письменниця. Її \"Записки в узголів'ї\" - один з кращих творів доби Хейан (794 - 1185), написаний у жанрі дзуйхіцу - філософського ліричного есе, сповіді. Особливості цього оригінального есеїстичного жанру літератури середньовічної Японії була необмежена свобода авторського письма, без будь-якого заздалегідь складеного плану - своєрідне \"слідування пензлю\", коли автор записував в окремих, не пов'язаних єдиним стилем, темою та сюжетом розділах (данах) особисті переживання, почуття, емоції, різноманітні роздуми, власні філософські міркування, цікаві спостереження тощо. Перекладений багатьма мовами, цей геніальний твір \"золотої доби\" японської класичної літератури вже понад тисячу років викликає захоплення багатьох поколінь читачів у всьому світі, до числа яких відтепер мають змогу долучитися й українці.",
      "authorName": "Sei Shōnagon",
      "isbn": "0231073372",
      "userName": "Daniel",
      "userRating": "4",
      "userReadAt": "2025-05-17T00:00:00.000Z",
      "userDateAdded": "2025-05-18T06:14:05.000Z",
      "userDateCreated": "2025-05-01T07:51:53.000Z",
      "userShelves": "",
      "userReview": "",
      "averageRating": "4.1",
      "bookPublished": "1002",
      "description": "<a href=\"https://www.goodreads.com/book/show/18185.The_Pillow_Book?utm_medium=api&amp;utm_source=rss\"><img alt=\"The Pillow Book\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1328373976l/18185._SX50_.jpg\" /></a><br/>\n                                      author: Sei Shōnagon<br/>\n                                      name: Daniel<br/>\n                                      average rating: 4.1<br/>\n                                      book published: 1002<br/>\n                                      rating: 4<br/>\n                                      read at: 2025/05/17<br/>\n                                      date added: 2025/05/17<br/>\n                                      shelves: <br/>\n                                      review: <br/><br/>",
      "numPages": "419"
    },
    {
      "id": "https://www.goodreads.com/review/show/7573384862?utm_medium=api&utm_source=rss",
      "title": "Monsoon: Delicious Indian Recipes for Every Day and Season",
      "link": "https://www.goodreads.com/review/show/7573384862?utm_medium=api&utm_source=rss",
      "bookId": "217485822",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1740972129l/217485822._SX50_.jpg",
      "bookDescription": "<b>AS SEEN ON TV<br /><br />“Asma's approach here is seasonal, though it’s one that addresses not just the weather, but our needs and moods, offering an edible calendar to give succour and delight throughout the year.” – Nigella Lawson</b><br /><br /><b>“Open this book anywhere and you'll find something you'll want to eat” – Delicious Magazine.</b><br /><br /><b>________</b><br /><br /><b>Join chef and founder of London’s famous Darjeeling Express restaurant on a flavour odyssey as she shares delicious Indian recipes and family favourites to awaken your palate and nourish your soul. </b><br /><br />Get ready to embrace <b>six seasons of flavour </b>in this stunning new collection of <b>80 bright and vibrant Indian recipes</b> inspired by Asma’s native Bengal.<br /><br />Be guided on an atmospheric journey through India's culinary landscape and discover the principles of <b>Ayurvedic cooking</b>. Enjoy a masterclass in creating mouthwatering, easy curries, sides, and desserts that sing with flavour, such <br /><br /><b>MIDWEEK </b> <b>Quick Bengali chicken korma<br />VEGETARIAN Delicate lentil fritters with spiced yoghurt<br />INDIAN Crispy and spicy tawa toasties<br />COMFORT Spiced and creamy pumpkin dhal<br />SWEET Yogurt with saffron and pistachio</b><br /><br />This Indian cookbook teaches you how to use <b>Indian spices</b> confidently, master new cooking techniques and unearth a treasure trove of unforgettable recipes including, <b>veg-friendly curries </b>and fantastic menus to entertain.<br /><br /><b>Monsoon </b>celebrates the pure joy of eating with recipes to suit every craving – a must have for anyone looking to bring flavour back to their kitchen.",
      "authorName": "Asma Khan",
      "isbn": "0241755557",
      "userName": "Daniel",
      "userRating": "0",
      "userReadAt": "",
      "userDateAdded": "2025-05-16T09:42:01.000Z",
      "userDateCreated": "2025-05-16T09:42:01.000Z",
      "userShelves": "to-read",
      "userReview": "",
      "averageRating": "3.8",
      "bookPublished": "",
      "description": "<a href=\"https://www.goodreads.com/book/show/217485822-monsoon?utm_medium=api&amp;utm_source=rss\"><img alt=\"Monsoon: Delicious Indian Recipes for Every Day and Season\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1740972129l/217485822._SX50_.jpg\" /></a><br/>\n                                      author: Asma Khan<br/>\n                                      name: Daniel<br/>\n                                      average rating: 3.8<br/>\n                                      book published: <br/>\n                                      rating: 0<br/>\n                                      read at: <br/>\n                                      date added: 2025/05/16<br/>\n                                      shelves: to-read<br/>\n                                      review: <br/><br/>",
      "numPages": "415"
    },
    {
      "id": "https://www.goodreads.com/review/show/7562321157?utm_medium=api&utm_source=rss",
      "title": "Apple in China: The Capture of the World's Greatest Company",
      "link": "https://www.goodreads.com/review/show/7562321157?utm_medium=api&utm_source=rss",
      "bookId": "217410142",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1737571239l/217410142._SY75_.jpg",
      "bookDescription": "<b>*** THE <i>NEW YORK TIMES</i> BESTSELLER *** <br /><br /> ‘Absolutely riveting’ </b>Peter Frankopan, author of <i>The Silk Roads</i><br /><b>‘Disturbing and enlightening’ </b>Chris Miller, author of <i>Chip War</i><br /><b>‘Hugely important’ </b>Rana Foroohar, author of <i>Makers and Takers</i><br /><b>‘A once-in-a-generation read’</b> Robert D. Kaplan, author of <i>Waste Land</i><br /><br /><b>As Trump wages a tariff war with China, seeking to boost domestic electronics manufacturing, this book offers an unparalleled insight into why his strategy is embarrassingly naïve.</b><br /><br /> Apple isn’t just a brand; it’s the world’s most valuable company and creator of the 21st century’s defining product. The iPhone has revolutionized the way we live, work and connect. But Apple is now a victim of its own success, caught in the middle of a new Cold War between two superpowers.<br /><br /> On the brink of bankruptcy in 1996, Apple adopted an outsourcing strategy. By 2003 it was lured to China by the promise of affordable, ubiquitous labour. As the iPod and iPhone transformed Apple’s fortunes, their sophisticated production played a seminal role in financing, training, supervising and supplying Chinese manufacturers – skills Beijing is now weaponizing against the West.<br /><br /> Investigative journalist Patrick McGee draws on 200 interviews with former Apple executives and engineers to reveal how Cupertino’s choice to anchor its supply chain in China has increasingly made it vulnerable to the regime’s whims. Both an insider’s historical account and a cautionary tale, <i>Apple in China</i> is the first history of Apple to go beyond the biographies of its top executives and set the iPhone’s global domination within an increasingly fraught geopolitical context.<br />",
      "authorName": "Patrick  McGee",
      "isbn": "1398534382",
      "userName": "Daniel",
      "userRating": "5",
      "userReadAt": "2025-05-15T00:00:00.000Z",
      "userDateAdded": "2025-05-15T08:03:28.000Z",
      "userDateCreated": "2025-05-12T08:24:50.000Z",
      "userShelves": "",
      "userReview": "",
      "averageRating": "4.6",
      "bookPublished": "",
      "description": "<a href=\"https://www.goodreads.com/book/show/217410142-apple-in-china?utm_medium=api&amp;utm_source=rss\"><img alt=\"Apple in China: The Capture of the World&#39;s Greatest Company\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1737571239l/217410142._SY75_.jpg\" /></a><br/>\n                                      author: Patrick  McGee<br/>\n                                      name: Daniel<br/>\n                                      average rating: 4.6<br/>\n                                      book published: <br/>\n                                      rating: 5<br/>\n                                      read at: 2025/05/15<br/>\n                                      date added: 2025/05/15<br/>\n                                      shelves: <br/>\n                                      review: <br/><br/>",
      "numPages": "448"
    },
    {
      "id": "https://www.goodreads.com/review/show/7556776067?utm_medium=api&utm_source=rss",
      "title": "The Tomb of Dragons (The Cemeteries of Amalo, #3)",
      "link": "https://www.goodreads.com/review/show/7556776067?utm_medium=api&utm_source=rss",
      "bookId": "211004174",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1715350354l/211004174._SX50_.jpg",
      "bookDescription": "Thara Celehar has lost his ability to speak with the dead. When that title of Witness for the Dead is gone, what defines him?<br /><br />While his title may be gone, his duties are not. Celehar contends with a municipal cemetery with fifty years of secrets, the damage of a revethavar he’s terrified to remember, and a group of miners who are more than willing to trade Celehar’s life for a chance at what they feel they’re owed.<br /><br />Celehar does not have to face these impossible tasks alone. Joining him are his mentee Velhiro Tomasaran, still finding her footing with the investigative nature of their job; Iäna Pel-Thenhior, his beloved opera director friend and avid supporter; and the valiant guard captain Hanu Olgarezh.<br /><br />Amidst the backdrop of a murder and a brewing political uprising, Celehar must seek justice for those who cannot find it themselves under a tense political system. The repercussions of his quest are never as simple they seem, and Celehar’s own life and happiness hang in the balance.",
      "authorName": "Katherine Addison",
      "isbn": "125081619X",
      "userName": "Daniel",
      "userRating": "4",
      "userReadAt": "2025-05-12T00:00:00.000Z",
      "userDateAdded": "2025-05-13T06:01:59.000Z",
      "userDateCreated": "2025-05-10T02:26:16.000Z",
      "userShelves": "",
      "userReview": "",
      "averageRating": "4.3",
      "bookPublished": "2025",
      "description": "<a href=\"https://www.goodreads.com/book/show/211004174-the-tomb-of-dragons?utm_medium=api&amp;utm_source=rss\"><img alt=\"The Tomb of Dragons (The Cemeteries of Amalo, #3)\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1715350354l/211004174._SX50_.jpg\" /></a><br/>\n                                      author: Katherine Addison<br/>\n                                      name: Daniel<br/>\n                                      average rating: 4.3<br/>\n                                      book published: 2025<br/>\n                                      rating: 4<br/>\n                                      read at: 2025/05/12<br/>\n                                      date added: 2025/05/12<br/>\n                                      shelves: <br/>\n                                      review: <br/><br/>",
      "numPages": "352"
    },
    {
      "id": "https://www.goodreads.com/review/show/7549709087?utm_medium=api&utm_source=rss",
      "title": "The Grief of Stones (The Cemeteries of Amalo, #2)",
      "link": "https://www.goodreads.com/review/show/7549709087?utm_medium=api&utm_source=rss",
      "bookId": "58724898",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1637961242l/58724898._SX50_.jpg",
      "bookDescription": "<b>In <i>The Grief of Stones</i>, Katherine Addison returns to the world of <i>The Goblin Emperor</i> with a direct sequel to <i>The Witness For The Dead</i>...</b><br /><br />Celehar’s life as the Witness for the Dead of Amalo grows less isolated as his circle of friends grows larger. He has been given an apprentice to teach, and he has stumbled over a scandal of the city—the foundling girls. Orphans with no family to claim them and no funds to buy an apprenticeship. Foundling boys go to the Prelacies; foundling girls are sold into service, or worse.<br /><br />At once touching and shattering, Celehar’s witnessing for one of these girls will lead him into the depths of his own losses. The love of his friends will lead him out again.",
      "authorName": "Katherine Addison",
      "isbn": "1250813891",
      "userName": "Daniel",
      "userRating": "4",
      "userReadAt": "2025-05-09T00:00:00.000Z",
      "userDateAdded": "2025-05-10T06:45:30.000Z",
      "userDateCreated": "2025-05-07T06:37:23.000Z",
      "userShelves": "",
      "userReview": "",
      "averageRating": "4.3",
      "bookPublished": "2022",
      "description": "<a href=\"https://www.goodreads.com/book/show/58724898-the-grief-of-stones?utm_medium=api&amp;utm_source=rss\"><img alt=\"The Grief of Stones (The Cemeteries of Amalo, #2)\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1637961242l/58724898._SX50_.jpg\" /></a><br/>\n                                      author: Katherine Addison<br/>\n                                      name: Daniel<br/>\n                                      average rating: 4.3<br/>\n                                      book published: 2022<br/>\n                                      rating: 4<br/>\n                                      read at: 2025/05/09<br/>\n                                      date added: 2025/05/09<br/>\n                                      shelves: <br/>\n                                      review: <br/><br/>",
      "numPages": "245"
    },
    {
      "id": "https://www.goodreads.com/review/show/7440040673?utm_medium=api&utm_source=rss",
      "title": "How to Read a Book: The Classic Guide to Intelligent Reading",
      "link": "https://www.goodreads.com/review/show/7440040673?utm_medium=api&utm_source=rss",
      "bookId": "567610",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1310993739l/567610._SY75_.jpg",
      "bookDescription": "<i>How to Read a Book,</i> originally published in 1940, has become a rare phenomenon, a <i>living</i> classic. It is the best and most successful guide to reading comprehension for the general reader. And now it has been completely rewritten and updated. <p> You are told about the various levels of reading and how to achieve them – from elementary reading, through systematic skimming and inspectional reading, to speed reading, you learn how to pigeonhole a book, X-ray it, extract the author's message, criticize. You are taught the different reading techniques for reading practical books, imaginative literature, plays, poetry, history, science and mathematics, philosophy and social science. </p><p> Finally, the authors offer a recommended reading list and supply reading tests whereby you can measure your own progress in reading skills, comprehension and speed.<br /><br />This a previously-published edition of <a href=\"https://www.goodreads.com/book/show/41878914-how-to-read-a-book\" rel=\"nofollow noopener\">ISBN 9780671212094</a></p>",
      "authorName": "Mortimer J. Adler",
      "isbn": "",
      "userName": "Daniel",
      "userRating": "4",
      "userReadAt": "2025-05-09T00:00:00.000Z",
      "userDateAdded": "2025-05-10T02:22:02.000Z",
      "userDateCreated": "2025-03-27T18:08:07.000Z",
      "userShelves": "",
      "userReview": "",
      "averageRating": "4.0",
      "bookPublished": "1940",
      "description": "<a href=\"https://www.goodreads.com/book/show/567610.How_to_Read_a_Book?utm_medium=api&amp;utm_source=rss\"><img alt=\"How to Read a Book: The Classic Guide to Intelligent Reading\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1310993739l/567610._SY75_.jpg\" /></a><br/>\n                                      author: Mortimer J. Adler<br/>\n                                      name: Daniel<br/>\n                                      average rating: 4.0<br/>\n                                      book published: 1940<br/>\n                                      rating: 4<br/>\n                                      read at: 2025/05/09<br/>\n                                      date added: 2025/05/09<br/>\n                                      shelves: <br/>\n                                      review: <br/><br/>",
      "numPages": "442"
    },
    {
      "id": "https://www.goodreads.com/review/show/7553594004?utm_medium=api&utm_source=rss",
      "title": "Super Agers: An Evidence-Based Approach to Longevity",
      "link": "https://www.goodreads.com/review/show/7553594004?utm_medium=api&utm_source=rss",
      "bookId": "220160337",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1730640080l/220160337._SY75_.jpg",
      "bookDescription": "<b>\n  <i>Super Agers</i>\n</b><b> is a detailed guide to a revolution transforming human longevity. This is a breakthrough moment in the history of human health care. The person making that bold claim is one of the most respected medical researchers in the world, Eric Topol. </b><br /><br />Dr. Topol’s unprecedented, evidenced-based guide is about how you and your family and friends can benefit from new treatments coming available at a faster rate than ever. From his unique position as a leader overseeing millions in research funding, Dr. Topol also explains the fundamental reasons—from semaglutides to AI—that we can be confident these breakthroughs will continue. Ninety-five percent of Americans over sixty have at least one chronic disease and almost as many have two. That is the essential problem this revolution is solving. He explains the power of the new approaches to the worst chronic killers—diabetes/obesity, heart disease, cancer, and neurodegeneration—and how treatments can begin long before middle age, and even long after. In thirty years, we will have five times as many people at least one hundred years old and they will be healthier than ever because of the breakthroughs Dr. Topol describes.<br /> <br />The amazing discoveries Topol brings into sharp focus are deeply inspiring about our human potential. We can now realistically see how we can make considerable headway for preventing age-related diseases and may one day be able to slow the body-wide aging process itself.",
      "authorName": "Eric Topol",
      "isbn": "1668067668",
      "userName": "Daniel",
      "userRating": "0",
      "userReadAt": "",
      "userDateAdded": "2025-05-08T19:46:49.000Z",
      "userDateCreated": "2025-05-08T19:46:48.000Z",
      "userShelves": "on-deck",
      "userReview": "",
      "averageRating": "3.5",
      "bookPublished": "",
      "description": "<a href=\"https://www.goodreads.com/book/show/220160337-super-agers?utm_medium=api&amp;utm_source=rss\"><img alt=\"Super Agers: An Evidence-Based Approach to Longevity\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1730640080l/220160337._SY75_.jpg\" /></a><br/>\n                                      author: Eric Topol<br/>\n                                      name: Daniel<br/>\n                                      average rating: 3.5<br/>\n                                      book published: <br/>\n                                      rating: 0<br/>\n                                      read at: <br/>\n                                      date added: 2025/05/08<br/>\n                                      shelves: on-deck<br/>\n                                      review: <br/><br/>",
      "numPages": "464"
    },
    {
      "id": "https://www.goodreads.com/review/show/7497786847?utm_medium=api&utm_source=rss",
      "title": "The Witness for the Dead (The Cemeteries of Amalo, #1)",
      "link": "https://www.goodreads.com/review/show/7497786847?utm_medium=api&utm_source=rss",
      "bookId": "41302953",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1603852509l/41302953._SY75_.jpg",
      "bookDescription": "<b>Katherine Addison returns to the glittering world she created for her beloved novel, <i>'The Goblin Emperor',</i> in this stand-alone sequel.</b><br /><br />When the young half-goblin emperor Maia sought to learn who had killed his father and half-brothers, he turned to an obscure resident of his Court, a Prelate of Ulis and a Witness for the Dead. Thara Celehar found the truth, though it did him no good to discover it. He lost his place as a retainer of his cousin the former Empress, and made far too many enemies among the many factions vying for power in the new Court. The favor of the Emperor is a dangerous coin.<br /><br />Now Celehar lives in the city of Amalo, far from the Court though not exactly in exile. He has not escaped from politics, but his position gives him the ability to serve the common people of the city, which is his preference. He lives modestly, but his decency and fundamental honesty will not permit him to live quietly. As a Witness for the Dead, he can, sometimes, speak to the recently dead: see the last thing they saw, know the last thought they had, experience the last thing they felt. it is his duty to use that ability to resolve disputes, to ascertain the intent of the dead, to find the killers of the murdered.<br /><br />Celehar's skills now lead him out of the quiet and into a morass of treachery, murder, and injustice. No matter his own background with the imperial house, Celehar will stand with the commoners, and possibly find a light in the darkness.",
      "authorName": "Katherine Addison",
      "isbn": "0765387441",
      "userName": "Daniel",
      "userRating": "5",
      "userReadAt": "2025-05-06T00:00:00.000Z",
      "userDateAdded": "2025-05-07T06:36:55.000Z",
      "userDateCreated": "2025-04-18T06:06:41.000Z",
      "userShelves": "",
      "userReview": "",
      "averageRating": "4.1",
      "bookPublished": "2021",
      "description": "<a href=\"https://www.goodreads.com/book/show/41302953-the-witness-for-the-dead?utm_medium=api&amp;utm_source=rss\"><img alt=\"The Witness for the Dead (The Cemeteries of Amalo, #1)\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1603852509l/41302953._SY75_.jpg\" /></a><br/>\n                                      author: Katherine Addison<br/>\n                                      name: Daniel<br/>\n                                      average rating: 4.1<br/>\n                                      book published: 2021<br/>\n                                      rating: 5<br/>\n                                      read at: 2025/05/06<br/>\n                                      date added: 2025/05/06<br/>\n                                      shelves: <br/>\n                                      review: <br/><br/>",
      "numPages": "240"
    },
    {
      "id": "https://www.goodreads.com/review/show/5454587979?utm_medium=api&utm_source=rss",
      "title": "The First Scientist: Anaximander and His Legacy",
      "link": "https://www.goodreads.com/review/show/5454587979?utm_medium=api&utm_source=rss",
      "bookId": "12632657",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1328752524l/12632657._SY75_.jpg",
      "bookDescription": "THIS BOOK WILL NO LONGER BE AVAILABLE AFTER SEPTEMBER 10, 2021. Carlo Rovelli, a leading theoretical physicist, uses the figure of Anaximander as the starting point for an examination of scientific thinking its limits, its strengths, its benefits to humankind, and its controversial relationship with religion. Anaximander, the sixth-century BC Greek philosopher, is often called the first scientist because he was the first to suggest that order in the world was due to natural forces, not supernatural ones. He is the first person known to understand that the Earth floats in space; to believe that the sun, the moon, and the stars rotate around it—seven centuries before Ptolemy; to argue that all animals came from the sea and evolved; and to posit that universal laws control all change in the world. Anaximander taught Pythagoras, who would build on Anaximander’s scientific theories by applying mathematical laws to natural phenomena. In the award-winning The First Anaximander and His Legacy , translated here for the first time in English, Rovelli restores Anaximander to his place in the history of science by carefully reconstructing his theories from what is known to us and examining them in their historical and philosophical contexts. Rovelli demonstrates that Anaximander’s discoveries and theories were decisive influences, putting Western culture on its path toward a scientific revolution. Developing this connection, Rovelli redefines science as a continuous redrawing of our conceptual image of the world. He concludes that scientific thinking—the legacy of Anaximander—is only reliable when it constantly tests the limits of our current knowledge.",
      "authorName": "Carlo Rovelli",
      "isbn": "1594161313",
      "userName": "Daniel",
      "userRating": "5",
      "userReadAt": "2025-05-05T00:00:00.000Z",
      "userDateAdded": "2025-05-06T02:45:50.000Z",
      "userDateCreated": "2023-04-01T06:30:11.000Z",
      "userShelves": "",
      "userReview": "",
      "averageRating": "4.0",
      "bookPublished": "2005",
      "description": "<a href=\"https://www.goodreads.com/book/show/12632657-the-first-scientist?utm_medium=api&amp;utm_source=rss\"><img alt=\"The First Scientist: Anaximander and His Legacy\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1328752524l/12632657._SY75_.jpg\" /></a><br/>\n                                      author: Carlo Rovelli<br/>\n                                      name: Daniel<br/>\n                                      average rating: 4.0<br/>\n                                      book published: 2005<br/>\n                                      rating: 5<br/>\n                                      read at: 2025/05/05<br/>\n                                      date added: 2025/05/05<br/>\n                                      shelves: <br/>\n                                      review: <br/><br/>",
      "numPages": "256"
    },
    {
      "id": "https://www.goodreads.com/review/show/7510733325?utm_medium=api&utm_source=rss",
      "title": "Cryptography Apocalypse: Preparing for the Day When Quantum Computing Breaks Today's Crypto",
      "link": "https://www.goodreads.com/review/show/7510733325?utm_medium=api&utm_source=rss",
      "bookId": "44674615",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1569295456l/44674615._SX50_.jpg",
      "bookDescription": "Will your organization be protected the day a quantum computer breaks encryption on the internet? Computer encryption is vital for protecting users, data, and infrastructure in the digital age. Using traditional computing, even common desktop encryption could take decades for specialized ‘crackers’ to break and government and infrastructure-grade encryption would take billions of times longer. In light of these facts, it may seem that today’s computer cryptography is a rock-solid way to safeguard everything from online passwords to the backbone of the entire internet. Unfortunately, many current cryptographic methods will soon be obsolete. In 2016, the National Institute of Standards and Technology (NIST) predicted that quantum computers will soon be able to break the most popular forms of public key cryptography. The encryption technologies we rely on every day―HTTPS, TLS, WiFi protection, VPNs, cryptocurrencies, PKI, digital certificates, smartcards, and most two-factor authentication―will be virtually useless. . . unless you prepare.  Cryptography Apocalypse is a crucial resource for every IT and InfoSec professional for preparing for the coming quantum-computing revolution. Post-quantum crypto algorithms are already a reality, but implementation will take significant time and computing power. This practical guide helps IT leaders and implementers make the appropriate decisions today to meet the challenges of tomorrow. This important Cryptography Preparing for the Day When Quantum Computing Breaks Today's Crypto is a must-have guide for anyone in the InfoSec world who needs to know if their security is ready for the day crypto break and how to fix it.",
      "authorName": "Roger A. Grimes",
      "isbn": "1119618193",
      "userName": "Daniel",
      "userRating": "4",
      "userReadAt": "2025-05-05T00:00:00.000Z",
      "userDateAdded": "2025-05-06T01:18:29.000Z",
      "userDateCreated": "2025-04-23T00:06:26.000Z",
      "userShelves": "",
      "userReview": "",
      "averageRating": "4.2",
      "bookPublished": "",
      "description": "<a href=\"https://www.goodreads.com/book/show/44674615-cryptography-apocalypse?utm_medium=api&amp;utm_source=rss\"><img alt=\"Cryptography Apocalypse: Preparing for the Day When Quantum Computing Breaks Today&#39;s Crypto\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1569295456l/44674615._SX50_.jpg\" /></a><br/>\n                                      author: Roger A. Grimes<br/>\n                                      name: Daniel<br/>\n                                      average rating: 4.2<br/>\n                                      book published: <br/>\n                                      rating: 4<br/>\n                                      read at: 2025/05/05<br/>\n                                      date added: 2025/05/05<br/>\n                                      shelves: <br/>\n                                      review: <br/><br/>",
      "numPages": "272"
    },
    {
      "id": "https://www.goodreads.com/review/show/7532921082?utm_medium=api&utm_source=rss",
      "title": "Picks and Shovels (Martin Hench, #3)",
      "link": "https://www.goodreads.com/review/show/7532921082?utm_medium=api&utm_source=rss",
      "bookId": "211004856",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1733859351l/211004856._SY75_.jpg",
      "bookDescription": "<b><i>New York Times </i>bestselling author Cory Doctorow returns to the world of <i>Red Team Blues</i> to bring us the origin story of Martin Hench and the most powerful new tool for crime ever the personal computer.</b><br /><br />The year is 1986. The city is San Francisco. Here, Martin Hench will invent the forensic accountant--what a bounty hunter is to people, he is to money--but for now he's an MIT dropout odd-jobbing his way around a city still reeling from the invention of a revolutionary new technology that will change everything about crime forever, one we now take completely for granted.<br /><br />When Marty finds himself hired by Silicon Valley PC startup the Three Wise Men to investigate a group of disgruntled ex-employees who've founded a competitor startup, he quickly realizes he's on the wrong side. Marty ditches the greasy old guys running Three Wise Men without a second thought, utterly infatuated with the electric atmosphere of Magenta Women's Enterprise. Located in the heart of the Mission, this group of brilliant young women found themselves exhausted by the predatory business practices of Three Wise Men and set out to beat them at their own game, making better computers and driving Three Wise Men out of business. But this optimistic startup, fueled by young love and California-style burritos, has no idea the depth of the evil they're seeking to unroot or the risks they run. <br /><br />In this company-eat-company city, Martin and his friends will be lucky to escape with their lives.<br /><br />At the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.",
      "authorName": "Cory Doctorow",
      "isbn": "1250865905",
      "userName": "Daniel",
      "userRating": "4",
      "userReadAt": "2025-05-04T00:00:00.000Z",
      "userDateAdded": "2025-05-05T01:18:05.000Z",
      "userDateCreated": "2025-05-01T05:08:44.000Z",
      "userShelves": "",
      "userReview": "",
      "averageRating": "4.1",
      "bookPublished": "2025",
      "description": "<a href=\"https://www.goodreads.com/book/show/211004856-picks-and-shovels?utm_medium=api&amp;utm_source=rss\"><img alt=\"Picks and Shovels (Martin Hench, #3)\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1733859351l/211004856._SY75_.jpg\" /></a><br/>\n                                      author: Cory Doctorow<br/>\n                                      name: Daniel<br/>\n                                      average rating: 4.1<br/>\n                                      book published: 2025<br/>\n                                      rating: 4<br/>\n                                      read at: 2025/05/04<br/>\n                                      date added: 2025/05/04<br/>\n                                      shelves: <br/>\n                                      review: <br/><br/>",
      "numPages": "400"
    },
    {
      "id": "https://www.goodreads.com/review/show/4632082873?utm_medium=api&utm_source=rss",
      "title": "The Goblin Emperor (The Chronicles of Osreth, #1)",
      "link": "https://www.goodreads.com/review/show/4632082873?utm_medium=api&utm_source=rss",
      "bookId": "17910048",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1373039517l/17910048._SX50_.jpg",
      "bookDescription": "<b>\n  <i>A lush tale of deadly court intrigue and a modern classic of fantasy by Locus award winner and Hugo, Nebula, and World Fantasy Award finalist Katherine Addison</i>\n</b><br /><br />The youngest, half-goblin son of the Emperor has lived his entire life in exile, distant from the Imperial Court and the deadly intrigue that suffuses it. But when his father and three half brothers in line for the throne are killed in an \"accident,\" he has no choice but to take his place as the only surviving rightful heir.<br /><br />Entirely unschooled in the art of court politics, he has no friends, no advisors, and the sure knowledge that whoever assassinated his father and brothers could make an attempt on his life at any moment.<br /><br />Surrounded by sycophants eager to curry favor with the naïve new emperor, and overwhelmed by the burdens of his new life, he can trust nobody. Amid the swirl of plots to depose him, offers of arranged marriages, and the specter of the unknown conspirators who lurk in the shadows, he must quickly adjust to life as the Goblin Emperor. All the while, he is alone, and trying to find even a single friend . . . and hoping for the possibility of romance, yet also vigilant against the unseen enemies that threaten him, lest he lose his throne–or his life.",
      "authorName": "Katherine Addison",
      "isbn": "076532699X",
      "userName": "Daniel",
      "userRating": "5",
      "userReadAt": "2025-04-29T00:00:00.000Z",
      "userDateAdded": "2025-04-30T05:18:28.000Z",
      "userDateCreated": "2022-03-27T04:49:23.000Z",
      "userShelves": "",
      "userReview": "",
      "averageRating": "4.0",
      "bookPublished": "2014",
      "description": "<a href=\"https://www.goodreads.com/book/show/17910048-the-goblin-emperor?utm_medium=api&amp;utm_source=rss\"><img alt=\"The Goblin Emperor (The Chronicles of Osreth, #1)\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1373039517l/17910048._SX50_.jpg\" /></a><br/>\n                                      author: Katherine Addison<br/>\n                                      name: Daniel<br/>\n                                      average rating: 4.0<br/>\n                                      book published: 2014<br/>\n                                      rating: 5<br/>\n                                      read at: 2025/04/29<br/>\n                                      date added: 2025/04/29<br/>\n                                      shelves: <br/>\n                                      review: <br/><br/>",
      "numPages": "446"
    },
    {
      "id": "https://www.goodreads.com/review/show/7525089968?utm_medium=api&utm_source=rss",
      "title": "The Tale of Gengi (2 VOLUME BOXED SET)",
      "link": "https://www.goodreads.com/review/show/7525089968?utm_medium=api&utm_source=rss",
      "bookId": "170128323",
      "bookImageURL": "https://s.gr-assets.com/assets/nophoto/book/50x75-a91bf249278a81aabab721ef782c4a74.png",
      "bookDescription": "Written centuries before the time of Shakespeare and even Chaucer, <i>The Tale of Genji</i> marks the birth of the novel - and after more than a millenium, this seminal work continues to enchant readers throughout the world. Lady Murasaki Shikibu and her tale's hero, Prince Genji, have had an unmatched influence on Japanese culture. Prince Genji manifests what was to become an image of the ideal Heian-era courtier; gentle and passionate, Genji is also a master poet, dancer, musician and painter. <i>The Tale of Genji</i> follows Prince Genji through his many loves, and varied passions. This book has influenced not only generations of courtiers and samurai of the distant past, but artists and painters even in modern times - episodes in the tale have been incorporated into the design of kimonos and handicrafts, and the four-line poems called <i>waka</i> which dance throughout this work have earned it a place as a classic text in the study of poetry.<br /><br />Lady Murasaki Shikibu, born in the year 978, was a member of the famed Fujiwara clan - one of the most influential families of the Heian period. Her literary ability quickly won her place in the entourage of the Empress Akiko, whose court valued the rare woman who was a master of writing. After the death of her husband, Murasaki Shikibu immersed herself in Buddhism, and the religion's influences permeate her writing.",
      "authorName": "Murasaki Shikibu",
      "isbn": "",
      "userName": "Daniel",
      "userRating": "0",
      "userReadAt": "",
      "userDateAdded": "2025-04-28T08:01:04.000Z",
      "userDateCreated": "2025-04-28T07:54:09.000Z",
      "userShelves": "on-deck",
      "userReview": "",
      "averageRating": "3.5",
      "bookPublished": "1000",
      "description": "<a href=\"https://www.goodreads.com/book/show/170128323-the-tale-of-gengi?utm_medium=api&amp;utm_source=rss\"><img alt=\"The Tale of Gengi (2 VOLUME BOXED SET)\" src=\"https://s.gr-assets.com/assets/nophoto/book/50x75-a91bf249278a81aabab721ef782c4a74.png\" /></a><br/>\n                                      author: Murasaki Shikibu<br/>\n                                      name: Daniel<br/>\n                                      average rating: 3.5<br/>\n                                      book published: 1000<br/>\n                                      rating: 0<br/>\n                                      read at: <br/>\n                                      date added: 2025/04/28<br/>\n                                      shelves: on-deck<br/>\n                                      review: <br/><br/>",
      "numPages": "1090"
    },
    {
      "id": "https://www.goodreads.com/review/show/7500354161?utm_medium=api&utm_source=rss",
      "title": "Interesting Times (Discworld, #17; Rincewind, #5)",
      "link": "https://www.goodreads.com/review/show/7500354161?utm_medium=api&utm_source=rss",
      "bookId": "884288",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1430881376l/884288._SY75_.jpg",
      "bookDescription": "Mighty battles! Revolution! Death! War! (and his sons Terror and Panic, and daughter Clancy)<br /><br />The oldest and most inscrutable empire on the Discworld is in turmoil, brought about by the revolutionary treatise \"What I did on My Holidays.\" Workers are uniting, with nothing to lose but their water buffaloes. War (and Clancy) are spreading throughout the ancient cities.<br /><br />And all that stands in the way of terrible doom for everyone is:<br /><br />Rincewind the Wizard, who can't even spell the word \"wizard\"...<br /><br />Cohen the barbarian hero, five foot tall in his surgical sandals, who has had a lifetime's experience of not dying...<br /><br />...and a very special butterfly.",
      "authorName": "Terry Pratchett",
      "isbn": "0061056901",
      "userName": "Daniel",
      "userRating": "4",
      "userReadAt": "2025-04-23T00:00:00.000Z",
      "userDateAdded": "2025-04-24T05:05:43.000Z",
      "userDateCreated": "2025-04-19T06:42:47.000Z",
      "userShelves": "",
      "userReview": "",
      "averageRating": "4.1",
      "bookPublished": "1994",
      "description": "<a href=\"https://www.goodreads.com/book/show/884288.Interesting_Times?utm_medium=api&amp;utm_source=rss\"><img alt=\"Interesting Times (Discworld, #17; Rincewind, #5)\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1430881376l/884288._SY75_.jpg\" /></a><br/>\n                                      author: Terry Pratchett<br/>\n                                      name: Daniel<br/>\n                                      average rating: 4.1<br/>\n                                      book published: 1994<br/>\n                                      rating: 4<br/>\n                                      read at: 2025/04/23<br/>\n                                      date added: 2025/04/23<br/>\n                                      shelves: <br/>\n                                      review: <br/><br/>",
      "numPages": "368"
    },
    {
      "id": "https://www.goodreads.com/review/show/4954121647?utm_medium=api&utm_source=rss",
      "title": "Troll Bridge (Discworld, #16.5)",
      "link": "https://www.goodreads.com/review/show/4954121647?utm_medium=api&utm_source=rss",
      "bookId": "12300570",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1312625900l/12300570._SX50_.jpg",
      "bookDescription": "Part of a short story tribute anthology to Tolkien, found in After the King: Stories In Honor of J.R.R. Tolkien, it was also reprinted in My Favorite Fantasy Story, in The Oxford Book of Fantasy Stories, in The Mammoth Book of Comic Fantasy and was finally released as free online fiction.",
      "authorName": "Terry Pratchett",
      "isbn": "",
      "userName": "Daniel",
      "userRating": "4",
      "userReadAt": "2025-04-19T00:00:00.000Z",
      "userDateAdded": "2025-04-19T07:42:15.000Z",
      "userDateCreated": "2022-08-30T10:38:57.000Z",
      "userShelves": "",
      "userReview": "",
      "averageRating": "4.1",
      "bookPublished": "1992",
      "description": "<a href=\"https://www.goodreads.com/book/show/12300570-troll-bridge?utm_medium=api&amp;utm_source=rss\"><img alt=\"Troll Bridge (Discworld, #16.5)\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1312625900l/12300570._SX50_.jpg\" /></a><br/>\n                                      author: Terry Pratchett<br/>\n                                      name: Daniel<br/>\n                                      average rating: 4.1<br/>\n                                      book published: 1992<br/>\n                                      rating: 4<br/>\n                                      read at: 2025/04/19<br/>\n                                      date added: 2025/04/19<br/>\n                                      shelves: <br/>\n                                      review: <br/><br/>",
      "numPages": "10"
    },
    {
      "id": "https://www.goodreads.com/review/show/7489917247?utm_medium=api&utm_source=rss",
      "title": "Soul Music (Discworld, #16; Death, #3)",
      "link": "https://www.goodreads.com/review/show/7489917247?utm_medium=api&utm_source=rss",
      "bookId": "34502",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1168566175l/34502._SY75_.jpg",
      "bookDescription": "Other children get given xylophones. Susan just had to ask her grandfather to take his vest off. Yes. There's a Death in the family.It's hard to grow up normally when Grandfather rides a white horse and wields a scythe – especially when you have to take over the family business, and everyone mistakes you for the Tooth Fairy.And especially when you have to face the new and addictive music that has entered Discworld.It's lawless. It changes people.It's called \"Music With Rocks In.\"It's got a beat and you can dance to it, but...It's ALIVE.And it won't fade away.",
      "authorName": "Terry Pratchett",
      "isbn": "057506689X",
      "userName": "Daniel",
      "userRating": "4",
      "userReadAt": "2025-04-18T00:00:00.000Z",
      "userDateAdded": "2025-04-19T06:46:54.000Z",
      "userDateCreated": "2025-04-15T07:38:05.000Z",
      "userShelves": "",
      "userReview": "",
      "averageRating": "4.0",
      "bookPublished": "1994",
      "description": "<a href=\"https://www.goodreads.com/book/show/34502.Soul_Music?utm_medium=api&amp;utm_source=rss\"><img alt=\"Soul Music (Discworld, #16; Death, #3)\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1168566175l/34502._SY75_.jpg\" /></a><br/>\n                                      author: Terry Pratchett<br/>\n                                      name: Daniel<br/>\n                                      average rating: 4.0<br/>\n                                      book published: 1994<br/>\n                                      rating: 4<br/>\n                                      read at: 2025/04/18<br/>\n                                      date added: 2025/04/18<br/>\n                                      shelves: <br/>\n                                      review: <br/><br/>",
      "numPages": "288"
    },
    {
      "id": "https://www.goodreads.com/review/show/7474668124?utm_medium=api&utm_source=rss",
      "title": "Lords and Ladies (Discworld, #14; Witches, #4)",
      "link": "https://www.goodreads.com/review/show/7474668124?utm_medium=api&utm_source=rss",
      "bookId": "34529",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1469186110l/34529._SY75_.jpg",
      "bookDescription": "The fairies are back - but this time they don't just want your teeth... <br /><br />Granny Weatherwax and her tiny coven are up against real elves.<br /><br />It's Midsummer Night.<br /><br />No time for dreaming...<br /><br />With full supporting cast of dwarfs, wizards, trolls, Morris dancers and one orang-utan. And lots of hey-nonny-nonny and blood all over the place.",
      "authorName": "Terry Pratchett",
      "isbn": "055215315X",
      "userName": "Daniel",
      "userRating": "5",
      "userReadAt": "2025-04-13T00:00:00.000Z",
      "userDateAdded": "2025-04-14T06:58:02.000Z",
      "userDateCreated": "2025-04-09T08:09:50.000Z",
      "userShelves": "",
      "userReview": "",
      "averageRating": "4.2",
      "bookPublished": "1992",
      "description": "<a href=\"https://www.goodreads.com/book/show/34529.Lords_and_Ladies?utm_medium=api&amp;utm_source=rss\"><img alt=\"Lords and Ladies (Discworld, #14; Witches, #4)\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1469186110l/34529._SY75_.jpg\" /></a><br/>\n                                      author: Terry Pratchett<br/>\n                                      name: Daniel<br/>\n                                      average rating: 4.2<br/>\n                                      book published: 1992<br/>\n                                      rating: 5<br/>\n                                      read at: 2025/04/13<br/>\n                                      date added: 2025/04/13<br/>\n                                      shelves: <br/>\n                                      review: <br/><br/>",
      "numPages": "352"
    },
    {
      "id": "https://www.goodreads.com/review/show/7338111946?utm_medium=api&utm_source=rss",
      "title": "Ever Since Darwin: Reflections in Natural History",
      "link": "https://www.goodreads.com/review/show/7338111946?utm_medium=api&utm_source=rss",
      "bookId": "54209",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1431172846l/54209._SY75_.jpg",
      "bookDescription": "More than any other modern scientists, Stephen Jay Gould has opened up to millions the wonders of evolutionary biology. His genius as an essayist lies in his unmatched ability to use his knowledge of the world, including popular culture, to illuminate the realm of science.<br /><br />Ever Since Darwin, Stephen Jay Gould's first book, has sold more than a quarter of a million copies. Like all succeeding collections by this unique writer, it brings the art of the scientific essay to unparalleled heights.",
      "authorName": "Stephen Jay Gould",
      "isbn": "0393308189",
      "userName": "Daniel",
      "userRating": "4",
      "userReadAt": "2025-04-13T00:00:00.000Z",
      "userDateAdded": "2025-04-14T05:15:14.000Z",
      "userDateCreated": "2025-02-20T04:59:51.000Z",
      "userShelves": "",
      "userReview": "",
      "averageRating": "4.2",
      "bookPublished": "1977",
      "description": "<a href=\"https://www.goodreads.com/book/show/54209.Ever_Since_Darwin?utm_medium=api&amp;utm_source=rss\"><img alt=\"Ever Since Darwin: Reflections in Natural History\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1431172846l/54209._SY75_.jpg\" /></a><br/>\n                                      author: Stephen Jay Gould<br/>\n                                      name: Daniel<br/>\n                                      average rating: 4.2<br/>\n                                      book published: 1977<br/>\n                                      rating: 4<br/>\n                                      read at: 2025/04/13<br/>\n                                      date added: 2025/04/13<br/>\n                                      shelves: <br/>\n                                      review: <br/><br/>",
      "numPages": "285"
    },
    {
      "id": "https://www.goodreads.com/review/show/231375272?utm_medium=api&utm_source=rss",
      "title": "The Ancestor's Tale: A Pilgrimage to the Dawn of Evolution",
      "link": "https://www.goodreads.com/review/show/231375272?utm_medium=api&utm_source=rss",
      "bookId": "17977",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1423600058l/17977._SY75_.jpg",
      "bookDescription": "Come nei Racconti di Canterbury un eterogeneo gruppo di pellegrini diretti a un santuario narra, su invito dell’oste di una locanda, alcune storie, ognuna delle quali è espressione di un codice culturale e di un itinerario spirituale, così nel Racconto dell’Antenato altri “pellegrini” – non solo esseri umani ma anche animali, funghi, piante, batteri – compiono oggi, su invito di Richard Dawkins, un viaggio ugualmente rivelatore nel nostro passato.<br />In ciascuno dei trentanove “rendez-vous” del percorso a ritroso che ci conduce fino a quattro miliardi di anni fa, i viandanti incontrano nuovi gruppi con cui hanno un antenato in comune, e la folla diventa sempre più imponente a mano a mano che ci si avvicina alla meta. Alla fine il pellegrinaggio giunge alla sua Canterbury, ossia all’evento cruciale della vita sulla terra: l’unione di un organismo unicellulare – il futuro protozoo – con un batterio per formare la cellula nucleata. Da quel momento, tutti gli esseri viventi percorrono insieme l’ultimo tratto verso la comune origine biologica.<br />La cronaca del viaggio, però, è solo il contenitore dei singoli racconti. Se i pellegrini di Geoffrey Chaucer narravano le vicende del loro ambiente sociale, i protagonisti di questa straordinaria avventura illustrano i processi biologici legati allo sviluppo della vita sulla terra. Uniche per ricchezza e varietà, tali storie non solo tracciano l’autoritratto filogenetico del narratore, ma descrivono anche le più recenti acquisizioni della biologia molecolare, che hanno consentito di gettare nuova luce sul processo evolutivo e di riformulare stimolanti interrogativi. In che modo i nostri progenitori si sono propagati dall’Africa negli altri continenti? La stazione eretta venne adottata per liberare le mani e trasportare il cibo? A indurre l’aumento delle dimensioni del cervello fu forse l’acquisita abilità manuale? Quanto differiscono geneticamente le razze umane? E poi, esiste davvero la “razza”? A queste e molte altre domande Dawkins risponde con sapienza scientifica e finezza letteraria, invitandoci a riflettere sull’intima relazione esistente fra tutti gli esseri viventi e sullo stretto legame fra le varie e mirabili espressioni della realtà biologica, unificate da un solo “eroe”, quel “tema musicale ricorrente, quasi un leitmotiv wagneriano” che ha nome dna.",
      "authorName": "Richard Dawkins",
      "isbn": "061861916X",
      "userName": "Daniel",
      "userRating": "5",
      "userReadAt": "2025-04-08T00:00:00.000Z",
      "userDateAdded": "2025-04-09T05:24:51.000Z",
      "userDateCreated": "2011-11-05T07:19:47.000Z",
      "userShelves": "",
      "userReview": "",
      "averageRating": "4.1",
      "bookPublished": "2004",
      "description": "<a href=\"https://www.goodreads.com/book/show/17977.The_Ancestor_s_Tale?utm_medium=api&amp;utm_source=rss\"><img alt=\"The Ancestor&#39;s Tale: A Pilgrimage to the Dawn of Evolution\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1423600058l/17977._SY75_.jpg\" /></a><br/>\n                                      author: Richard Dawkins<br/>\n                                      name: Daniel<br/>\n                                      average rating: 4.1<br/>\n                                      book published: 2004<br/>\n                                      rating: 5<br/>\n                                      read at: 2025/04/08<br/>\n                                      date added: 2025/04/08<br/>\n                                      shelves: <br/>\n                                      review: <br/><br/>",
      "numPages": "688"
    },
    {
      "id": "https://www.goodreads.com/review/show/7458163688?utm_medium=api&utm_source=rss",
      "title": "Small Gods (Discworld, #13)",
      "link": "https://www.goodreads.com/review/show/7458163688?utm_medium=api&utm_source=rss",
      "bookId": "34484",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1390899426l/34484._SY75_.jpg",
      "bookDescription": "In the beginning was the Word.<br /><br />And the Word was: \"Hey, you!\" <br /><br />For Brutha the novice is the Chosen One. He wants peace and justice and brotherly love. <br /><br />He also wants the Inquisition to stop torturing him now, please...",
      "authorName": "Terry Pratchett",
      "isbn": "0552152978",
      "userName": "Daniel",
      "userRating": "5",
      "userReadAt": "2025-04-04T00:00:00.000Z",
      "userDateAdded": "2025-04-05T06:50:57.000Z",
      "userDateCreated": "2025-04-03T02:51:41.000Z",
      "userShelves": "",
      "userReview": "",
      "averageRating": "4.3",
      "bookPublished": "1992",
      "description": "<a href=\"https://www.goodreads.com/book/show/34484.Small_Gods?utm_medium=api&amp;utm_source=rss\"><img alt=\"Small Gods (Discworld, #13)\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1390899426l/34484._SY75_.jpg\" /></a><br/>\n                                      author: Terry Pratchett<br/>\n                                      name: Daniel<br/>\n                                      average rating: 4.3<br/>\n                                      book published: 1992<br/>\n                                      rating: 5<br/>\n                                      read at: 2025/04/04<br/>\n                                      date added: 2025/04/04<br/>\n                                      shelves: <br/>\n                                      review: <br/><br/>",
      "numPages": "389"
    },
    {
      "id": "https://www.goodreads.com/review/show/7413350512?utm_medium=api&utm_source=rss",
      "title": "The Long Game: China's Grand Strategy to Displace American Order (Bridging the Gap)",
      "link": "https://www.goodreads.com/review/show/7413350512?utm_medium=api&utm_source=rss",
      "bookId": "52617647",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1603740666l/52617647._SY75_.jpg",
      "bookDescription": "For more than a century, no US adversary or coalition of adversaries - not Nazi Germany, Imperial Japan, or the Soviet Union - has ever reached sixty percent of US GDP. China is the sole exception, and it is fast emerging into a global superpower that could rival, if not eclipse, the United<br />States. What does China want, does it have a grand strategy to achieve it, and what should the United States do about it?<br /><br />In <em>The Long Game</em>, Rush Doshi draws from a rich base of Chinese primary sources, including decades worth of party documents, leaked materials, memoirs by party leaders, and a careful analysis of China's conduct to provide a history of China's grand strategy since the end of the Cold War. Taking<br />readers behind the Party's closed doors, he uncovers Beijing's long, methodical game to displace America from its hegemonic position in both the East Asia regional and global orders through three sequential strategies of displacement. Beginning in the 1980s, China focused for two decades on<br />hiding capabilities and biding time. After the 2008 Global Financial Crisis, it became more assertive regionally, following a policy of actively accomplishing something. Finally, in the aftermath populist elections of 2016, China shifted to an even more aggressive strategy for undermining US<br />hegemony, adopting the phrase great changes unseen in century. After charting how China's long game has evolved, Doshi offers a comprehensive yet asymmetric plan for an effective US response. Ironically, his proposed approach takes a page from Beijing's own strategic playbook to undermine China's<br />ambitions and strengthen American order without competing dollar-for-dollar, ship-for-ship, or loan-for-loan.<br />",
      "authorName": "Rush Doshi",
      "isbn": "0197527914",
      "userName": "Daniel",
      "userRating": "4",
      "userReadAt": "2025-04-02T00:00:00.000Z",
      "userDateAdded": "2025-04-03T04:20:25.000Z",
      "userDateCreated": "2025-03-18T10:52:28.000Z",
      "userShelves": "",
      "userReview": "",
      "averageRating": "4.0",
      "bookPublished": "2021",
      "description": "<a href=\"https://www.goodreads.com/book/show/52617647-the-long-game?utm_medium=api&amp;utm_source=rss\"><img alt=\"The Long Game: China&#39;s Grand Strategy to Displace American Order (Bridging the Gap)\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1603740666l/52617647._SY75_.jpg\" /></a><br/>\n                                      author: Rush Doshi<br/>\n                                      name: Daniel<br/>\n                                      average rating: 4.0<br/>\n                                      book published: 2021<br/>\n                                      rating: 4<br/>\n                                      read at: 2025/04/02<br/>\n                                      date added: 2025/04/02<br/>\n                                      shelves: <br/>\n                                      review: <br/><br/>",
      "numPages": "432"
    },
    {
      "id": "https://www.goodreads.com/review/show/7418194407?utm_medium=api&utm_source=rss",
      "title": "Revenge of the Tipping Point: Overstories, Superspreaders, and the Rise of Social Engineering",
      "link": "https://www.goodreads.com/review/show/7418194407?utm_medium=api&utm_source=rss",
      "bookId": "216857785",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1721984170l/216857785._SY75_.jpg",
      "bookDescription": "Twenty-five years after the publication of his groundbreaking first book, Malcolm Gladwell returns with a brand-new volume that reframes the lessons of The Tipping Point in a startling and revealing light.<br /><br />Why is Miami…Miami? What does the heartbreaking fate of the cheetah tell us about the way we raise our children? Why do Ivy League schools care so much about sports? What is the Magic Third, and what does it mean for racial harmony? In this provocative new work, Malcolm Gladwell returns for the first time in twenty-five years to the subject of social epidemics and tipping points, this time with the aim of explaining the dark side of contagious phenomena.<br /> <br />Through a series of riveting stories, Gladwell traces the rise of a new and troubling form of social engineering. He takes us to the streets of Los Angeles to meet the world’s most successful bank robbers, rediscovers a forgotten television show from the 1970s that changed the world, visits the site of a historic experiment on a tiny cul-de-sac in northern California, and offers an alternate history of two of the biggest epidemics of our day: COVID and the opioid crisis. Revenge of the Tipping Point is Gladwell’s most personal book yet. With his characteristic mix of storytelling and social science, he offers a guide to making sense of the contagions of modern world. It’s time we took tipping points seriously.",
      "authorName": "Malcolm Gladwell",
      "isbn": "0316575801",
      "userName": "Daniel",
      "userRating": "5",
      "userReadAt": "2025-04-02T00:00:00.000Z",
      "userDateAdded": "2025-04-02T07:15:50.000Z",
      "userDateCreated": "2025-03-20T01:37:01.000Z",
      "userShelves": "",
      "userReview": "",
      "averageRating": "4.0",
      "bookPublished": "2024",
      "description": "<a href=\"https://www.goodreads.com/book/show/216857785-revenge-of-the-tipping-point?utm_medium=api&amp;utm_source=rss\"><img alt=\"Revenge of the Tipping Point: Overstories, Superspreaders, and the Rise of Social Engineering\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1721984170l/216857785._SY75_.jpg\" /></a><br/>\n                                      author: Malcolm Gladwell<br/>\n                                      name: Daniel<br/>\n                                      average rating: 4.0<br/>\n                                      book published: 2024<br/>\n                                      rating: 5<br/>\n                                      read at: 2025/04/02<br/>\n                                      date added: 2025/04/02<br/>\n                                      shelves: <br/>\n                                      review: <br/><br/>",
      "numPages": "352"
    },
    {
      "id": "https://www.goodreads.com/review/show/7435963194?utm_medium=api&utm_source=rss",
      "title": "Good Omens: The Nice and Accurate Prophecies of Agnes Nutter, Witch",
      "link": "https://www.goodreads.com/review/show/7435963194?utm_medium=api&utm_source=rss",
      "bookId": "12067",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1615552073l/12067._SY75_.jpg",
      "bookDescription": "According to the Nice and Accurate Prophecies of Agnes Nutter - the world's only totally reliable guide to the future - the world will end on a Saturday. Next Saturday, in fact. Just after tea...<br /><br />People have been predicting the end of the world almost from its very beginning, so it’s only natural to be sceptical when a new date is set for Judgement Day. This time though, the armies of Good and Evil really do appear to be massing. The four Bikers of the Apocalypse are hitting the road. But both the angels and demons – well, one fast-living demon and a somewhat fussy angel – would quite like the Rapture not to happen.<br /><br />And someone seems to have misplaced the Antichrist…",
      "authorName": "Terry Pratchett",
      "isbn": "",
      "userName": "Daniel",
      "userRating": "5",
      "userReadAt": "2025-03-27T00:00:00.000Z",
      "userDateAdded": "2025-03-28T04:18:00.000Z",
      "userDateCreated": "2025-03-26T06:37:26.000Z",
      "userShelves": "",
      "userReview": "",
      "averageRating": "4.3",
      "bookPublished": "1990",
      "description": "<a href=\"https://www.goodreads.com/book/show/12067.Good_Omens?utm_medium=api&amp;utm_source=rss\"><img alt=\"Good Omens: The Nice and Accurate Prophecies of Agnes Nutter, Witch\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1615552073l/12067._SY75_.jpg\" /></a><br/>\n                                      author: Terry Pratchett<br/>\n                                      name: Daniel<br/>\n                                      average rating: 4.3<br/>\n                                      book published: 1990<br/>\n                                      rating: 5<br/>\n                                      read at: 2025/03/27<br/>\n                                      date added: 2025/03/27<br/>\n                                      shelves: <br/>\n                                      review: <br/><br/>",
      "numPages": "491"
    },
    {
      "id": "https://www.goodreads.com/review/show/7440039365?utm_medium=api&utm_source=rss",
      "title": "Writing to Learn: How to Write--And Think--Clearly about Any Subject at All",
      "link": "https://www.goodreads.com/review/show/7440039365?utm_medium=api&utm_source=rss",
      "bookId": "585474",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1437433633l/585474._SY75_.jpg",
      "bookDescription": "This is an essential book for everyone who wants to write clearly about any subject and use writing as a means of learning.",
      "authorName": "William Zinsser",
      "isbn": "0062720406",
      "userName": "Daniel",
      "userRating": "0",
      "userReadAt": "",
      "userDateAdded": "2025-03-27T18:07:32.000Z",
      "userDateCreated": "2025-03-27T18:07:32.000Z",
      "userShelves": "on-deck",
      "userReview": "",
      "averageRating": "3.8",
      "bookPublished": "1988",
      "description": "<a href=\"https://www.goodreads.com/book/show/585474.Writing_to_Learn?utm_medium=api&amp;utm_source=rss\"><img alt=\"Writing to Learn: How to Write--And Think--Clearly about Any Subject at All\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1437433633l/585474._SY75_.jpg\" /></a><br/>\n                                      author: William Zinsser<br/>\n                                      name: Daniel<br/>\n                                      average rating: 3.8<br/>\n                                      book published: 1988<br/>\n                                      rating: 0<br/>\n                                      read at: <br/>\n                                      date added: 2025/03/27<br/>\n                                      shelves: on-deck<br/>\n                                      review: <br/><br/>",
      "numPages": "272"
    },
    {
      "id": "https://www.goodreads.com/review/show/6984267787?utm_medium=api&utm_source=rss",
      "title": "The Wolf-Girl, the Greeks and the Gods: a Tale of the Persian Wars",
      "link": "https://www.goodreads.com/review/show/6984267787?utm_medium=api&utm_source=rss",
      "bookId": "122777271",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1676915364l/122777271._SX50_.jpg",
      "bookDescription": "<b>Myth meets history in a blockbuster retelling of the Persian Wars from multi-award-winning author of <i>Rubicon </i>and <i>Persian Fire</i> Tom Holland, lavishly illustrated by Jason Cockcroft.</b><br /><br /><i>“The Persians are coming…” </i>Hearing these words, Gorgo of Sparta is plunged into a dangerous world of vengeful gods and invincible heroes. For a mighty empire threatens Athens, Sparta and all who stand in its path... Calling on the ancient power to transform into a wolf and the blood of Zeus that runs through her veins, Gorgo must lead her nation in one of history's greatest wars. Multi-award-winning author Tom Holland and acclaimed illustrator Jason Cockcroft boldly weave myth and history in this dramatic tale of Greeks and Gods.<br /><br />Gripping and powerful, this extraordinary illustrated novel will be treasured by readers young and old. Ideal for fans of Percy Jackson, Neil Gaiman and Kevin Crossley-Holland, and the mythical retellings of Madeline Miller, Pat Barker and Stephen Fry, this is a book to be read again and again.<br /><b><br />\"BREATHTAKING adventure on every page, and just the kind of detail, colour and vitality that young readers adore.\" STEPHEN FRY</b><br /><br /><b>\"A spectacularly illustrated account of the Persian Wars ... A MUST-HAVE for any child who loves Greek myths.\" <i>THE SUNDAY TIMES</i></b><br /><br /><b>“A RIP-ROARING, ADRENALINE-FILLED recounting of the infamous Persian wars [...] a gripping and educational volume. […] Gorgeously illustrated.” </b><b>\n  <i>DAILY MAIL</i>\n</b><br /><br /><b>\"SPECTACULAR</b><b>... A tour de force for mythology and military history fans.” <i>GUARDIAN</i></b><br /><br /><b>\"A GLORIOUS WHITE-KNUCKLE RIDE</b><b> through classical history ...</b><b> a book that any child is likely to remember well into their later years.\" <i>DAILY TELEGRAPH</i></b><br /><br /><b>\"A GLORIOUS mixture – of history, fiction and thrilling legend, with pictures to swim the Hellespont for.\" SEBASTIAN FAULKS</b><br /><br /><b>\"A clear contender for one of those totemic books whose memory you carry into adulthood. A TRIUMPH</b>.” <b>\n  <i>THE TIMES, CHILDREN'S BOOK OF THE WEEK<br /></i>\n</b> <br /><b>\"AS BEAUTIFUL TO LOOK AT AS IT IS ENTRANCING TO READ. Jason Cockcroft's illustrations are jaw-dropping, and Tom Holland's prose took me back to my own childhood introductions to these extraordinary mythological worlds in Roger Lancelyn Green's <i>Tales of the Greek Heroes</i> and Leon Garfield's and Charles Keeping's <i>The God Beneath the Sea</i>.\" FRANK COTTRELL-BOYCE</b><br /><br /><b>\"A BEAUTIFUL, immersive work of narrative history to treasure forever.\" WATERSTONES</b><br /><br /><b>“This TRULY EPIC adventure includes elements of ancient Greek myth and legend, and it is full of magic, mystery, danger, excitement and wonder. Strirking illustrations by Jason Cockcroft bring its ancient landscapes and heroic characters to life.”</b> <b><i>THE WEEK JUNIOR</i>, BOOK OF THE WEEK</b><br /><br /><b>\"TERRIFIC ... </b><b> has the feel of a contemporary classic.\" TONY BRADMAN, <i>BOOKS FOR KEEPS</i></b><br /><br /><b>\"Tom Holland's masterly interweaving of myth, imagination and deep classical learning makes this an EXTRAOARDINARY</b>",
      "authorName": "Tom Holland",
      "isbn": "1529514827",
      "userName": "Daniel",
      "userRating": "4",
      "userReadAt": "2025-03-25T00:00:00.000Z",
      "userDateAdded": "2025-03-26T00:31:17.000Z",
      "userDateCreated": "2024-11-06T21:24:40.000Z",
      "userShelves": "",
      "userReview": "",
      "averageRating": "3.9",
      "bookPublished": "",
      "description": "<a href=\"https://www.goodreads.com/book/show/122777271-the-wolf-girl-the-greeks-and-the-gods?utm_medium=api&amp;utm_source=rss\"><img alt=\"The Wolf-Girl, the Greeks and the Gods: a Tale of the Persian Wars\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1676915364l/122777271._SX50_.jpg\" /></a><br/>\n                                      author: Tom Holland<br/>\n                                      name: Daniel<br/>\n                                      average rating: 3.9<br/>\n                                      book published: <br/>\n                                      rating: 4<br/>\n                                      read at: 2025/03/25<br/>\n                                      date added: 2025/03/25<br/>\n                                      shelves: <br/>\n                                      review: <br/><br/>",
      "numPages": "206"
    },
    {
      "id": "https://www.goodreads.com/review/show/7429841532?utm_medium=api&utm_source=rss",
      "title": "Speakable and Unspeakable in Quantum Mechanics",
      "link": "https://www.goodreads.com/review/show/7429841532?utm_medium=api&utm_source=rss",
      "bookId": "195163",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1387708718l/195163._SY75_.jpg",
      "bookDescription": "A newly edited collection of all published as well as unpublished papers on quantum mechanics by the leading interpreter of modern quantum theory.",
      "authorName": "John Stewart Bell",
      "isbn": "0521368693",
      "userName": "Daniel",
      "userRating": "0",
      "userReadAt": "",
      "userDateAdded": "2025-03-24T05:32:11.000Z",
      "userDateCreated": "2025-03-24T05:32:11.000Z",
      "userShelves": "on-deck",
      "userReview": "",
      "averageRating": "4.5",
      "bookPublished": "1987",
      "description": "<a href=\"https://www.goodreads.com/book/show/195163.Speakable_and_Unspeakable_in_Quantum_Mechanics?utm_medium=api&amp;utm_source=rss\"><img alt=\"Speakable and Unspeakable in Quantum Mechanics\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1387708718l/195163._SY75_.jpg\" /></a><br/>\n                                      author: John Stewart Bell<br/>\n                                      name: Daniel<br/>\n                                      average rating: 4.5<br/>\n                                      book published: 1987<br/>\n                                      rating: 0<br/>\n                                      read at: <br/>\n                                      date added: 2025/03/23<br/>\n                                      shelves: on-deck<br/>\n                                      review: <br/><br/>",
      "numPages": "224"
    },
    {
      "id": "https://www.goodreads.com/review/show/7401912191?utm_medium=api&utm_source=rss",
      "title": "The Singularity Is Nearer: When We Merge with AI",
      "link": "https://www.goodreads.com/review/show/7401912191?utm_medium=api&utm_source=rss",
      "bookId": "45024007",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1711721717l/45024007._SY75_.jpg",
      "bookDescription": "<b>The noted inventor and futurist’s successor to his landmark book <i> The Singularity Is Near </i> explores how technology will transform the human race in the decades to come</b><br /><br />Since it was first published in 2005, Ray Kurzweil’s <i>The Singularity Is Near </i> and its vision of an exponential future have spawned a worldwide movement. Kurzweil's predictions about technological advancements have largely come true, with concepts like AI, intelligent machines, and biotechnology now widely familiar to the public.<br /><br />In this entirely new book Ray Kurzweil brings a fresh perspective to advances toward the Singularity—assessing his 1999 prediction that AI will reach human level intelligence by 2029 and examining the exponential growth of technology—that, in the near future, will expand human intelligence a millionfold and change human life forever. Among the topics he discusses are rebuilding the world, atom by atom with devices like nanobots; radical life extension beyond the current age limit of 120; reinventing intelligence by connecting our brains to the cloud; how exponential technologies are propelling innovation forward in all industries and improving all aspects of our well-being such as declining poverty and violence; and the growth of renewable energy and 3-D printing. He also considers the potential perils of biotechnology, nanotechnology, and artificial intelligence, including such topics of current controversy as how AI will impact employment and the safety of autonomous cars, and \"After Life\" technology, which aims to virtually revive deceased individuals through a combination of their data and DNA.<br /><br />The culmination of six decades of research on artificial intelligence, <i> The Singularity Is Nearer </i> is Ray Kurzweil’s crowning contribution to the story of this science and the revolution that is to come.",
      "authorName": "Ray Kurzweil",
      "isbn": "0399562761",
      "userName": "Daniel",
      "userRating": "5",
      "userReadAt": "2025-03-23T00:00:00.000Z",
      "userDateAdded": "2025-03-24T04:16:32.000Z",
      "userDateCreated": "2025-03-14T07:29:21.000Z",
      "userShelves": "",
      "userReview": "",
      "averageRating": "3.8",
      "bookPublished": "2024",
      "description": "<a href=\"https://www.goodreads.com/book/show/45024007-the-singularity-is-nearer?utm_medium=api&amp;utm_source=rss\"><img alt=\"The Singularity Is Nearer: When We Merge with AI\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1711721717l/45024007._SY75_.jpg\" /></a><br/>\n                                      author: Ray Kurzweil<br/>\n                                      name: Daniel<br/>\n                                      average rating: 3.8<br/>\n                                      book published: 2024<br/>\n                                      rating: 5<br/>\n                                      read at: 2025/03/23<br/>\n                                      date added: 2025/03/23<br/>\n                                      shelves: <br/>\n                                      review: <br/><br/>",
      "numPages": "432"
    },
    {
      "id": "https://www.goodreads.com/review/show/4913175832?utm_medium=api&utm_source=rss",
      "title": "The Color of Magic (Discworld, #1; Rincewind, #1)",
      "link": "https://www.goodreads.com/review/show/4913175832?utm_medium=api&utm_source=rss",
      "bookId": "34497",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1407111017l/34497._SY75_.jpg",
      "bookDescription": "In a world supported on the back of a giant turtle (sex unknown), a gleeful, explosive, wickedly eccentric expedition sets out. There's an avaricious but inept wizard, a naive tourist whose luggage moves on hundreds of dear little legs, dragons who only exist if you believe in them, and of course THE EDGE of the planet...",
      "authorName": "Terry Pratchett",
      "isbn": "0060855924",
      "userName": "Daniel",
      "userRating": "4",
      "userReadAt": "2025-03-22T00:00:00.000Z",
      "userDateAdded": "2025-03-23T04:46:38.000Z",
      "userDateCreated": "2022-08-12T07:09:19.000Z",
      "userShelves": "",
      "userReview": "",
      "averageRating": "4.0",
      "bookPublished": "1983",
      "description": "<a href=\"https://www.goodreads.com/book/show/34497.The_Color_of_Magic?utm_medium=api&amp;utm_source=rss\"><img alt=\"The Color of Magic (Discworld, #1; Rincewind, #1)\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1407111017l/34497._SY75_.jpg\" /></a><br/>\n                                      author: Terry Pratchett<br/>\n                                      name: Daniel<br/>\n                                      average rating: 4.0<br/>\n                                      book published: 1983<br/>\n                                      rating: 4<br/>\n                                      read at: 2025/03/22<br/>\n                                      date added: 2025/03/22<br/>\n                                      shelves: <br/>\n                                      review: <br/><br/>",
      "numPages": "228"
    },
    {
      "id": "https://www.goodreads.com/review/show/3900731726?utm_medium=api&utm_source=rss",
      "title": "The Nicomachean Ethics",
      "link": "https://www.goodreads.com/review/show/3900731726?utm_medium=api&utm_source=rss",
      "bookId": "19068",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1520339295l/19068._SY75_.jpg",
      "bookDescription": "<i>‘One swallow does not make a summer; neither does one day. Similarly neither can one day, or a brief space of time, make a man blessed and happy’</i><br /><br />In the <i>Nicomachean Ethics</i>, Aristotle sets out to examine the nature of happiness. He argues that happiness consists in ‘activity of the soul in accordance with virtue’, for example with moral virtues, such as courage, generosity and justice, and intellectual virtues, such as knowledge, wisdom and insight. <i>The Ethics</i> also discusses the nature of practical reasoning, the value and the objects of pleasure, the different forms of friendship, and the relationship between individual virtue, society and the State. Aristotle’s work has had a profound and lasting influence on all subsequent Western thought about ethical matters.<br /><br />J. A. K. Thomson’s translation has been revised by Hugh Tredennick, and is accompanied by a new introduction by Jonathan Barnes. This edition also includes an updated list for further reading and a new chronology of Aristotle’s life and works.<br /><br />Previously published as <i>Ethics</i>",
      "authorName": "Aristotle",
      "isbn": "0140449493",
      "userName": "Daniel",
      "userRating": "4",
      "userReadAt": "2025-03-20T00:00:00.000Z",
      "userDateAdded": "2025-03-21T02:18:39.000Z",
      "userDateCreated": "2021-03-21T03:49:53.000Z",
      "userShelves": "",
      "userReview": "",
      "averageRating": "4.0",
      "bookPublished": "-350",
      "description": "<a href=\"https://www.goodreads.com/book/show/19068.The_Nicomachean_Ethics?utm_medium=api&amp;utm_source=rss\"><img alt=\"The Nicomachean Ethics\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1520339295l/19068._SY75_.jpg\" /></a><br/>\n                                      author: Aristotle<br/>\n                                      name: Daniel<br/>\n                                      average rating: 4.0<br/>\n                                      book published: -350<br/>\n                                      rating: 4<br/>\n                                      read at: 2025/03/20<br/>\n                                      date added: 2025/03/20<br/>\n                                      shelves: <br/>\n                                      review: <br/><br/>",
      "numPages": "329"
    },
    {
      "id": "https://www.goodreads.com/review/show/7418876317?utm_medium=api&utm_source=rss",
      "title": "Liars and Outliers: Enabling the Trust that Society Needs to Thrive",
      "link": "https://www.goodreads.com/review/show/7418876317?utm_medium=api&utm_source=rss",
      "bookId": "12046245",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1347951586l/12046245._SX50_.jpg",
      "bookDescription": "We don't demand a background check on the plumber who shows up to fix the leaky sink. We don't do a chemical analysis on food we eat.<br /><br />Trust and cooperation are the first problems we had to solve before we could become a social species. In the 21st century, they have become the most important problems we need to solve — again. Our global society has become so large and complex that our traditional trust mechanisms no longer work.<br /><br />Bruce Schneier, world-renowned for his level-headed thinking on security and technology, tackles this complex subject head-on. Society can't function without trust, and yet must function even when people are untrustworthy.<br /><br /><i>Liars and Outliers</i> reaches across academic disciplines to develop an understanding of trust, cooperation, and social stability. From the subtle social cues we use to recognize trustworthy people to the laws that punish the noncompliant, from the way our brains reward our honesty to the bank vaults that keep out the dishonest, keeping people cooperative is a delicate balance of rewards and punishments. It's a series of evolutionary tricks, social pressures, legal mechanisms, and physical barriers.<br /><br />In the absence of personal relationships, we have no choice but to substitute security for trust, compliance for trustworthiness. This progression has enabled society to scale to unprecedented complexity, but has also permitted massive global failures.<br /><br />At the same time, too much cooperation is bad. Without some level of rule-breaking, innovation and social progress become impossible. Society stagnates.<br /><br />Today's problems require new thinking, and <i>Liars and Outliers</i> provides that. It is essential that we learn to think clearly about trust. Our future depends on it.",
      "authorName": "Bruce Schneier",
      "isbn": "1118143302",
      "userName": "Daniel",
      "userRating": "0",
      "userReadAt": "",
      "userDateAdded": "2025-03-20T08:44:52.000Z",
      "userDateCreated": "2025-03-20T08:44:51.000Z",
      "userShelves": "on-deck",
      "userReview": "",
      "averageRating": "3.8",
      "bookPublished": "2012",
      "description": "<a href=\"https://www.goodreads.com/book/show/12046245-liars-and-outliers?utm_medium=api&amp;utm_source=rss\"><img alt=\"Liars and Outliers: Enabling the Trust that Society Needs to Thrive\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1347951586l/12046245._SX50_.jpg\" /></a><br/>\n                                      author: Bruce Schneier<br/>\n                                      name: Daniel<br/>\n                                      average rating: 3.8<br/>\n                                      book published: 2012<br/>\n                                      rating: 0<br/>\n                                      read at: <br/>\n                                      date added: 2025/03/20<br/>\n                                      shelves: on-deck<br/>\n                                      review: <br/><br/>",
      "numPages": "348"
    },
    {
      "id": "https://www.goodreads.com/review/show/6289608334?utm_medium=api&utm_source=rss",
      "title": "The Bezzle (Martin Hench, #2)",
      "link": "https://www.goodreads.com/review/show/6289608334?utm_medium=api&utm_source=rss",
      "bookId": "127306588",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1690390791l/127306588._SY75_.jpg",
      "bookDescription": "New York Times bestseller Cory Doctorow's The Bezzle is a high stakes thriller where the lives of the hundreds of thousands of inmates in California’s prisons are traded like stock shares.<br /><br />The year is 2006. Martin Hench is at the top of his game as a self-employed forensic accountant, a veteran of the long guerrilla war between people who want to hide money, and people who want to find it. He spends his downtime on Catalina Island, where scenic, imported bison wander the bluffs and frozen, reheated fast food burgers cost 25$. Wait, what? When Marty disrupts a seemingly innocuous scheme during a vacation on Catalina Island, he has no idea he’s kicked off a chain of events that will overtake the next decade of his life.<br /><br />Martin has made his most dangerous mistake trespassed into the playgrounds of the ultra-wealthy and spoiled their fun. To them, money is a tool, a game, and a way to keep score, and they’ve found their newest mark―California’s Department of Corrections. Secure in the knowledge that they’re living behind far too many firewalls of shell companies and investors ever to be identified, they are interested not in the lives they ruin, but only in how much money they can extract from the government and the hundreds of thousands of prisoners they have at their mercy.<br /><br />A seething rebuke of the privatized prison system that delves deeply into the arcane and baroque financial chicanery involved in the 2008 financial crash, The Bezzle is a sizzling follow-up to Red Team Blues .",
      "authorName": "Cory Doctorow",
      "isbn": "1250865875",
      "userName": "Daniel",
      "userRating": "4",
      "userReadAt": "2025-03-19T00:00:00.000Z",
      "userDateAdded": "2025-03-20T06:14:53.000Z",
      "userDateCreated": "2024-02-24T08:19:51.000Z",
      "userShelves": "",
      "userReview": "",
      "averageRating": "4.0",
      "bookPublished": "2024",
      "description": "<a href=\"https://www.goodreads.com/book/show/127306588-the-bezzle?utm_medium=api&amp;utm_source=rss\"><img alt=\"The Bezzle (Martin Hench, #2)\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1690390791l/127306588._SY75_.jpg\" /></a><br/>\n                                      author: Cory Doctorow<br/>\n                                      name: Daniel<br/>\n                                      average rating: 4.0<br/>\n                                      book published: 2024<br/>\n                                      rating: 4<br/>\n                                      read at: 2025/03/19<br/>\n                                      date added: 2025/03/19<br/>\n                                      shelves: <br/>\n                                      review: <br/><br/>",
      "numPages": "230"
    },
    {
      "id": "https://www.goodreads.com/review/show/7401796899?utm_medium=api&utm_source=rss",
      "title": "Witches Abroad (Discworld, #12; Witches, #3)",
      "link": "https://www.goodreads.com/review/show/7401796899?utm_medium=api&utm_source=rss",
      "bookId": "2442",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1403326937l/2442._SY75_.jpg",
      "bookDescription": "Be careful what you wish for...<br /><br />Once upon a time there was a fairy godmother named Desiderata who had a good heart, a wise head, and poor planning skills—which unfortunately left the Princess Emberella in the care of her <em>other</em> (not quite so good and wise) godmother when DEATH came for Desiderata. So now it's up to Magrat Garlick, Granny Weatherwax, and Nanny Ogg to hop on broomsticks and make for far-distant Genua to ensure the servant girl <em>doesn't</em> marry the Prince.<br /><br />But the road to Genua is bumpy, and along the way the trio of witches encounters the occasional vampire, werewolf, and falling house (well this is a <em>fairy tale</em>, after all). The trouble really begins once these reluctant foster-godmothers arrive in Genua and must outwit their power-hungry counterpart who'll stop at nothing to achieve a proper \"happy ending\"—even if it means destroying a kingdom.",
      "authorName": "Terry Pratchett",
      "isbn": "0061020613",
      "userName": "Daniel",
      "userRating": "4",
      "userReadAt": "2025-03-16T00:00:00.000Z",
      "userDateAdded": "2025-03-17T05:50:07.000Z",
      "userDateCreated": "2025-03-14T05:33:46.000Z",
      "userShelves": "",
      "userReview": "",
      "averageRating": "4.2",
      "bookPublished": "1991",
      "description": "<a href=\"https://www.goodreads.com/book/show/2442.Witches_Abroad?utm_medium=api&amp;utm_source=rss\"><img alt=\"Witches Abroad (Discworld, #12; Witches, #3)\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1403326937l/2442._SY75_.jpg\" /></a><br/>\n                                      author: Terry Pratchett<br/>\n                                      name: Daniel<br/>\n                                      average rating: 4.2<br/>\n                                      book published: 1991<br/>\n                                      rating: 4<br/>\n                                      read at: 2025/03/16<br/>\n                                      date added: 2025/03/16<br/>\n                                      shelves: <br/>\n                                      review: <br/><br/>",
      "numPages": "374"
    },
    {
      "id": "https://www.goodreads.com/review/show/7405560490?utm_medium=api&utm_source=rss",
      "title": "The Utopia of Rules: On Technology, Stupidity, and the Secret Joys of Bureaucracy",
      "link": "https://www.goodreads.com/review/show/7405560490?utm_medium=api&utm_source=rss",
      "bookId": "22245334",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1417415465l/22245334._SY75_.jpg",
      "bookDescription": "Where does the desire for endless rules, regulations, and bureaucracy come from? How did we come to spend so much of our time filling out forms?<br /><br />To answer these questions, anthropologist David Graeber—one of the most prominent and provocative thinkers working today—takes a journey through ancient and modern history to trace the peculiar and fascinating evolution of bureaucracy over the ages.<br /><br />He starts in the ancient world, looking at how early civilizations were organized and what traces early bureaucratic systems have left in the ethnographic literature. He then jets forward to the nineteenth century, where systems we can easily recognize as modern bureaucracies come into being. In some areas of life—like with the modern postal systems of Germany and France—these bureaucracies have brought tremendous efficiencies to modern life. But Graeber argues that there is a much darker side to modern bureaucracy that is rarely ever discussed. Indeed, in our own “utopia of rules,” freedom and technological innovation are often the casualties of systems that we only faintly understand.<br /><br />Provocative and timely, the book is a powerful look and history of bureaucracy over the ages and its power in shaping the world of ideas.",
      "authorName": "David Graeber",
      "isbn": "1612193749",
      "userName": "Daniel",
      "userRating": "0",
      "userReadAt": "",
      "userDateAdded": "2025-03-15T18:37:16.000Z",
      "userDateCreated": "2025-03-15T18:37:16.000Z",
      "userShelves": "to-read",
      "userReview": "",
      "averageRating": "4.0",
      "bookPublished": "2013",
      "description": "<a href=\"https://www.goodreads.com/book/show/22245334-the-utopia-of-rules?utm_medium=api&amp;utm_source=rss\"><img alt=\"The Utopia of Rules: On Technology, Stupidity, and the Secret Joys of Bureaucracy\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1417415465l/22245334._SY75_.jpg\" /></a><br/>\n                                      author: David Graeber<br/>\n                                      name: Daniel<br/>\n                                      average rating: 4.0<br/>\n                                      book published: 2013<br/>\n                                      rating: 0<br/>\n                                      read at: <br/>\n                                      date added: 2025/03/15<br/>\n                                      shelves: to-read<br/>\n                                      review: <br/><br/>",
      "numPages": "261"
    },
    {
      "id": "https://www.goodreads.com/review/show/272384900?utm_medium=api&utm_source=rss",
      "title": "Anathem",
      "link": "https://www.goodreads.com/review/show/272384900?utm_medium=api&utm_source=rss",
      "bookId": "2845024",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1488349209l/2845024._SX50_.jpg",
      "bookDescription": "Fraa Erasmas is a young avout living in the Concent of Saunt Edhar, a sanctuary for mathematicians, scientists, and philosophers, protected from the corrupting influences of the outside \"saecular\" world by ancient stone, honored traditions, and complex rituals. Over the centuries, cities and governments have risen and fallen beyond the concent's walls. Three times during history's darkest epochs violence born of superstition and ignorance has invaded and devastated the cloistered mathic community. Yet the avout have always managed to adapt in the wake of catastrophe, becoming out of necessity even more austere and less dependent on technology and material things. And Erasmas has no fear of the outside—the Extramuros—for the last of the terrible times was long, long ago.<br /><br />Now, in celebration of the week-long, once-in-a-decade rite of Apert, the fraas and suurs prepare to venture beyond the concent's gates—at the same time opening them wide to welcome the curious \"extras\" in. During his first Apert as a fraa, Erasmas eagerly anticipates reconnecting with the landmarks and family he hasn't seen since he was \"collected.\" But before the week is out, both the existence he abandoned and the one he embraced will stand poised on the brink of cataclysmic change.<br /><br />Powerful unforeseen forces jeopardize the peaceful stability of mathic life and the established ennui of the Extramuros—a threat that only an unsteady alliance of saecular and avout can oppose—as, one by one, Erasmas and his colleagues, teachers, and friends are summoned forth from the safety of the concent in hopes of warding off global disaster. Suddenly burdened with a staggering responsibility, Erasmas finds himself a major player in a drama that will determine the future of his world—as he sets out on an extraordinary odyssey that will carry him to the most dangerous, inhospitable corners of the planet . . . and beyond.",
      "authorName": "Neal Stephenson",
      "isbn": "0061474096",
      "userName": "Daniel",
      "userRating": "5",
      "userReadAt": "2025-03-13T00:00:00.000Z",
      "userDateAdded": "2025-03-14T05:27:27.000Z",
      "userDateCreated": "2012-02-05T00:28:56.000Z",
      "userShelves": "",
      "userReview": "",
      "averageRating": "4.2",
      "bookPublished": "2008",
      "description": "<a href=\"https://www.goodreads.com/book/show/2845024-anathem?utm_medium=api&amp;utm_source=rss\"><img alt=\"Anathem\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1488349209l/2845024._SX50_.jpg\" /></a><br/>\n                                      author: Neal Stephenson<br/>\n                                      name: Daniel<br/>\n                                      average rating: 4.2<br/>\n                                      book published: 2008<br/>\n                                      rating: 5<br/>\n                                      read at: 2025/03/13<br/>\n                                      date added: 2025/03/13<br/>\n                                      shelves: <br/>\n                                      review: <br/><br/>",
      "numPages": "937"
    },
    {
      "id": "https://www.goodreads.com/review/show/7393744853?utm_medium=api&utm_source=rss",
      "title": "Two Dogmas of Empiricism",
      "link": "https://www.goodreads.com/review/show/7393744853?utm_medium=api&utm_source=rss",
      "bookId": "35958202",
      "bookImageURL": "https://s.gr-assets.com/assets/nophoto/book/50x75-a91bf249278a81aabab721ef782c4a74.png",
      "bookDescription": "Modern empiricism has been conditioned in large part by two dogmas. One is a belief in some fundamental cleavage between truths which are analytic, or grounded in meanings independently of matters of fact, and truth which are synthetic, or grounded in fact. The other dogma is reductionism: the belief that each meaningful statement is equivalent to some logical construct upon terms which refer to immediate experience. Both dogmas, I shall argue, are ill founded. One effect of abandoning them is, as we shall see, a blurring of the supposed boundary between speculative metaphysics and natural science. Another effect is a shift toward pragmatism.",
      "authorName": "Willard Van Orman Quine",
      "isbn": "",
      "userName": "Daniel",
      "userRating": "0",
      "userReadAt": "",
      "userDateAdded": "2025-03-11T05:25:58.000Z",
      "userDateCreated": "2025-03-11T05:25:57.000Z",
      "userShelves": "on-deck",
      "userReview": "",
      "averageRating": "4.0",
      "bookPublished": "",
      "description": "<a href=\"https://www.goodreads.com/book/show/35958202-two-dogmas-of-empiricism?utm_medium=api&amp;utm_source=rss\"><img alt=\"Two Dogmas of Empiricism\" src=\"https://s.gr-assets.com/assets/nophoto/book/50x75-a91bf249278a81aabab721ef782c4a74.png\" /></a><br/>\n                                      author: Willard Van Orman Quine<br/>\n                                      name: Daniel<br/>\n                                      average rating: 4.0<br/>\n                                      book published: <br/>\n                                      rating: 0<br/>\n                                      read at: <br/>\n                                      date added: 2025/03/10<br/>\n                                      shelves: on-deck<br/>\n                                      review: <br/><br/>",
      "numPages": "25"
    },
    {
      "id": "https://www.goodreads.com/review/show/7393744681?utm_medium=api&utm_source=rss",
      "title": "Ontological Relativity and Other Essays",
      "link": "https://www.goodreads.com/review/show/7393744681?utm_medium=api&utm_source=rss",
      "bookId": "174470",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1348022484l/174470._SY75_.jpg",
      "bookDescription": "This volume consists of the first of the John Dewey Lectures delivered under the auspices of Columbia University's Philosophy Department as well as other essays by the author. Intended to clarify the meaning of the philosophical doctrines propounded by Professor Quine in 'Word and Objects, ' the essays included herein both support and expand those doctrines.",
      "authorName": "Willard Van Orman Quine",
      "isbn": "0231083572",
      "userName": "Daniel",
      "userRating": "0",
      "userReadAt": "",
      "userDateAdded": "2025-03-11T05:25:50.000Z",
      "userDateCreated": "2025-03-11T05:25:50.000Z",
      "userShelves": "to-read",
      "userReview": "",
      "averageRating": "4.1",
      "bookPublished": "1969",
      "description": "<a href=\"https://www.goodreads.com/book/show/174470.Ontological_Relativity_and_Other_Essays?utm_medium=api&amp;utm_source=rss\"><img alt=\"Ontological Relativity and Other Essays\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1348022484l/174470._SY75_.jpg\" /></a><br/>\n                                      author: Willard Van Orman Quine<br/>\n                                      name: Daniel<br/>\n                                      average rating: 4.1<br/>\n                                      book published: 1969<br/>\n                                      rating: 0<br/>\n                                      read at: <br/>\n                                      date added: 2025/03/10<br/>\n                                      shelves: to-read<br/>\n                                      review: <br/><br/>",
      "numPages": "165"
    },
    {
      "id": "https://www.goodreads.com/review/show/7393744619?utm_medium=api&utm_source=rss",
      "title": "The Web of Belief",
      "link": "https://www.goodreads.com/review/show/7393744619?utm_medium=api&utm_source=rss",
      "bookId": "931301",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1414351201l/931301._SY75_.jpg",
      "bookDescription": "A compact, coherent introduction to the study of rational belief, this text provides points of entry to such areas of philosophy as theory of knowledge, methodology of science, and philosophy of language. The book is accessible to all undergraduates and presupposes no philosophical training.",
      "authorName": "Willard Van Orman Quine",
      "isbn": "0075536099",
      "userName": "Daniel",
      "userRating": "0",
      "userReadAt": "",
      "userDateAdded": "2025-03-11T05:25:47.000Z",
      "userDateCreated": "2025-03-11T05:25:47.000Z",
      "userShelves": "to-read",
      "userReview": "",
      "averageRating": "3.8",
      "bookPublished": "1978",
      "description": "<a href=\"https://www.goodreads.com/book/show/931301.The_Web_of_Belief?utm_medium=api&amp;utm_source=rss\"><img alt=\"The Web of Belief\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1414351201l/931301._SY75_.jpg\" /></a><br/>\n                                      author: Willard Van Orman Quine<br/>\n                                      name: Daniel<br/>\n                                      average rating: 3.8<br/>\n                                      book published: 1978<br/>\n                                      rating: 0<br/>\n                                      read at: <br/>\n                                      date added: 2025/03/10<br/>\n                                      shelves: to-read<br/>\n                                      review: <br/><br/>",
      "numPages": "156"
    },
    {
      "id": "https://www.goodreads.com/review/show/7393744570?utm_medium=api&utm_source=rss",
      "title": "Word and Object",
      "link": "https://www.goodreads.com/review/show/7393744570?utm_medium=api&utm_source=rss",
      "bookId": "174467",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1347221393l/174467._SY75_.jpg",
      "bookDescription": "Language consists of dispositions, socially instilled, to respond observably to socially observable stimuli. Such is the point of view from which a noted philosopher and logician examines the notion of meaning and the linguistic mechanisms of objective reference. In the course of the discussion, Professor Quine pinpoints the difficulties involved in translation, brings to light the anomalies and conflicts implicit in our language's referential apparatus, clarifies semantic problems connected with the imputation of existence, and marshals reasons for admitting or repudiating each of various categories of supposed objects. He argues that the notion of a language-transcendent \"sentence-meaning\" must on the whole be rejected; meaningful studies in the semantics of reference can only be directed toward substantially the same language in which they are conducted.",
      "authorName": "Willard Van Orman Quine",
      "isbn": "0262670011",
      "userName": "Daniel",
      "userRating": "0",
      "userReadAt": "",
      "userDateAdded": "2025-03-11T05:25:46.000Z",
      "userDateCreated": "2025-03-11T05:25:45.000Z",
      "userShelves": "to-read",
      "userReview": "",
      "averageRating": "4.0",
      "bookPublished": "1960",
      "description": "<a href=\"https://www.goodreads.com/book/show/174467.Word_and_Object?utm_medium=api&amp;utm_source=rss\"><img alt=\"Word and Object\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1347221393l/174467._SY75_.jpg\" /></a><br/>\n                                      author: Willard Van Orman Quine<br/>\n                                      name: Daniel<br/>\n                                      average rating: 4.0<br/>\n                                      book published: 1960<br/>\n                                      rating: 0<br/>\n                                      read at: <br/>\n                                      date added: 2025/03/10<br/>\n                                      shelves: to-read<br/>\n                                      review: <br/><br/>",
      "numPages": "309"
    },
    {
      "id": "https://www.goodreads.com/review/show/7373780895?utm_medium=api&utm_source=rss",
      "title": "Reaper Man (Discworld, #11; Death, #2)",
      "link": "https://www.goodreads.com/review/show/7373780895?utm_medium=api&utm_source=rss",
      "bookId": "34517",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1389211958l/34517._SY75_.jpg",
      "bookDescription": "Death is missing - presumed... er... gone.<br /><br />Which leads to the kind of chaos you always get when an important public service is withdrawn.<br /><br />Meanwhile, on a little farm far, far away, a tall dark stranger is turning out to be really good with a scythe. There's a harvest to be gathered in...",
      "authorName": "Terry Pratchett",
      "isbn": "0552152951",
      "userName": "Daniel",
      "userRating": "4",
      "userReadAt": "2025-03-04T00:00:00.000Z",
      "userDateAdded": "2025-03-05T04:56:18.000Z",
      "userDateCreated": "2025-03-04T05:05:12.000Z",
      "userShelves": "",
      "userReview": "",
      "averageRating": "4.3",
      "bookPublished": "1991",
      "description": "<a href=\"https://www.goodreads.com/book/show/34517.Reaper_Man?utm_medium=api&amp;utm_source=rss\"><img alt=\"Reaper Man (Discworld, #11; Death, #2)\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1389211958l/34517._SY75_.jpg\" /></a><br/>\n                                      author: Terry Pratchett<br/>\n                                      name: Daniel<br/>\n                                      average rating: 4.3<br/>\n                                      book published: 1991<br/>\n                                      rating: 4<br/>\n                                      read at: 2025/03/04<br/>\n                                      date added: 2025/03/04<br/>\n                                      shelves: <br/>\n                                      review: <br/><br/>",
      "numPages": "289"
    },
    {
      "id": "https://www.goodreads.com/review/show/7328662164?utm_medium=api&utm_source=rss",
      "title": "Dodger",
      "link": "https://www.goodreads.com/review/show/7328662164?utm_medium=api&utm_source=rss",
      "bookId": "13516846",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1343828971l/13516846._SY75_.jpg",
      "bookDescription": "<b>A storm.</b> Rain-lashed city streets. A flash of lightning. A scruffy lad sees a girl leap desperately from a horse-drawn carriage in a vain attempt to escape her captors. Can the lad stand by and let her be caught again? Of course not, because he's...Dodger.<br /><br />Seventeen-year-old Dodger may be a street urchin, but he gleans a living from London's sewers, and he knows a jewel when he sees one. He's not about to let anything happen to the unknown girl--not even if her fate impacts some of the most powerful people in England.<br /><br />From Dodger's encounter with the mad barber Sweeney Todd to his meetings with the great writer Charles Dickens and the calculating politician Benjamin Disraeli, history and fantasy intertwine in a breathtaking account of adventure and mystery.<br /><br />Beloved and bestselling author Sir Terry Pratchett combines high comedy with deep wisdom in this tale of an unexpected coming-of-age and one remarkable boy's rise in a complex and fascinating world.",
      "authorName": "Terry Pratchett",
      "isbn": "0062009494",
      "userName": "Daniel",
      "userRating": "4",
      "userReadAt": "2025-02-28T00:00:00.000Z",
      "userDateAdded": "2025-03-01T07:43:26.000Z",
      "userDateCreated": "2025-02-17T08:29:51.000Z",
      "userShelves": "",
      "userReview": "",
      "averageRating": "3.9",
      "bookPublished": "2012",
      "description": "<a href=\"https://www.goodreads.com/book/show/13516846-dodger?utm_medium=api&amp;utm_source=rss\"><img alt=\"Dodger\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1343828971l/13516846._SY75_.jpg\" /></a><br/>\n                                      author: Terry Pratchett<br/>\n                                      name: Daniel<br/>\n                                      average rating: 3.9<br/>\n                                      book published: 2012<br/>\n                                      rating: 4<br/>\n                                      read at: 2025/02/28<br/>\n                                      date added: 2025/02/28<br/>\n                                      shelves: <br/>\n                                      review: <br/><br/>",
      "numPages": "360"
    },
    {
      "id": "https://www.goodreads.com/review/show/7227938871?utm_medium=api&utm_source=rss",
      "title": "Wonderful Life: The Burgess Shale and the Nature of History",
      "link": "https://www.goodreads.com/review/show/7227938871?utm_medium=api&utm_source=rss",
      "bookId": "36475",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1480836482l/36475._SY75_.jpg",
      "bookDescription": "High in the Canadian Rockies is a small limestone quarry formed 530 million years ago called the Burgess Shale. It hold the remains of an ancient sea where dozens of strange creatures lived—a forgotten corner of evolution preserved in awesome detail. In this book Stephen Jay Gould explores what the Burgess Shale tells us about evolution and the nature of history.",
      "authorName": "Stephen Jay Gould",
      "isbn": "039330700X",
      "userName": "Daniel",
      "userRating": "4",
      "userReadAt": "2025-02-27T00:00:00.000Z",
      "userDateAdded": "2025-02-28T05:37:17.000Z",
      "userDateCreated": "2025-01-18T07:34:21.000Z",
      "userShelves": "",
      "userReview": "",
      "averageRating": "4.1",
      "bookPublished": "1989",
      "description": "<a href=\"https://www.goodreads.com/book/show/36475.Wonderful_Life?utm_medium=api&amp;utm_source=rss\"><img alt=\"Wonderful Life: The Burgess Shale and the Nature of History\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1480836482l/36475._SY75_.jpg\" /></a><br/>\n                                      author: Stephen Jay Gould<br/>\n                                      name: Daniel<br/>\n                                      average rating: 4.1<br/>\n                                      book published: 1989<br/>\n                                      rating: 4<br/>\n                                      read at: 2025/02/27<br/>\n                                      date added: 2025/02/27<br/>\n                                      shelves: <br/>\n                                      review: <br/><br/>",
      "numPages": "352"
    },
    {
      "id": "https://www.goodreads.com/review/show/7359078284?utm_medium=api&utm_source=rss",
      "title": "Bushido: The Soul of Japan",
      "link": "https://www.goodreads.com/review/show/7359078284?utm_medium=api&utm_source=rss",
      "bookId": "661723",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1348666091l/661723._SX50_.jpg",
      "bookDescription": "Bushido. The Way of the Warrior presents a remarkably faithful mirror of many of the characteristics and habits of modern Japanese civilization, as it represents a tradition that enjoyed great power and prestige for centuries. This work was written to provide practical and moral instruction for warriors, and to outline the parameters of personal, social, and professional conduct characteristic of Bushido, or Way of the Warrior, the Japanese chivalric tradition.<br /><br />Personal responsibilities, family relationships, public duties, education, finances and ethics are treated in this text from the perspective of the spirit of Japanese gentlemen. Even the forms of political incompetence and corruption that Japan currently struggles with are accurately described in this more than 400-year-old book; So deep did the feudal and military modes of government that generated them take their roots in Japanese society. This manual is therefore an essential resource for anyone who wishes to understand Japan and the Japanese people in a realistic way.",
      "authorName": "Inazō Nitobe",
      "isbn": "4770027311",
      "userName": "Daniel",
      "userRating": "0",
      "userReadAt": "",
      "userDateAdded": "2025-02-27T08:15:15.000Z",
      "userDateCreated": "2025-02-27T08:15:15.000Z",
      "userShelves": "to-read",
      "userReview": "",
      "averageRating": "3.9",
      "bookPublished": "1899",
      "description": "<a href=\"https://www.goodreads.com/book/show/661723.Bushido?utm_medium=api&amp;utm_source=rss\"><img alt=\"Bushido: The Soul of Japan\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1348666091l/661723._SX50_.jpg\" /></a><br/>\n                                      author: Inazō Nitobe<br/>\n                                      name: Daniel<br/>\n                                      average rating: 3.9<br/>\n                                      book published: 1899<br/>\n                                      rating: 0<br/>\n                                      read at: <br/>\n                                      date added: 2025/02/27<br/>\n                                      shelves: to-read<br/>\n                                      review: <br/><br/>",
      "numPages": "160"
    },
    {
      "id": "https://www.goodreads.com/review/show/7358864743?utm_medium=api&utm_source=rss",
      "title": "The Cambrian Explosion: The Construction of Animal Biodiversity",
      "link": "https://www.goodreads.com/review/show/7358864743?utm_medium=api&utm_source=rss",
      "bookId": "7596274",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1344673236l/7596274._SX50_.jpg",
      "bookDescription": "The Cambrian Period records one of the most extraordinary transitions in the history of life. Beginning as simple sponges more than 635 million years ago, the earliest animals evolved into a diverse marine fauna over the course of 100 million years. In The Cambrian Explosion, Erwin and Valentine synthesize research from many fields to explain why there was such remarkable novelty of animal forms. This is an integrative work of the highest quality, covering one of the most fascinating and transformative periods in life’s history.",
      "authorName": "Douglas H. Erwin",
      "isbn": "1936221039",
      "userName": "Daniel",
      "userRating": "0",
      "userReadAt": "",
      "userDateAdded": "2025-02-27T05:20:31.000Z",
      "userDateCreated": "2025-02-27T05:20:31.000Z",
      "userShelves": "to-read",
      "userReview": "",
      "averageRating": "4.3",
      "bookPublished": "2010",
      "description": "<a href=\"https://www.goodreads.com/book/show/7596274-the-cambrian-explosion?utm_medium=api&amp;utm_source=rss\"><img alt=\"The Cambrian Explosion: The Construction of Animal Biodiversity\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1344673236l/7596274._SX50_.jpg\" /></a><br/>\n                                      author: Douglas H. Erwin<br/>\n                                      name: Daniel<br/>\n                                      average rating: 4.3<br/>\n                                      book published: 2010<br/>\n                                      rating: 0<br/>\n                                      read at: <br/>\n                                      date added: 2025/02/26<br/>\n                                      shelves: to-read<br/>\n                                      review: <br/><br/>",
      "numPages": "416"
    },
    {
      "id": "https://www.goodreads.com/review/show/7358863120?utm_medium=api&utm_source=rss",
      "title": "The Crucible of Creation: The Burgess Shale and the Rise of Animals",
      "link": "https://www.goodreads.com/review/show/7358863120?utm_medium=api&utm_source=rss",
      "bookId": "295369",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1173477627l/295369._SX50_.jpg",
      "bookDescription": "In The Crucible of Creation , paleontologist Simon Conway Morris describes the marvelous finds of the Burgess Shale--a fantastically rich deposit of bizarre and bewildering Cambrian fossils, located in Western Canada.<br />Conway Morris is one of the few paleontologists ever to explore the Burgess Shale, having been involved in the dig since 1972, and thus he is an ideal guide to this amazing discovery. Indeed, he provides a complete overview of this remarkable find, ranging from an informative, basic discussion<br />of the origins of life and animals on earth, to a colorful description of Charles Walcott's discovery of the Burgess Shale and of the painstaking scientific work that went on there (as well as in Burgess collections held at Harvard and the Smithsonian), to an account of similar fossil finds in<br />Greenland and in China. The heart of the book is an imaginative trip in a time machine, back to the Cambrian seas, where the reader sees first-hand the remarkable diversity of life as it existed then. And perhaps most important, Conway Morris examines the lessons to be learned from the Burgess<br />Shale, especially as they apply to modern evolutionary thinking. In particular, he critiques the ideas of Stephen Jay Gould, whose best-selling book Wonderful Life drew on Conway Morris's Burgess Shale work. The author takes a fresh look at the evidence and draws quite different conclusions from<br />Gould on the nature of evolution.<br />This finely illustrated volume takes the reader to the forefront of paleontology as it provides fresh insights into the nature of evolution and of life on earth.",
      "authorName": "Simon Conway-Morris",
      "isbn": "0192862022",
      "userName": "Daniel",
      "userRating": "0",
      "userReadAt": "",
      "userDateAdded": "2025-02-27T05:19:31.000Z",
      "userDateCreated": "2025-02-27T05:19:31.000Z",
      "userShelves": "to-read",
      "userReview": "",
      "averageRating": "4.0",
      "bookPublished": "",
      "description": "<a href=\"https://www.goodreads.com/book/show/295369.The_Crucible_of_Creation?utm_medium=api&amp;utm_source=rss\"><img alt=\"The Crucible of Creation: The Burgess Shale and the Rise of Animals\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1173477627l/295369._SX50_.jpg\" /></a><br/>\n                                      author: Simon Conway-Morris<br/>\n                                      name: Daniel<br/>\n                                      average rating: 4.0<br/>\n                                      book published: <br/>\n                                      rating: 0<br/>\n                                      read at: <br/>\n                                      date added: 2025/02/26<br/>\n                                      shelves: to-read<br/>\n                                      review: <br/><br/>",
      "numPages": "272"
    },
    {
      "id": "https://www.goodreads.com/review/show/7347074498?utm_medium=api&utm_source=rss",
      "title": "Moving Pictures (Discworld, #10; Industrial Revolution, #1)",
      "link": "https://www.goodreads.com/review/show/7347074498?utm_medium=api&utm_source=rss",
      "bookId": "34510",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1320456553l/34510._SY75_.jpg",
      "bookDescription": "Cameras roll - which means the imps inside have to paint really fast - on the fantastic Discworld when the alchemists discover the magic of the silver screen.<br /><br />But what is the dark secret of Holy Wood Hill?<br /><br />As the alien clichés of Tinsel Town pour into the world, it's up to the Disc's first film stars to find out...<br /><br />THRILL as Victor Tugelbend (\"Can't sing. Can't dance. Can handle a sword a little\") and Theda Withel (\"I come from a little town you've probably never even heard of\") battle the forces of evil and cinema advertising...<br /><br />SCREAM as Gaspode the Wonder Dog nearly saves the day...<br /><br />EAT POPCORN as you watch the filming of \"Blown Away,\" the oddest Civil War picture ever made...<br /><br />A Passionate Saga Set Against the background of a World Gone Mad!<br /><br />This Will Amaze You!<br /><br />With a Thousand Elephants!<br /><br />(\"And afterwards, why not dine at Harga's House of Ribs, for the best in international cuisine; only two minutes from this book...\")",
      "authorName": "Terry Pratchett",
      "isbn": "0552152943",
      "userName": "Daniel",
      "userRating": "4",
      "userReadAt": "2025-02-26T00:00:00.000Z",
      "userDateAdded": "2025-02-26T08:15:57.000Z",
      "userDateCreated": "2025-02-23T08:19:32.000Z",
      "userShelves": "",
      "userReview": "",
      "averageRating": "4.0",
      "bookPublished": "1990",
      "description": "<a href=\"https://www.goodreads.com/book/show/34510.Moving_Pictures?utm_medium=api&amp;utm_source=rss\"><img alt=\"Moving Pictures (Discworld, #10; Industrial Revolution, #1)\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1320456553l/34510._SY75_.jpg\" /></a><br/>\n                                      author: Terry Pratchett<br/>\n                                      name: Daniel<br/>\n                                      average rating: 4.0<br/>\n                                      book published: 1990<br/>\n                                      rating: 4<br/>\n                                      read at: 2025/02/26<br/>\n                                      date added: 2025/02/26<br/>\n                                      shelves: <br/>\n                                      review: <br/><br/>",
      "numPages": "396"
    },
    {
      "id": "https://www.goodreads.com/review/show/7353302090?utm_medium=api&utm_source=rss",
      "title": "The Blue Machine: How the Ocean Works",
      "link": "https://www.goodreads.com/review/show/7353302090?utm_medium=api&utm_source=rss",
      "bookId": "123979539",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1680049757l/123979539._SY75_.jpg",
      "bookDescription": "A scientist’s exploration of the \"ocean engine\"―the physics behind the ocean’s systems―and why it matters. All of Earth’s oceans, from the equator to the poles, are a single engine powered by sunlight, driving huge flows of energy, water, life, and raw materials. In The Blue Machine , physicist and oceanographer Helen Czerski illustrates the mechanisms behind this defining feature of our planet, voyaging from the depths of the ocean floor to tropical coral reefs, estuaries that feed into shallow coastal seas, and Arctic ice floes. Through stories of history, culture, and animals, she explains how water temperature, salinity, gravity, and the movement of Earth’s tectonic plates all interact in a complex dance, supporting life at the smallest scale―plankton―and the largest―giant sea turtles, whales, humankind. From the ancient Polynesians who navigated the Pacific by reading the waves, to permanent residents of the deep such as the Greenland shark that can live for hundreds of years, she introduces the messengers, passengers, and voyagers that rely on interlinked systems of vast currents, invisible ocean walls, and underwater waterfalls. Most important, however, Czerski reveals that while the ocean engine has sustained us for thousands of years, today it is faced with urgent threats. By understanding how the ocean works, and its essential role in our global system, we can learn how to protect our blue machine. Timely, elegant, and passionately argued, The Blue Machine presents a fresh perspective on what it means to be a citizen of an ocean planet.",
      "authorName": "Helen Czerski",
      "isbn": "1324006714",
      "userName": "Daniel",
      "userRating": "0",
      "userReadAt": "",
      "userDateAdded": "2025-02-25T07:35:52.000Z",
      "userDateCreated": "2025-02-25T07:35:52.000Z",
      "userShelves": "to-read",
      "userReview": "",
      "averageRating": "4.2",
      "bookPublished": "2023",
      "description": "<a href=\"https://www.goodreads.com/book/show/123979539-the-blue-machine?utm_medium=api&amp;utm_source=rss\"><img alt=\"The Blue Machine: How the Ocean Works\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1680049757l/123979539._SY75_.jpg\" /></a><br/>\n                                      author: Helen Czerski<br/>\n                                      name: Daniel<br/>\n                                      average rating: 4.2<br/>\n                                      book published: 2023<br/>\n                                      rating: 0<br/>\n                                      read at: <br/>\n                                      date added: 2025/02/24<br/>\n                                      shelves: to-read<br/>\n                                      review: <br/><br/>",
      "numPages": "446"
    },
    {
      "id": "https://www.goodreads.com/review/show/5072810485?utm_medium=api&utm_source=rss",
      "title": "Guards! Guards! (Discworld, #8; City Watch, #1)",
      "link": "https://www.goodreads.com/review/show/5072810485?utm_medium=api&utm_source=rss",
      "bookId": "64216",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1431127356l/64216._SY75_.jpg",
      "bookDescription": "This is where the dragons went. They lie... not dead, not asleep, but... dormant. And although the space they occupy isn't like normal space, nevertheless they are packed in tightly. They could put you in mind of a can of sardines, if you thought sardines were huge and scaly. And presumably, somewhere, there's a key...",
      "authorName": "Terry Pratchett",
      "isbn": "0061020648",
      "userName": "Daniel",
      "userRating": "5",
      "userReadAt": "2025-02-22T00:00:00.000Z",
      "userDateAdded": "2025-02-23T07:28:53.000Z",
      "userDateCreated": "2022-10-29T05:45:32.000Z",
      "userShelves": "",
      "userReview": "",
      "averageRating": "4.3",
      "bookPublished": "1989",
      "description": "<a href=\"https://www.goodreads.com/book/show/64216.Guards_Guards_?utm_medium=api&amp;utm_source=rss\"><img alt=\"Guards! Guards! (Discworld, #8; City Watch, #1)\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1431127356l/64216._SY75_.jpg\" /></a><br/>\n                                      author: Terry Pratchett<br/>\n                                      name: Daniel<br/>\n                                      average rating: 4.3<br/>\n                                      book published: 1989<br/>\n                                      rating: 5<br/>\n                                      read at: 2025/02/22<br/>\n                                      date added: 2025/02/22<br/>\n                                      shelves: <br/>\n                                      review: <br/><br/>",
      "numPages": "376"
    },
    {
      "id": "https://www.goodreads.com/review/show/7332021084?utm_medium=api&utm_source=rss",
      "title": "Eric (Discworld, #9; Rincewind, #4)",
      "link": "https://www.goodreads.com/review/show/7332021084?utm_medium=api&utm_source=rss",
      "bookId": "64218",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1377865202l/64218._SY75_.jpg",
      "bookDescription": "Eric is the Discworld's only demonology hacker. Pity he's not very good at it.<br /><br />All he wants is his three wishes granted. Nothing fancy - to be immortal, rule the world, have the most beautiful woman in the world fall madly in love with him, the usual stuff.<br /><br />But instead of a tractable demon, he calls up Rincewind, probably the most incompetent wizard in the universe, and the extremely intractable and hostile form of travel accessory known as the Luggage.<br /><br />With them on his side, Eric's in for a ride through space and time that is bound to make him wish (quite fervently) again - this time that he's never been born.",
      "authorName": "Terry Pratchett",
      "isbn": "0380821214",
      "userName": "Daniel",
      "userRating": "4",
      "userReadAt": "2025-02-19T00:00:00.000Z",
      "userDateAdded": "2025-02-19T08:14:21.000Z",
      "userDateCreated": "2025-02-18T08:11:44.000Z",
      "userShelves": "",
      "userReview": "",
      "averageRating": "3.8",
      "bookPublished": "1990",
      "description": "<a href=\"https://www.goodreads.com/book/show/64218.Eric?utm_medium=api&amp;utm_source=rss\"><img alt=\"Eric (Discworld, #9; Rincewind, #4)\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1377865202l/64218._SY75_.jpg\" /></a><br/>\n                                      author: Terry Pratchett<br/>\n                                      name: Daniel<br/>\n                                      average rating: 3.8<br/>\n                                      book published: 1990<br/>\n                                      rating: 4<br/>\n                                      read at: 2025/02/19<br/>\n                                      date added: 2025/02/19<br/>\n                                      shelves: <br/>\n                                      review: <br/><br/>",
      "numPages": "197"
    },
    {
      "id": "https://www.goodreads.com/review/show/7335105469?utm_medium=api&utm_source=rss",
      "title": "Faust, Part Two",
      "link": "https://www.goodreads.com/review/show/7335105469?utm_medium=api&utm_source=rss",
      "bookId": "14707",
      "bookImageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1391132354l/14707._SX50_.jpg",
      "bookDescription": "This is a new translation of Faust, Part Two by David Luke, whose translation of Faust, Part I was the winner of the European Poetry Translation Prize. Here, Luke expertly imitates the varied verse-forms of the original, and provides a highly readable and actable translation which includes an<br />introduction, full notes, and an index of classical mythology.",
      "authorName": "Johann Wolfgang von Goethe",
      "isbn": "0192836366",
      "userName": "Daniel",
      "userRating": "0",
      "userReadAt": "",
      "userDateAdded": "2025-02-19T06:54:48.000Z",
      "userDateCreated": "2025-02-19T06:54:48.000Z",
      "userShelves": "to-read",
      "userReview": "",
      "averageRating": "3.7",
      "bookPublished": "1832",
      "description": "<a href=\"https://www.goodreads.com/book/show/14707.Faust_Part_Two?utm_medium=api&amp;utm_source=rss\"><img alt=\"Faust, Part Two\" src=\"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1391132354l/14707._SX50_.jpg\" /></a><br/>\n                                      author: Johann Wolfgang von Goethe<br/>\n                                      name: Daniel<br/>\n                                      average rating: 3.7<br/>\n                                      book published: 1832<br/>\n                                      rating: 0<br/>\n                                      read at: <br/>\n                                      date added: 2025/02/18<br/>\n                                      shelves: to-read<br/>\n                                      review: <br/><br/>",
      "numPages": "304"
    }
  ]
}